{"pageProps":{"metadata":{"slug":"job-search-efforts-during-march-meeting","filename":"2023-04-05-job-search-efforts-during-march-meeting.md","date":"2023-04-05","title":".doc | Job Search Efforts During March Meeting","layout":"post","keywords":["doc"],"excerpt":"[Translated by ChatGPT] 2 interviews and 1 focus session during March Meeting 2023.","content":"\n### Before the Meeting\n\nThe March meeting will be held in Las Vegas this year.\n\nIt's about two weeks away from the conference, and I developed folliculitis at the base of my chin where I have a beard. It quickly worsened into herpes zoster, commonly known as \"internal heat\" in Chinese medicine. The second semester of the American academic year ends in May, and I haven't made much progress on my thesis. I can't find a job, and the application season for postdoctoral programs is in full swing with paper submissions. I watched helplessly as the application deadlines for two projects passed by. The postdoctoral project shared by a neighboring research group reposted their job advertisement online shortly after I submitted my application materials. I also applied to two research institutes in Germany, with one already sending a rejection letter and the other not responding at all. In addition to all this, I need to prepare for my presentation at the conference. It's no wonder I'm feeling stressed.\n\nOn Friday, we had a rehearsal for the group's presentations. I had initially planned to reuse the slides from last year's conference but realized that the main content from my paper was missing. It made me realize that I had indeed accomplished quite a bit over the past year. After receiving the rejection letter from the German research institute, I felt down for a day. However, the trend of using ChatGPT quickly gained popularity. So I compiled a list of professors I had heard of during my doctoral studies and fed their research group homepage descriptions, along with an abstract of my paper generated by AI, to ChatGPT, asking it to compose an email. The result was decent, and I received a reply inviting me to meet during the conference. The person who responded is a well-known researcher who studies animal behavior using a cross-scale approach and manages two research groups in Europe and East Asia. They made a big impression at last year's conference and later came to give a lecture at my university. We had lunch together. Shortly before the meeting, someone on the APS (American Physical Society) mailing list sent a mass email advertising a job opportunity. It turns out they are the current postdoc who will soon start a faculty position at a university in the western United States. Interestingly, they are currently working at the German research institute that rejected me. I can't help but feel a mix of envy and satisfaction knowing that they also fell for the ChatGPT-generated email trick.\n\n### Meeting\n\nI walked to the conference venue and checked in. I received a name tag, which was just a thick piece of paper hanging from a string, without even a plastic cover.\n\nAfter checking in, I surveyed the layout of the conference venue. The rooms related to biophysics were located on both sides of the first intersection in the main corridor. Each doorway had display boards indicating the themes of the speeches for each time slot. Unlike last year when I was the only one from our team attending, this year all three members of our team have presentations. In addition, Katie, a former master's student in our group, and her current classmates also have presentations. When I marked the schedule, I found that most of the interesting sessions conflicted with each other. Although I have social anxiety, I still feel that interpersonal relationships are important. Or perhaps it's because of my social anxiety that I feel interpersonal relationships are more important?\n\nBack at the hotel, I received a reply from my group email to confirm a time one or two weeks after the March meeting for a remote interview. The purpose is for me to introduce my current work and explain how I can contribute to his laboratory. It's a bit unexpected because his group email mentioned that he would attend the conference, and my email also stated that I was willing to meet during the conference. Does this reply imply a lack of interest? I feel a little disappointed.\n\n### Interview 1\n\nWhen I was wandering between different sub-venues and arrived late to one where the seats were already filled, I had to stand at the back. While I was standing and listening in one of the venues, a guy wearing a green jacket and carrying a sports backpack walked in. He listened for a while and then left. He seemed somewhat familiar, resembling the photos on ChatGPT's personal website.\n\nCurious, I discreetly left the venue and saw him talking to a friend in the corridor, with the name tag on the front of his chest turned over. I temporarily left and explored around, discovering that coffee was available in the main corridor. I lined up and got a cup, then came back to investigate and confirmed it was him.\n\nI greeted him, and it turned out that ChatGPT had been too verbose in his email and only mentioned that he was also attending the conference in March at the very end. I asked him when my presentation was scheduled and if he planned to attend, so we wouldn't need a Zoom meeting.\n\nThe title of my presentation during that time slot was quite peculiar, and it didn't seem to have much relevance to what I was working on. When I entered the waiting area, I noticed that apart from the two of us from our lab, all the other presentations in that session were focused on the same pattern and structure of a particular model organism. Our presentation came at the very end of the session, and I felt we performed well. When I started addressing the topic, I made a joke using the session's title, and we finished right on time. ChatGPT arrived at the venue about half an hour before my presentation, and after we finished, he left without coming up to talk to me.\n\nAfterward, back at the hotel, I received an email from him, inviting me to meet the next afternoon. I searched his schedule on the conference website and found that it was right after his presentation. Looking at the title of his talk, it seemed to be about his recent paper. I fed the article into an AI tool to generate an abstract but didn't get a chance to read it before my classmates pulled me away to play...\n\nHis presentation was scheduled for the next afternoon and fell in the middle of the overall time slot. I entered the venue at the beginning of the session, and he arrived a little later, sat for a while, and then left. The venue was twice as large as when I gave my presentation, but it wasn't completely filled. While he was speaking, I was reviewing the article summary generated by AI from yesterday, feeling that it contained more information than most of the presentations I had heard up until that point. His presentation skills were also far above the average level. His research targeted a biological system one level higher than my current research focus, but the approach and process seemed similar. His research was much more advanced, both in theory and experimentation. Although the theory seemed to be a fairly traditional model in the field, it was still much better than just presenting experimental data like we did.\n\nAfter the conference, we met in the corridor and found two seats. I showed him my slides, and he went through all the details, confirming that I would be working on gene editing in our lab's model organism. He also asked about the proportion of my work within the entire project.\n\nThen, he asked a question that felt as significant as being confessed to in a romantic relationship: \"What is the central question guiding your research career?\" Ah, my brain immediately crashed. Seeing me struggling, the guy said I could speak in Chinese, as he understood it but couldn't speak it. Finally, when I felt cornered, I told the truth - I just wanted to coast through academia, eat and wait for death. If\n\n ChatGPT has arrived, and we have super-intelligent AI, who needs physics anymore? Physics doesn't exist anymore. The guy chuckled at my response.\n\nHe then asked me to ask questions. I inquired about the duration of holidays, and he replied that it followed the school's policy. Those who have cultured cells should know that they might have to go to the school on weekends, so as long as the workload is sufficient, there are no attendance requirements on weekdays.\n\nOverall, the conversation went quite smoothly. In the end, he mentioned that he would send me an email and asked for two or three ways to contact me, as well as a recommendation letter.\n\n### Interview 2\n\nOriginally, I had a good impression of this esteemed person, but since it was the first day of the conference, I thought maybe everyone hadn't settled in yet. Therefore, I sent an email on Tuesday to confirm the meeting time, and as a result, we arranged to meet on Friday at noon, next to the DBIO service desk.\n\nI had planned to prepare in advance, as his research group had three or four presentations, but most of them clashed with my own presentation or the previous interview. In the end, I only attended one of them.\n\nFriday at noon turned out to be the last session of the entire conference. The DBIO table had already been removed, and everyone seemed eager to leave. After about ten minutes past 12 o'clock, I finally met the person, and five minutes later, the person I was talking to left. Everyone was busy packing up and closing the doors. We found an empty room with a table and chairs that had already been moved out. Inside the room, there was only one student lying on the floor sleeping. The two of us sat down facing each other on the floor.\n\nJust as I was about to take out my computer to go over my presentation, he waved his hand and asked me to briefly summarize my work orally. The subsequent series of questions and answers followed the same style, with the two of us sitting on the floor, exchanging rapid-fire questions and quick responses, resembling the agility of Zen. He started by asking why I chose to pursue my current work. I thought I gave a decent answer, but as I spoke, I realized that it was the answer from the previous interview. Why didn't I think of that earlier? Feeling a bit too pleased with myself, I forgot that this esteemed person was focused on studying behavior, not organizational structure. It could have been easily smoothed over, but I didn't handle it well. Then he asked about my favorite course during my undergraduate studies, a question he mentioned during our lunch break, so I pretended to be impressive. After that, he asked two significant questions: \"How did a stinky experimenter like you end up begging for food in our theoretical group?\" and \"How did a stinky structuralist like you end up begging for food in our behavioral research field?\" I didn't answer them well. Earlier, in my self-satisfaction, I mentioned having another job offer, which led to both sides being somewhat perfunctory during the latter part of the conversation.\n\nFinally, he briefed me that the research in East Asia has sufficient funding, although he spends a considerable amount of time there every year, it's not always possible to meet in person for guidance. Regarding Europe, if I decide to join, he would need to specifically apply for funding. The meaning behind this was quite clear, so we politely agreed to take some time to consider it and said we could stay in touch via email in the future.\n\n### Symposium\n\nThe symposium actually took place on the afternoon of the same day as my speech, right before the two interviews.\n\nThe so-called symposium was organized by several research institutions in Germany and aimed to promote information related to research conducted in Germany. It was quite far from the venues of the biophysics sessions. After my friend Katie finished her speech, I slipped out of the venue and rushed over. By the time I arrived, it had already begun. There were bagels, jam, and cheese on both sides of the entrance, and it was the first time in many days that I had lunch.\n\nThere were six or seven round tables in the venue, each with a small label indicating the name of a research institution. There were one or two staff members from each corresponding institute sitting at the tables. The host introduced each research institution in turn and gave the leaders of the institutions three to five minutes to introduce themselves. After that, it was free time. I noticed that the Max Planck Institute's table was near the bread, and since the other institutions didn't seem to focus much on basic scientific research, I found a chair and sat down. The head of the Max Planck Institute was an elder with white hair. His attire was more formal compared to the other participants, and he had a strong presence, resembling a wise figure.\n\nThe first question was about the difficulty of immigrating to Germany and whether Germany was somewhat exclusive. The elder replied that Germany is currently one of the most open countries in terms of immigration policies. Considering the phrase \"one of the,\" and also taking into account that foreign graduates in non-academic positions in the beacon country have to draw lots to obtain a work visa, excluding the \"borderline,\" this answer could not be considered wrong. Deutsche Welle had previously released a video with a similar statement, but that video had a follow-up phrase of \"aber...\" (but...).\n\nSomeone then asked about the projects and job structure at the Max Planck Institute. The answer was similar to what I had previously understood. Each research institution has the authority to recruit its own researchers. The duration of a postdoctoral position is generally two years, with extensions to three years or longer only when necessary. At the Max Planck Institute, except for the director, there are hardly any permanent positions for research positions. The institute serves as a stepping stone for researchers before they secure a permanent faculty position. However, whether it was a government regulation or something else, there was a rule stating that nine years after obtaining a doctoral degree, the employing institution must provide a permanent position. As a result, individuals are often dismissed before the end of those nine years. It wasn't asked whether this contradicted the previous answer.\n\nWhen asked what kind of research the Max Planck Institute favors, the elder explicitly stated that they prefer more challenging and ambitious topics rather than safe topics pursued solely to obtain a faculty position. He even specifically mentioned the aim to explore topics and scholars that have the potential to receive Nobel Prizes in the future. This naturally differs from the American-style notion of verbal freedom and the actual practice of focusing on safe bets. It's interesting how the understanding of pragmatism can differ so greatly between two cultures—one rooted in long-term plans and top-down designs, and the other more focused on short-term gains.\n\nSomeone also asked about the criteria for selecting applicants at the Max Planck Institute. The answer was that each research institution has its own criteria. However, he also mentioned his own criteria: academic performance is the main factor, and when conducting research, one should have a clear understanding of the underlying physics. So, how is academic performance judged? It mainly depends on attending prestigious schools, followed by academic rankings. If the school's name is less well-known, higher academic rankings are expected. The answer was sincere, and it didn't evoke any sense of objection towards such obvious discrimination based on one's undergraduate alma mater, nor did it provoke any intention to challenge it.\n\nThis response is clearly targeting the American model, which emphasizes research experience and places greater importance on the authorship of papers. The backbone of a research group consists of Ph.D. students who do not need to spend time attending classes. How much contribution can undergraduate students applying for a Ph.D. make to the entire project? Moreover, these contributions are largely made by sacrificing their efforts in coursework. The sentence highlighted above is a sarcastic comment on this matter. Furthermore, considering the notorious reputation of the academic environment in China, overseas research experience is typically required. Apart from special programs like the Everest Plan that provide scholarships, most students have to self-fund and contact foreign mentors. This not only turns academic selection into a disparity unrelated to academia, linked instead to students' economic conditions, but also fosters an intermediary industry that sells such information. What academic justice is there in this policy?\n\nHowever, let's consider how much academic performance can be reflected in a transcript. How many students openly ask their professors for grades when they intend to study abroad? Until a few years ago, there were even legitimate operations like \"passing and retaking\" courses at certain universities to alter transcripts. Not to mention the highly similar nature of examination questions across different subjects in China, which is detrimental to stability and unity. If attending prestigious schools is a requirement, then going abroad after high school graduation has far more advantages than going after undergraduate studies. It becomes a class-based filtering process, leading to the same destination through different paths.\n\nBoth of these scenarios involve individuals, each operating under a different moral framework, which is gradually deconstructed and distorted when translated into executable actions. Throughout this process, their own judgment is constantly outsourced. Outsourcing itself is not a problem, as division of labor is both a reflection of societal development and an important driving force. However, let's take an airplane as an example. Safely delivering passengers to their destinations requires coordination and trust between the crew and ground staff, but the safe arrival ultimately has objective standards. In the education and research system, the outcomes of its own cultivation are digested by itself. The selection process inherently involves the phenomenon of athletes acting as both players and referees. Some of the selected individuals may not be competent, while some of the non-selected ones may be capable. In that case, it would be straightforward: allocate all resources to the winners and cut off the paths for the losers...\n\nBoth models, in their mediocrity, peck at each other, and neither can replace the other. Ultimately, today's physics itself is lackluster. Leaving aside the magnificent breakthroughs during the birth of quantum mechanics and relativity, even the process of constructing the standard model was full of ad hoc solutions. Today, it is difficult to hope for its complete reversal. How much of the knowledge you solidly understand can be applied in your actual research? How many valuable works have you produced over these years of early involvement in research? Young people consider matters they believe are crucial to their future and destiny, but it is nothing more than a few bytes in their boss's email inbox. Whether they accept you or someone else, the difference is insignificant.\n\nIn short, there are no heroes in our time, which allows mediocre individuals to gain fame.\n\nIn the afternoon, a lady who had a conversation with \"群发哥\" (a nickname) the day before gave a speech shortly after him. Looking at her organization on the first page of the presentation slides, it seemed that she was a junior colleague in his doctoral laboratory and was about to join his current research institute. ~~In other words, she is the enemy who took away my offer~~. So, I posted a complaint in my friend circle. Her speech exceeded the allotted time and was interrupted by the host. I was about to\n\n add a comment saying \"Exceeded the time, so bad,\" but considering that I had been posting quite a lot on my friend circle in the past few days, I refrained.\n\nThe only person I admired during my four years in university, \"峰神\" (a nickname), replied below, saying he had also considered applying to the same research institute. I asked him where he is now, and a few minutes later, I saw his reply: \"Already started working.\" I quickly teased him, saying \"Rich brother, lend me 50 yuan.\" However, the words spoken at the meeting reverberated in my mind, sighing and turning into a deep breath. I silently put away my phone.\n"},"tocStr":"{\"index\":null,\"endIndex\":null,\"map\":{\"type\":\"list\",\"ordered\":false,\"spread\":false,\"children\":[{\"type\":\"listItem\",\"spread\":false,\"children\":[{\"type\":\"paragraph\",\"children\":[{\"type\":\"link\",\"title\":null,\"url\":\"#before-the-meeting\",\"children\":[{\"type\":\"text\",\"value\":\"Before the Meeting\"}]}]}]},{\"type\":\"listItem\",\"spread\":false,\"children\":[{\"type\":\"paragraph\",\"children\":[{\"type\":\"link\",\"title\":null,\"url\":\"#meeting\",\"children\":[{\"type\":\"text\",\"value\":\"Meeting\"}]}]}]},{\"type\":\"listItem\",\"spread\":false,\"children\":[{\"type\":\"paragraph\",\"children\":[{\"type\":\"link\",\"title\":null,\"url\":\"#interview-1\",\"children\":[{\"type\":\"text\",\"value\":\"Interview 1\"}]}]}]},{\"type\":\"listItem\",\"spread\":false,\"children\":[{\"type\":\"paragraph\",\"children\":[{\"type\":\"link\",\"title\":null,\"url\":\"#interview-2\",\"children\":[{\"type\":\"text\",\"value\":\"Interview 2\"}]}]}]},{\"type\":\"listItem\",\"spread\":false,\"children\":[{\"type\":\"paragraph\",\"children\":[{\"type\":\"link\",\"title\":null,\"url\":\"#symposium\",\"children\":[{\"type\":\"text\",\"value\":\"Symposium\"}]}]}]}]}}","htmlAst":{"type":"root","children":[{"type":"element","tagName":"h3","properties":{"id":"before-the-meeting"},"children":[{"type":"element","tagName":"a","properties":{"href":"#before-the-meeting"},"children":[{"type":"text","value":"Before the Meeting","position":{"start":{"line":2,"column":5,"offset":5},"end":{"line":2,"column":23,"offset":23}}}]}],"position":{"start":{"line":2,"column":1,"offset":1},"end":{"line":2,"column":23,"offset":23}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The March meeting will be held in Las Vegas this year.","position":{"start":{"line":4,"column":1,"offset":25},"end":{"line":4,"column":55,"offset":79}}}],"position":{"start":{"line":4,"column":1,"offset":25},"end":{"line":4,"column":55,"offset":79}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"It's about two weeks away from the conference, and I developed folliculitis at the base of my chin where I have a beard. It quickly worsened into herpes zoster, commonly known as \"internal heat\" in Chinese medicine. The second semester of the American academic year ends in May, and I haven't made much progress on my thesis. I can't find a job, and the application season for postdoctoral programs is in full swing with paper submissions. I watched helplessly as the application deadlines for two projects passed by. The postdoctoral project shared by a neighboring research group reposted their job advertisement online shortly after I submitted my application materials. I also applied to two research institutes in Germany, with one already sending a rejection letter and the other not responding at all. In addition to all this, I need to prepare for my presentation at the conference. It's no wonder I'm feeling stressed.","position":{"start":{"line":6,"column":1,"offset":81},"end":{"line":6,"column":928,"offset":1008}}}],"position":{"start":{"line":6,"column":1,"offset":81},"end":{"line":6,"column":928,"offset":1008}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"On Friday, we had a rehearsal for the group's presentations. I had initially planned to reuse the slides from last year's conference but realized that the main content from my paper was missing. It made me realize that I had indeed accomplished quite a bit over the past year. After receiving the rejection letter from the German research institute, I felt down for a day. However, the trend of using ChatGPT quickly gained popularity. So I compiled a list of professors I had heard of during my doctoral studies and fed their research group homepage descriptions, along with an abstract of my paper generated by AI, to ChatGPT, asking it to compose an email. The result was decent, and I received a reply inviting me to meet during the conference. The person who responded is a well-known researcher who studies animal behavior using a cross-scale approach and manages two research groups in Europe and East Asia. They made a big impression at last year's conference and later came to give a lecture at my university. We had lunch together. Shortly before the meeting, someone on the APS (American Physical Society) mailing list sent a mass email advertising a job opportunity. It turns out they are the current postdoc who will soon start a faculty position at a university in the western United States. Interestingly, they are currently working at the German research institute that rejected me. I can't help but feel a mix of envy and satisfaction knowing that they also fell for the ChatGPT-generated email trick.","position":{"start":{"line":8,"column":1,"offset":1010},"end":{"line":8,"column":1519,"offset":2528}}}],"position":{"start":{"line":8,"column":1,"offset":1010},"end":{"line":8,"column":1519,"offset":2528}}},{"type":"text","value":"\n"},{"type":"element","tagName":"h3","properties":{"id":"meeting"},"children":[{"type":"element","tagName":"a","properties":{"href":"#meeting"},"children":[{"type":"text","value":"Meeting","position":{"start":{"line":10,"column":5,"offset":2534},"end":{"line":10,"column":12,"offset":2541}}}]}],"position":{"start":{"line":10,"column":1,"offset":2530},"end":{"line":10,"column":12,"offset":2541}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I walked to the conference venue and checked in. I received a name tag, which was just a thick piece of paper hanging from a string, without even a plastic cover.","position":{"start":{"line":12,"column":1,"offset":2543},"end":{"line":12,"column":163,"offset":2705}}}],"position":{"start":{"line":12,"column":1,"offset":2543},"end":{"line":12,"column":163,"offset":2705}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"After checking in, I surveyed the layout of the conference venue. The rooms related to biophysics were located on both sides of the first intersection in the main corridor. Each doorway had display boards indicating the themes of the speeches for each time slot. Unlike last year when I was the only one from our team attending, this year all three members of our team have presentations. In addition, Katie, a former master's student in our group, and her current classmates also have presentations. When I marked the schedule, I found that most of the interesting sessions conflicted with each other. Although I have social anxiety, I still feel that interpersonal relationships are important. Or perhaps it's because of my social anxiety that I feel interpersonal relationships are more important?","position":{"start":{"line":14,"column":1,"offset":2707},"end":{"line":14,"column":801,"offset":3507}}}],"position":{"start":{"line":14,"column":1,"offset":2707},"end":{"line":14,"column":801,"offset":3507}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Back at the hotel, I received a reply from my group email to confirm a time one or two weeks after the March meeting for a remote interview. The purpose is for me to introduce my current work and explain how I can contribute to his laboratory. It's a bit unexpected because his group email mentioned that he would attend the conference, and my email also stated that I was willing to meet during the conference. Does this reply imply a lack of interest? I feel a little disappointed.","position":{"start":{"line":16,"column":1,"offset":3509},"end":{"line":16,"column":484,"offset":3992}}}],"position":{"start":{"line":16,"column":1,"offset":3509},"end":{"line":16,"column":484,"offset":3992}}},{"type":"text","value":"\n"},{"type":"element","tagName":"h3","properties":{"id":"interview-1"},"children":[{"type":"element","tagName":"a","properties":{"href":"#interview-1"},"children":[{"type":"text","value":"Interview 1","position":{"start":{"line":18,"column":5,"offset":3998},"end":{"line":18,"column":16,"offset":4009}}}]}],"position":{"start":{"line":18,"column":1,"offset":3994},"end":{"line":18,"column":16,"offset":4009}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When I was wandering between different sub-venues and arrived late to one where the seats were already filled, I had to stand at the back. While I was standing and listening in one of the venues, a guy wearing a green jacket and carrying a sports backpack walked in. He listened for a while and then left. He seemed somewhat familiar, resembling the photos on ChatGPT's personal website.","position":{"start":{"line":20,"column":1,"offset":4011},"end":{"line":20,"column":388,"offset":4398}}}],"position":{"start":{"line":20,"column":1,"offset":4011},"end":{"line":20,"column":388,"offset":4398}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Curious, I discreetly left the venue and saw him talking to a friend in the corridor, with the name tag on the front of his chest turned over. I temporarily left and explored around, discovering that coffee was available in the main corridor. I lined up and got a cup, then came back to investigate and confirmed it was him.","position":{"start":{"line":22,"column":1,"offset":4400},"end":{"line":22,"column":325,"offset":4724}}}],"position":{"start":{"line":22,"column":1,"offset":4400},"end":{"line":22,"column":325,"offset":4724}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I greeted him, and it turned out that ChatGPT had been too verbose in his email and only mentioned that he was also attending the conference in March at the very end. I asked him when my presentation was scheduled and if he planned to attend, so we wouldn't need a Zoom meeting.","position":{"start":{"line":24,"column":1,"offset":4726},"end":{"line":24,"column":279,"offset":5004}}}],"position":{"start":{"line":24,"column":1,"offset":4726},"end":{"line":24,"column":279,"offset":5004}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The title of my presentation during that time slot was quite peculiar, and it didn't seem to have much relevance to what I was working on. When I entered the waiting area, I noticed that apart from the two of us from our lab, all the other presentations in that session were focused on the same pattern and structure of a particular model organism. Our presentation came at the very end of the session, and I felt we performed well. When I started addressing the topic, I made a joke using the session's title, and we finished right on time. ChatGPT arrived at the venue about half an hour before my presentation, and after we finished, he left without coming up to talk to me.","position":{"start":{"line":26,"column":1,"offset":5006},"end":{"line":26,"column":678,"offset":5683}}}],"position":{"start":{"line":26,"column":1,"offset":5006},"end":{"line":26,"column":678,"offset":5683}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Afterward, back at the hotel, I received an email from him, inviting me to meet the next afternoon. I searched his schedule on the conference website and found that it was right after his presentation. Looking at the title of his talk, it seemed to be about his recent paper. I fed the article into an AI tool to generate an abstract but didn't get a chance to read it before my classmates pulled me away to play...","position":{"start":{"line":28,"column":1,"offset":5685},"end":{"line":28,"column":416,"offset":6100}}}],"position":{"start":{"line":28,"column":1,"offset":5685},"end":{"line":28,"column":416,"offset":6100}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"His presentation was scheduled for the next afternoon and fell in the middle of the overall time slot. I entered the venue at the beginning of the session, and he arrived a little later, sat for a while, and then left. The venue was twice as large as when I gave my presentation, but it wasn't completely filled. While he was speaking, I was reviewing the article summary generated by AI from yesterday, feeling that it contained more information than most of the presentations I had heard up until that point. His presentation skills were also far above the average level. His research targeted a biological system one level higher than my current research focus, but the approach and process seemed similar. His research was much more advanced, both in theory and experimentation. Although the theory seemed to be a fairly traditional model in the field, it was still much better than just presenting experimental data like we did.","position":{"start":{"line":30,"column":1,"offset":6102},"end":{"line":30,"column":934,"offset":7035}}}],"position":{"start":{"line":30,"column":1,"offset":6102},"end":{"line":30,"column":934,"offset":7035}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"After the conference, we met in the corridor and found two seats. I showed him my slides, and he went through all the details, confirming that I would be working on gene editing in our lab's model organism. He also asked about the proportion of my work within the entire project.","position":{"start":{"line":32,"column":1,"offset":7037},"end":{"line":32,"column":280,"offset":7316}}}],"position":{"start":{"line":32,"column":1,"offset":7037},"end":{"line":32,"column":280,"offset":7316}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Then, he asked a question that felt as significant as being confessed to in a romantic relationship: \"What is the central question guiding your research career?\" Ah, my brain immediately crashed. Seeing me struggling, the guy said I could speak in Chinese, as he understood it but couldn't speak it. Finally, when I felt cornered, I told the truth - I just wanted to coast through academia, eat and wait for death. If","position":{"start":{"line":34,"column":1,"offset":7318},"end":{"line":34,"column":418,"offset":7735}}}],"position":{"start":{"line":34,"column":1,"offset":7318},"end":{"line":34,"column":418,"offset":7735}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"ChatGPT has arrived, and we have super-intelligent AI, who needs physics anymore? Physics doesn't exist anymore. The guy chuckled at my response.","position":{"start":{"line":36,"column":2,"offset":7738},"end":{"line":36,"column":147,"offset":7883}}}],"position":{"start":{"line":36,"column":2,"offset":7738},"end":{"line":36,"column":147,"offset":7883}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"He then asked me to ask questions. I inquired about the duration of holidays, and he replied that it followed the school's policy. Those who have cultured cells should know that they might have to go to the school on weekends, so as long as the workload is sufficient, there are no attendance requirements on weekdays.","position":{"start":{"line":38,"column":1,"offset":7885},"end":{"line":38,"column":319,"offset":8203}}}],"position":{"start":{"line":38,"column":1,"offset":7885},"end":{"line":38,"column":319,"offset":8203}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Overall, the conversation went quite smoothly. In the end, he mentioned that he would send me an email and asked for two or three ways to contact me, as well as a recommendation letter.","position":{"start":{"line":40,"column":1,"offset":8205},"end":{"line":40,"column":186,"offset":8390}}}],"position":{"start":{"line":40,"column":1,"offset":8205},"end":{"line":40,"column":186,"offset":8390}}},{"type":"text","value":"\n"},{"type":"element","tagName":"h3","properties":{"id":"interview-2"},"children":[{"type":"element","tagName":"a","properties":{"href":"#interview-2"},"children":[{"type":"text","value":"Interview 2","position":{"start":{"line":42,"column":5,"offset":8396},"end":{"line":42,"column":16,"offset":8407}}}]}],"position":{"start":{"line":42,"column":1,"offset":8392},"end":{"line":42,"column":16,"offset":8407}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Originally, I had a good impression of this esteemed person, but since it was the first day of the conference, I thought maybe everyone hadn't settled in yet. Therefore, I sent an email on Tuesday to confirm the meeting time, and as a result, we arranged to meet on Friday at noon, next to the DBIO service desk.","position":{"start":{"line":44,"column":1,"offset":8409},"end":{"line":44,"column":313,"offset":8721}}}],"position":{"start":{"line":44,"column":1,"offset":8409},"end":{"line":44,"column":313,"offset":8721}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I had planned to prepare in advance, as his research group had three or four presentations, but most of them clashed with my own presentation or the previous interview. In the end, I only attended one of them.","position":{"start":{"line":46,"column":1,"offset":8723},"end":{"line":46,"column":210,"offset":8932}}}],"position":{"start":{"line":46,"column":1,"offset":8723},"end":{"line":46,"column":210,"offset":8932}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Friday at noon turned out to be the last session of the entire conference. The DBIO table had already been removed, and everyone seemed eager to leave. After about ten minutes past 12 o'clock, I finally met the person, and five minutes later, the person I was talking to left. Everyone was busy packing up and closing the doors. We found an empty room with a table and chairs that had already been moved out. Inside the room, there was only one student lying on the floor sleeping. The two of us sat down facing each other on the floor.","position":{"start":{"line":48,"column":1,"offset":8934},"end":{"line":48,"column":537,"offset":9470}}}],"position":{"start":{"line":48,"column":1,"offset":8934},"end":{"line":48,"column":537,"offset":9470}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Just as I was about to take out my computer to go over my presentation, he waved his hand and asked me to briefly summarize my work orally. The subsequent series of questions and answers followed the same style, with the two of us sitting on the floor, exchanging rapid-fire questions and quick responses, resembling the agility of Zen. He started by asking why I chose to pursue my current work. I thought I gave a decent answer, but as I spoke, I realized that it was the answer from the previous interview. Why didn't I think of that earlier? Feeling a bit too pleased with myself, I forgot that this esteemed person was focused on studying behavior, not organizational structure. It could have been easily smoothed over, but I didn't handle it well. Then he asked about my favorite course during my undergraduate studies, a question he mentioned during our lunch break, so I pretended to be impressive. After that, he asked two significant questions: \"How did a stinky experimenter like you end up begging for food in our theoretical group?\" and \"How did a stinky structuralist like you end up begging for food in our behavioral research field?\" I didn't answer them well. Earlier, in my self-satisfaction, I mentioned having another job offer, which led to both sides being somewhat perfunctory during the latter part of the conversation.","position":{"start":{"line":50,"column":1,"offset":9472},"end":{"line":50,"column":1344,"offset":10815}}}],"position":{"start":{"line":50,"column":1,"offset":9472},"end":{"line":50,"column":1344,"offset":10815}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Finally, he briefed me that the research in East Asia has sufficient funding, although he spends a considerable amount of time there every year, it's not always possible to meet in person for guidance. Regarding Europe, if I decide to join, he would need to specifically apply for funding. The meaning behind this was quite clear, so we politely agreed to take some time to consider it and said we could stay in touch via email in the future.","position":{"start":{"line":52,"column":1,"offset":10817},"end":{"line":52,"column":443,"offset":11259}}}],"position":{"start":{"line":52,"column":1,"offset":10817},"end":{"line":52,"column":443,"offset":11259}}},{"type":"text","value":"\n"},{"type":"element","tagName":"h3","properties":{"id":"symposium"},"children":[{"type":"element","tagName":"a","properties":{"href":"#symposium"},"children":[{"type":"text","value":"Symposium","position":{"start":{"line":54,"column":5,"offset":11265},"end":{"line":54,"column":14,"offset":11274}}}]}],"position":{"start":{"line":54,"column":1,"offset":11261},"end":{"line":54,"column":14,"offset":11274}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The symposium actually took place on the afternoon of the same day as my speech, right before the two interviews.","position":{"start":{"line":56,"column":1,"offset":11276},"end":{"line":56,"column":114,"offset":11389}}}],"position":{"start":{"line":56,"column":1,"offset":11276},"end":{"line":56,"column":114,"offset":11389}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The so-called symposium was organized by several research institutions in Germany and aimed to promote information related to research conducted in Germany. It was quite far from the venues of the biophysics sessions. After my friend Katie finished her speech, I slipped out of the venue and rushed over. By the time I arrived, it had already begun. There were bagels, jam, and cheese on both sides of the entrance, and it was the first time in many days that I had lunch.","position":{"start":{"line":58,"column":1,"offset":11391},"end":{"line":58,"column":473,"offset":11863}}}],"position":{"start":{"line":58,"column":1,"offset":11391},"end":{"line":58,"column":473,"offset":11863}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"There were six or seven round tables in the venue, each with a small label indicating the name of a research institution. There were one or two staff members from each corresponding institute sitting at the tables. The host introduced each research institution in turn and gave the leaders of the institutions three to five minutes to introduce themselves. After that, it was free time. I noticed that the Max Planck Institute's table was near the bread, and since the other institutions didn't seem to focus much on basic scientific research, I found a chair and sat down. The head of the Max Planck Institute was an elder with white hair. His attire was more formal compared to the other participants, and he had a strong presence, resembling a wise figure.","position":{"start":{"line":60,"column":1,"offset":11865},"end":{"line":60,"column":760,"offset":12624}}}],"position":{"start":{"line":60,"column":1,"offset":11865},"end":{"line":60,"column":760,"offset":12624}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The first question was about the difficulty of immigrating to Germany and whether Germany was somewhat exclusive. The elder replied that Germany is currently one of the most open countries in terms of immigration policies. Considering the phrase \"one of the,\" and also taking into account that foreign graduates in non-academic positions in the beacon country have to draw lots to obtain a work visa, excluding the \"borderline,\" this answer could not be considered wrong. Deutsche Welle had previously released a video with a similar statement, but that video had a follow-up phrase of \"aber...\" (but...).","position":{"start":{"line":62,"column":1,"offset":12626},"end":{"line":62,"column":606,"offset":13231}}}],"position":{"start":{"line":62,"column":1,"offset":12626},"end":{"line":62,"column":606,"offset":13231}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Someone then asked about the projects and job structure at the Max Planck Institute. The answer was similar to what I had previously understood. Each research institution has the authority to recruit its own researchers. The duration of a postdoctoral position is generally two years, with extensions to three years or longer only when necessary. At the Max Planck Institute, except for the director, there are hardly any permanent positions for research positions. The institute serves as a stepping stone for researchers before they secure a permanent faculty position. However, whether it was a government regulation or something else, there was a rule stating that nine years after obtaining a doctoral degree, the employing institution must provide a permanent position. As a result, individuals are often dismissed before the end of those nine years. It wasn't asked whether this contradicted the previous answer.","position":{"start":{"line":64,"column":1,"offset":13233},"end":{"line":64,"column":920,"offset":14152}}}],"position":{"start":{"line":64,"column":1,"offset":13233},"end":{"line":64,"column":920,"offset":14152}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When asked what kind of research the Max Planck Institute favors, the elder explicitly stated that they prefer more challenging and ambitious topics rather than safe topics pursued solely to obtain a faculty position. He even specifically mentioned the aim to explore topics and scholars that have the potential to receive Nobel Prizes in the future. This naturally differs from the American-style notion of verbal freedom and the actual practice of focusing on safe bets. It's interesting how the understanding of pragmatism can differ so greatly between two cultures—one rooted in long-term plans and top-down designs, and the other more focused on short-term gains.","position":{"start":{"line":66,"column":1,"offset":14154},"end":{"line":66,"column":669,"offset":14822}}}],"position":{"start":{"line":66,"column":1,"offset":14154},"end":{"line":66,"column":669,"offset":14822}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Someone also asked about the criteria for selecting applicants at the Max Planck Institute. The answer was that each research institution has its own criteria. However, he also mentioned his own criteria: academic performance is the main factor, and when conducting research, one should have a clear understanding of the underlying physics. So, how is academic performance judged? It mainly depends on attending prestigious schools, followed by academic rankings. If the school's name is less well-known, higher academic rankings are expected. The answer was sincere, and it didn't evoke any sense of objection towards such obvious discrimination based on one's undergraduate alma mater, nor did it provoke any intention to challenge it.","position":{"start":{"line":68,"column":1,"offset":14824},"end":{"line":68,"column":738,"offset":15561}}}],"position":{"start":{"line":68,"column":1,"offset":14824},"end":{"line":68,"column":738,"offset":15561}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"This response is clearly targeting the American model, which emphasizes research experience and places greater importance on the authorship of papers. The backbone of a research group consists of Ph.D. students who do not need to spend time attending classes. How much contribution can undergraduate students applying for a Ph.D. make to the entire project? Moreover, these contributions are largely made by sacrificing their efforts in coursework. The sentence highlighted above is a sarcastic comment on this matter. Furthermore, considering the notorious reputation of the academic environment in China, overseas research experience is typically required. Apart from special programs like the Everest Plan that provide scholarships, most students have to self-fund and contact foreign mentors. This not only turns academic selection into a disparity unrelated to academia, linked instead to students' economic conditions, but also fosters an intermediary industry that sells such information. What academic justice is there in this policy?","position":{"start":{"line":70,"column":1,"offset":15563},"end":{"line":70,"column":1043,"offset":16605}}}],"position":{"start":{"line":70,"column":1,"offset":15563},"end":{"line":70,"column":1043,"offset":16605}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"However, let's consider how much academic performance can be reflected in a transcript. How many students openly ask their professors for grades when they intend to study abroad? Until a few years ago, there were even legitimate operations like \"passing and retaking\" courses at certain universities to alter transcripts. Not to mention the highly similar nature of examination questions across different subjects in China, which is detrimental to stability and unity. If attending prestigious schools is a requirement, then going abroad after high school graduation has far more advantages than going after undergraduate studies. It becomes a class-based filtering process, leading to the same destination through different paths.","position":{"start":{"line":72,"column":1,"offset":16607},"end":{"line":72,"column":732,"offset":17338}}}],"position":{"start":{"line":72,"column":1,"offset":16607},"end":{"line":72,"column":732,"offset":17338}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Both of these scenarios involve individuals, each operating under a different moral framework, which is gradually deconstructed and distorted when translated into executable actions. Throughout this process, their own judgment is constantly outsourced. Outsourcing itself is not a problem, as division of labor is both a reflection of societal development and an important driving force. However, let's take an airplane as an example. Safely delivering passengers to their destinations requires coordination and trust between the crew and ground staff, but the safe arrival ultimately has objective standards. In the education and research system, the outcomes of its own cultivation are digested by itself. The selection process inherently involves the phenomenon of athletes acting as both players and referees. Some of the selected individuals may not be competent, while some of the non-selected ones may be capable. In that case, it would be straightforward: allocate all resources to the winners and cut off the paths for the losers...","position":{"start":{"line":74,"column":1,"offset":17340},"end":{"line":74,"column":1042,"offset":18381}}}],"position":{"start":{"line":74,"column":1,"offset":17340},"end":{"line":74,"column":1042,"offset":18381}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Both models, in their mediocrity, peck at each other, and neither can replace the other. Ultimately, today's physics itself is lackluster. Leaving aside the magnificent breakthroughs during the birth of quantum mechanics and relativity, even the process of constructing the standard model was full of ad hoc solutions. Today, it is difficult to hope for its complete reversal. How much of the knowledge you solidly understand can be applied in your actual research? How many valuable works have you produced over these years of early involvement in research? Young people consider matters they believe are crucial to their future and destiny, but it is nothing more than a few bytes in their boss's email inbox. Whether they accept you or someone else, the difference is insignificant.","position":{"start":{"line":76,"column":1,"offset":18383},"end":{"line":76,"column":786,"offset":19168}}}],"position":{"start":{"line":76,"column":1,"offset":18383},"end":{"line":76,"column":786,"offset":19168}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In short, there are no heroes in our time, which allows mediocre individuals to gain fame.","position":{"start":{"line":78,"column":1,"offset":19170},"end":{"line":78,"column":91,"offset":19260}}}],"position":{"start":{"line":78,"column":1,"offset":19170},"end":{"line":78,"column":91,"offset":19260}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"In the afternoon, a lady who had a conversation with \"群发哥\" (a nickname) the day before gave a speech shortly after him. Looking at her organization on the first page of the presentation slides, it seemed that she was a junior colleague in his doctoral laboratory and was about to join his current research institute. ","position":{"start":{"line":80,"column":1,"offset":19262},"end":{"line":80,"column":318,"offset":19579}}},{"type":"element","tagName":"del","properties":{},"children":[{"type":"text","value":"In other words, she is the enemy who took away my offer","position":{"start":{"line":80,"column":320,"offset":19581},"end":{"line":80,"column":375,"offset":19636}}}],"position":{"start":{"line":80,"column":318,"offset":19579},"end":{"line":80,"column":377,"offset":19638}}},{"type":"text","value":". So, I posted a complaint in my friend circle. Her speech exceeded the allotted time and was interrupted by the host. I was about to","position":{"start":{"line":80,"column":377,"offset":19638},"end":{"line":80,"column":510,"offset":19771}}}],"position":{"start":{"line":80,"column":1,"offset":19262},"end":{"line":80,"column":510,"offset":19771}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"add a comment saying \"Exceeded the time, so bad,\" but considering that I had been posting quite a lot on my friend circle in the past few days, I refrained.","position":{"start":{"line":82,"column":2,"offset":19774},"end":{"line":82,"column":158,"offset":19930}}}],"position":{"start":{"line":82,"column":2,"offset":19774},"end":{"line":82,"column":158,"offset":19930}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The only person I admired during my four years in university, \"峰神\" (a nickname), replied below, saying he had also considered applying to the same research institute. I asked him where he is now, and a few minutes later, I saw his reply: \"Already started working.\" I quickly teased him, saying \"Rich brother, lend me 50 yuan.\" However, the words spoken at the meeting reverberated in my mind, sighing and turning into a deep breath. I silently put away my phone.","position":{"start":{"line":84,"column":1,"offset":19932},"end":{"line":84,"column":463,"offset":20394}}}],"position":{"start":{"line":84,"column":1,"offset":19932},"end":{"line":84,"column":463,"offset":20394}}}],"position":{"start":{"line":1,"column":1,"offset":0},"end":{"line":85,"column":1,"offset":20395}}},"collectedBy":[["doc",[{"slug":"OPT-workshop-notes","filename":"2023-05-19-OPT-workshop-notes.md","date":"2023-05-19","title":".doc | OPT Workshop Notes","layout":"post","keywords":["doc"],"excerpt":"OPT is the abbreviation of Optional Practice Training.","content":"\n## Who is eligible\n\n### Pre-completion\n\nBefore graduation, need to talk with advisor, not common\n\n### Post-completion\n\nafter graduation,\n\nhave entered the US, and have been in F1 status for 2 semesters\n\nor graduates except for dissertation \n\n- ABD: all but dissertation, finish before the end of EAD date\n- Otherwise need to go back home and complete the degree\n\n## OPT basics\n\nrelated to your field of study\n\nstill an F1 student, not a work visa.\n\n12 months OPT per level of education, not cumulative\n\neligible STEM degrees for extension of post-complete OPT, or pending H1B\n\nno job offer is required to apply. \n\nallows to change jobs and have multiple jobs\n\nemployer does not have to do anything, applicant is sponsoring themselves\n\ncan do paid/unpaid, this university cannot do unpaid work.\n\n## Only work after authorization\n\nnot eligible to work until EAD card\n\nno exception\n\nneed to create SEVP portal account after the OPT is approved and after the start date\n\nneed to report on change: US home address, employer and address, start and end date of employment\n\n## Do not accrue more than 90 days of unemployment\n\nwithin the authorization period on EAD card\n\n> 20 hours to be considered employed\n\n## Keep document and F1 records updated\n\nrequest OPT-I20\n\n## Only enroll part-time in classes unrelated to the current or future field of study\n\nreach out to OISS advisor \n\n## Travel outside US\n\npossible with documents\n\n1. passport\n2. F1 visa\n3. I20 with signature\n4. EAD\n5. proof of employment (optional)\n\n**while OPT application pending is possible, but risky** because the EAD will be mailed to your US address\n\n## Verify admission status I94 record is correct\n\n[i94.cbp.dhs.gov](http://i94.cbp.dhs.gov) \n\n## summary\n\n![how to maintain the OPT status](/blog/photos/2023-05-19-main-status.png)\n\n## Who can apply for extension\n\n### 24-month STEM OPT extension\n\naply during the last 90 days end of OPT\n\nUSCIS must receive before the end\n\nmust have a job\n\nemployer must enroll in E-verify\n\nrequires a plan (Form I-983)\n\n### H1B petition pending or approved may requested a “cap gap”\n\ncap gap employer file H1B application on April 1\n\nif approved, H1B starts on October 1\n\nif OPT expires before Oct 1, “cap gap” extension is added in SEVIS until decision of H1B is decided\n\n## application process\n\n- workshop, get a packet\n- request OPT I20  form from OISS advisor\n- prepare and submit form I-765 OPT application to USCIS\n- **must be in US to apply for OPT**\n\n## application timeline\n\n**application estimated to take 4 weeks.**\n\n90 days before program end date → I-20 end date → 60 days after program end date\n\npick requested start date: 1 day after I 20 end date → end of 60 day grace period\n\n![time window of OPT application](/blog/photos/2023-05-19-time-window.png)\n\n## Packet\n\n### request OPT-I20\n\nrequested OPT start date form\n\nacademic advisor verification form `OR` ABD OPT form, one or the other\n\n### The packet is for getting OPT I-20 recommendation from OISS\n\n## OPT I-20\n\napplication to USCIS with the recommendation from OISS\n\n### evidence files to upload I-765  with OPT I-20\n\nimmigration docu: passport, I-94\n\nprevious OPT and CPT, can skip if you don’t have it\n\n2 by 2 inches passport style photo; taken within 30 days; Public library, Walgreens, and CVS offer the service\n\n### What if the EAD start date is after the end date of the grace period?\n\ndidn't quite hear the answer"},{"slug":"job-search-efforts-during-march-meeting","filename":"2023-04-05-job-search-efforts-during-march-meeting.md","date":"2023-04-05","title":".doc | Job Search Efforts During March Meeting","layout":"post","keywords":["doc"],"excerpt":"[Translated by ChatGPT] 2 interviews and 1 focus session during March Meeting 2023.","content":"\n### Before the Meeting\n\nThe March meeting will be held in Las Vegas this year.\n\nIt's about two weeks away from the conference, and I developed folliculitis at the base of my chin where I have a beard. It quickly worsened into herpes zoster, commonly known as \"internal heat\" in Chinese medicine. The second semester of the American academic year ends in May, and I haven't made much progress on my thesis. I can't find a job, and the application season for postdoctoral programs is in full swing with paper submissions. I watched helplessly as the application deadlines for two projects passed by. The postdoctoral project shared by a neighboring research group reposted their job advertisement online shortly after I submitted my application materials. I also applied to two research institutes in Germany, with one already sending a rejection letter and the other not responding at all. In addition to all this, I need to prepare for my presentation at the conference. It's no wonder I'm feeling stressed.\n\nOn Friday, we had a rehearsal for the group's presentations. I had initially planned to reuse the slides from last year's conference but realized that the main content from my paper was missing. It made me realize that I had indeed accomplished quite a bit over the past year. After receiving the rejection letter from the German research institute, I felt down for a day. However, the trend of using ChatGPT quickly gained popularity. So I compiled a list of professors I had heard of during my doctoral studies and fed their research group homepage descriptions, along with an abstract of my paper generated by AI, to ChatGPT, asking it to compose an email. The result was decent, and I received a reply inviting me to meet during the conference. The person who responded is a well-known researcher who studies animal behavior using a cross-scale approach and manages two research groups in Europe and East Asia. They made a big impression at last year's conference and later came to give a lecture at my university. We had lunch together. Shortly before the meeting, someone on the APS (American Physical Society) mailing list sent a mass email advertising a job opportunity. It turns out they are the current postdoc who will soon start a faculty position at a university in the western United States. Interestingly, they are currently working at the German research institute that rejected me. I can't help but feel a mix of envy and satisfaction knowing that they also fell for the ChatGPT-generated email trick.\n\n### Meeting\n\nI walked to the conference venue and checked in. I received a name tag, which was just a thick piece of paper hanging from a string, without even a plastic cover.\n\nAfter checking in, I surveyed the layout of the conference venue. The rooms related to biophysics were located on both sides of the first intersection in the main corridor. Each doorway had display boards indicating the themes of the speeches for each time slot. Unlike last year when I was the only one from our team attending, this year all three members of our team have presentations. In addition, Katie, a former master's student in our group, and her current classmates also have presentations. When I marked the schedule, I found that most of the interesting sessions conflicted with each other. Although I have social anxiety, I still feel that interpersonal relationships are important. Or perhaps it's because of my social anxiety that I feel interpersonal relationships are more important?\n\nBack at the hotel, I received a reply from my group email to confirm a time one or two weeks after the March meeting for a remote interview. The purpose is for me to introduce my current work and explain how I can contribute to his laboratory. It's a bit unexpected because his group email mentioned that he would attend the conference, and my email also stated that I was willing to meet during the conference. Does this reply imply a lack of interest? I feel a little disappointed.\n\n### Interview 1\n\nWhen I was wandering between different sub-venues and arrived late to one where the seats were already filled, I had to stand at the back. While I was standing and listening in one of the venues, a guy wearing a green jacket and carrying a sports backpack walked in. He listened for a while and then left. He seemed somewhat familiar, resembling the photos on ChatGPT's personal website.\n\nCurious, I discreetly left the venue and saw him talking to a friend in the corridor, with the name tag on the front of his chest turned over. I temporarily left and explored around, discovering that coffee was available in the main corridor. I lined up and got a cup, then came back to investigate and confirmed it was him.\n\nI greeted him, and it turned out that ChatGPT had been too verbose in his email and only mentioned that he was also attending the conference in March at the very end. I asked him when my presentation was scheduled and if he planned to attend, so we wouldn't need a Zoom meeting.\n\nThe title of my presentation during that time slot was quite peculiar, and it didn't seem to have much relevance to what I was working on. When I entered the waiting area, I noticed that apart from the two of us from our lab, all the other presentations in that session were focused on the same pattern and structure of a particular model organism. Our presentation came at the very end of the session, and I felt we performed well. When I started addressing the topic, I made a joke using the session's title, and we finished right on time. ChatGPT arrived at the venue about half an hour before my presentation, and after we finished, he left without coming up to talk to me.\n\nAfterward, back at the hotel, I received an email from him, inviting me to meet the next afternoon. I searched his schedule on the conference website and found that it was right after his presentation. Looking at the title of his talk, it seemed to be about his recent paper. I fed the article into an AI tool to generate an abstract but didn't get a chance to read it before my classmates pulled me away to play...\n\nHis presentation was scheduled for the next afternoon and fell in the middle of the overall time slot. I entered the venue at the beginning of the session, and he arrived a little later, sat for a while, and then left. The venue was twice as large as when I gave my presentation, but it wasn't completely filled. While he was speaking, I was reviewing the article summary generated by AI from yesterday, feeling that it contained more information than most of the presentations I had heard up until that point. His presentation skills were also far above the average level. His research targeted a biological system one level higher than my current research focus, but the approach and process seemed similar. His research was much more advanced, both in theory and experimentation. Although the theory seemed to be a fairly traditional model in the field, it was still much better than just presenting experimental data like we did.\n\nAfter the conference, we met in the corridor and found two seats. I showed him my slides, and he went through all the details, confirming that I would be working on gene editing in our lab's model organism. He also asked about the proportion of my work within the entire project.\n\nThen, he asked a question that felt as significant as being confessed to in a romantic relationship: \"What is the central question guiding your research career?\" Ah, my brain immediately crashed. Seeing me struggling, the guy said I could speak in Chinese, as he understood it but couldn't speak it. Finally, when I felt cornered, I told the truth - I just wanted to coast through academia, eat and wait for death. If\n\n ChatGPT has arrived, and we have super-intelligent AI, who needs physics anymore? Physics doesn't exist anymore. The guy chuckled at my response.\n\nHe then asked me to ask questions. I inquired about the duration of holidays, and he replied that it followed the school's policy. Those who have cultured cells should know that they might have to go to the school on weekends, so as long as the workload is sufficient, there are no attendance requirements on weekdays.\n\nOverall, the conversation went quite smoothly. In the end, he mentioned that he would send me an email and asked for two or three ways to contact me, as well as a recommendation letter.\n\n### Interview 2\n\nOriginally, I had a good impression of this esteemed person, but since it was the first day of the conference, I thought maybe everyone hadn't settled in yet. Therefore, I sent an email on Tuesday to confirm the meeting time, and as a result, we arranged to meet on Friday at noon, next to the DBIO service desk.\n\nI had planned to prepare in advance, as his research group had three or four presentations, but most of them clashed with my own presentation or the previous interview. In the end, I only attended one of them.\n\nFriday at noon turned out to be the last session of the entire conference. The DBIO table had already been removed, and everyone seemed eager to leave. After about ten minutes past 12 o'clock, I finally met the person, and five minutes later, the person I was talking to left. Everyone was busy packing up and closing the doors. We found an empty room with a table and chairs that had already been moved out. Inside the room, there was only one student lying on the floor sleeping. The two of us sat down facing each other on the floor.\n\nJust as I was about to take out my computer to go over my presentation, he waved his hand and asked me to briefly summarize my work orally. The subsequent series of questions and answers followed the same style, with the two of us sitting on the floor, exchanging rapid-fire questions and quick responses, resembling the agility of Zen. He started by asking why I chose to pursue my current work. I thought I gave a decent answer, but as I spoke, I realized that it was the answer from the previous interview. Why didn't I think of that earlier? Feeling a bit too pleased with myself, I forgot that this esteemed person was focused on studying behavior, not organizational structure. It could have been easily smoothed over, but I didn't handle it well. Then he asked about my favorite course during my undergraduate studies, a question he mentioned during our lunch break, so I pretended to be impressive. After that, he asked two significant questions: \"How did a stinky experimenter like you end up begging for food in our theoretical group?\" and \"How did a stinky structuralist like you end up begging for food in our behavioral research field?\" I didn't answer them well. Earlier, in my self-satisfaction, I mentioned having another job offer, which led to both sides being somewhat perfunctory during the latter part of the conversation.\n\nFinally, he briefed me that the research in East Asia has sufficient funding, although he spends a considerable amount of time there every year, it's not always possible to meet in person for guidance. Regarding Europe, if I decide to join, he would need to specifically apply for funding. The meaning behind this was quite clear, so we politely agreed to take some time to consider it and said we could stay in touch via email in the future.\n\n### Symposium\n\nThe symposium actually took place on the afternoon of the same day as my speech, right before the two interviews.\n\nThe so-called symposium was organized by several research institutions in Germany and aimed to promote information related to research conducted in Germany. It was quite far from the venues of the biophysics sessions. After my friend Katie finished her speech, I slipped out of the venue and rushed over. By the time I arrived, it had already begun. There were bagels, jam, and cheese on both sides of the entrance, and it was the first time in many days that I had lunch.\n\nThere were six or seven round tables in the venue, each with a small label indicating the name of a research institution. There were one or two staff members from each corresponding institute sitting at the tables. The host introduced each research institution in turn and gave the leaders of the institutions three to five minutes to introduce themselves. After that, it was free time. I noticed that the Max Planck Institute's table was near the bread, and since the other institutions didn't seem to focus much on basic scientific research, I found a chair and sat down. The head of the Max Planck Institute was an elder with white hair. His attire was more formal compared to the other participants, and he had a strong presence, resembling a wise figure.\n\nThe first question was about the difficulty of immigrating to Germany and whether Germany was somewhat exclusive. The elder replied that Germany is currently one of the most open countries in terms of immigration policies. Considering the phrase \"one of the,\" and also taking into account that foreign graduates in non-academic positions in the beacon country have to draw lots to obtain a work visa, excluding the \"borderline,\" this answer could not be considered wrong. Deutsche Welle had previously released a video with a similar statement, but that video had a follow-up phrase of \"aber...\" (but...).\n\nSomeone then asked about the projects and job structure at the Max Planck Institute. The answer was similar to what I had previously understood. Each research institution has the authority to recruit its own researchers. The duration of a postdoctoral position is generally two years, with extensions to three years or longer only when necessary. At the Max Planck Institute, except for the director, there are hardly any permanent positions for research positions. The institute serves as a stepping stone for researchers before they secure a permanent faculty position. However, whether it was a government regulation or something else, there was a rule stating that nine years after obtaining a doctoral degree, the employing institution must provide a permanent position. As a result, individuals are often dismissed before the end of those nine years. It wasn't asked whether this contradicted the previous answer.\n\nWhen asked what kind of research the Max Planck Institute favors, the elder explicitly stated that they prefer more challenging and ambitious topics rather than safe topics pursued solely to obtain a faculty position. He even specifically mentioned the aim to explore topics and scholars that have the potential to receive Nobel Prizes in the future. This naturally differs from the American-style notion of verbal freedom and the actual practice of focusing on safe bets. It's interesting how the understanding of pragmatism can differ so greatly between two cultures—one rooted in long-term plans and top-down designs, and the other more focused on short-term gains.\n\nSomeone also asked about the criteria for selecting applicants at the Max Planck Institute. The answer was that each research institution has its own criteria. However, he also mentioned his own criteria: academic performance is the main factor, and when conducting research, one should have a clear understanding of the underlying physics. So, how is academic performance judged? It mainly depends on attending prestigious schools, followed by academic rankings. If the school's name is less well-known, higher academic rankings are expected. The answer was sincere, and it didn't evoke any sense of objection towards such obvious discrimination based on one's undergraduate alma mater, nor did it provoke any intention to challenge it.\n\nThis response is clearly targeting the American model, which emphasizes research experience and places greater importance on the authorship of papers. The backbone of a research group consists of Ph.D. students who do not need to spend time attending classes. How much contribution can undergraduate students applying for a Ph.D. make to the entire project? Moreover, these contributions are largely made by sacrificing their efforts in coursework. The sentence highlighted above is a sarcastic comment on this matter. Furthermore, considering the notorious reputation of the academic environment in China, overseas research experience is typically required. Apart from special programs like the Everest Plan that provide scholarships, most students have to self-fund and contact foreign mentors. This not only turns academic selection into a disparity unrelated to academia, linked instead to students' economic conditions, but also fosters an intermediary industry that sells such information. What academic justice is there in this policy?\n\nHowever, let's consider how much academic performance can be reflected in a transcript. How many students openly ask their professors for grades when they intend to study abroad? Until a few years ago, there were even legitimate operations like \"passing and retaking\" courses at certain universities to alter transcripts. Not to mention the highly similar nature of examination questions across different subjects in China, which is detrimental to stability and unity. If attending prestigious schools is a requirement, then going abroad after high school graduation has far more advantages than going after undergraduate studies. It becomes a class-based filtering process, leading to the same destination through different paths.\n\nBoth of these scenarios involve individuals, each operating under a different moral framework, which is gradually deconstructed and distorted when translated into executable actions. Throughout this process, their own judgment is constantly outsourced. Outsourcing itself is not a problem, as division of labor is both a reflection of societal development and an important driving force. However, let's take an airplane as an example. Safely delivering passengers to their destinations requires coordination and trust between the crew and ground staff, but the safe arrival ultimately has objective standards. In the education and research system, the outcomes of its own cultivation are digested by itself. The selection process inherently involves the phenomenon of athletes acting as both players and referees. Some of the selected individuals may not be competent, while some of the non-selected ones may be capable. In that case, it would be straightforward: allocate all resources to the winners and cut off the paths for the losers...\n\nBoth models, in their mediocrity, peck at each other, and neither can replace the other. Ultimately, today's physics itself is lackluster. Leaving aside the magnificent breakthroughs during the birth of quantum mechanics and relativity, even the process of constructing the standard model was full of ad hoc solutions. Today, it is difficult to hope for its complete reversal. How much of the knowledge you solidly understand can be applied in your actual research? How many valuable works have you produced over these years of early involvement in research? Young people consider matters they believe are crucial to their future and destiny, but it is nothing more than a few bytes in their boss's email inbox. Whether they accept you or someone else, the difference is insignificant.\n\nIn short, there are no heroes in our time, which allows mediocre individuals to gain fame.\n\nIn the afternoon, a lady who had a conversation with \"群发哥\" (a nickname) the day before gave a speech shortly after him. Looking at her organization on the first page of the presentation slides, it seemed that she was a junior colleague in his doctoral laboratory and was about to join his current research institute. ~~In other words, she is the enemy who took away my offer~~. So, I posted a complaint in my friend circle. Her speech exceeded the allotted time and was interrupted by the host. I was about to\n\n add a comment saying \"Exceeded the time, so bad,\" but considering that I had been posting quite a lot on my friend circle in the past few days, I refrained.\n\nThe only person I admired during my four years in university, \"峰神\" (a nickname), replied below, saying he had also considered applying to the same research institute. I asked him where he is now, and a few minutes later, I saw his reply: \"Already started working.\" I quickly teased him, saying \"Rich brother, lend me 50 yuan.\" However, the words spoken at the meeting reverberated in my mind, sighing and turning into a deep breath. I silently put away my phone.\n"}]]]},"__N_SSG":true}