{"pageProps":{"metadata":{"slug":"parents-visiting","filename":"2020-06-05-parents-visiting.md","date":"2020-06-05","title":".doc | 接机","layout":"post","keywords":["doc"],"excerpt":"今年寒假，疫情引而未发之时，爸妈来美国看我。","content":"\n今年寒假，疫情引而未发之时，爸妈来美国看我。\n\n他们英语不好，担心转机的时候不顺利，所以定了直飞芝加哥的机票，傍晚到，我早上出发开车去接他们。因为是一个人开车，手机定了计时，每隔一两个小时就离开高速停车休息一会儿。\n\n一路基本顺利，除了进城之后。前面几个收费站把硬币花完了，接下来的收费站没带够硬币，又误入人工硬币收费关卡，被收费大妈批了一顿之后滚蛋了，回去之后在网上补缴了费用；到机场之后，想到之前收费站的事，在航站楼里的小卖部买了包巧克力糖，换了一堆零钱；发现停车的航站楼不是爸妈要停靠的那个，导航又不明确，只能开车离开停车场，一边慢行一边看路牌。到了正确的航站楼，距离爸妈的飞机到达还有一个多小时。芝加哥当天极冷，于是也不好在周围闲逛，就只在接机口站着等。\n\n倒是没有着急，盯着出站口被人推开又自己关上的门，呆若木鸡，一种在被人漠视和假装无感于漠视中锻炼出来的，故作少年老成的冷漠表情。一会儿就要见到爸爸妈妈了，我会拥抱他们吗，会一惊一乍地嘘寒问暖吗，会有一股暖意从心底涌上心头吗？\n\n想来本科的时候，爸妈也是这样在等我的。那时候家乡还没有通高铁，去学校的时候坐的是夕发朝至的绿皮车，回家的时候动车票买到邻近的城市，爸妈开车到高铁站接我。有时候在高速的服务区吃饭，有时候他们先吃过了，来的路上买必胜客或者肯德基的套餐，这样我在车上就把午饭解决了。\n\n事情也不是一开始就这么顺利的。第一年寒假的时候，当时那个高铁站也才刚通车不久，出站口的广场和地下通道还扎着脚手架，第一次来这个车站，我有点找不清方向。打电话问他们，我爸习惯说东西南北，我只认识前后左右，指挥了半天又绕回了原地，我爸开始急了，吼了起来。我也不甘示弱，挂了电话，直奔汽车售票处要自己买票回家。拖着行李箱到了站台上，一路上手机一直在响。接了电话，那边爸爸的声音还是很强硬，但明显有一种不敢再发怒的谨慎。这是最容易让人蹬鼻子上脸的，我直接吼了一句“老子就是要让你不爽！”，又把电话挂了。\n\n挂完电话之后就后悔了，真的要自己回家吗？架总要吵完的，回家之后，该怎么收场呢？于是就在周围人的目光中离开站台，脸红得很，也不知道是冻，是怒，还是羞愧。离开站台后给妈妈打电话，重新核对周围的建筑位置，终于在广场去地下停车场的楼梯旁边会合。见面的时候，妈妈刚想说话缓解气氛，我先给了爸爸一个拥抱。然后找了一家餐厅吃饭，回家，比无事发生还更加其乐融融。后来回学校之后，爸爸在网上跟我告状，说妈妈因为这个拥抱嫉妒他，找了他好几次茬。\n\n父母和孩子的关系，在绝大多数时间里都是极不对等的权力关系，而且是总有一天要从一种不对等逆转成另一种不对等的权力关系。我们家和舅舅家住的近，所以常走动。表弟出生的时候，舅舅年纪已经不小了，表弟刚会走路的时候，在我们家小区的草坪上，鬓角已有白发的舅舅在表弟面前S形跑，双臂向后伸，嘴里念着小鸟小鸟飞。高中的语文老师讲课爱跑题，讲李密《陈情表》的时候，他感慨说人的衰老就像是时间的逆转一样，老人越来越像一个孩子，越来越需要子女像当初的父母一样照顾他们。不久，老师请了短假，回来后左臂上多了一块黑色的孝牌。《请回答1988》里面，德善的爸爸很因为总是忽视德善而道歉，说爸爸也是第一次当爸爸。可是，哪有那么容易的道歉呢，孩子也是第一次做孩子，有些愧疚连愧疚的资格都没有，只能在比无事发生还更加其乐融融的气氛里，被时间抛在身后。\n\n广播报出了他们飞机的班次，出站的人流渐渐拥挤又渐渐稀疏，在他们看到我之前，我先看到了他们，对眼前的陌生有些茫然，面有疲倦之色。我接过他们的行李箱，“还顺利吗？”“挺顺利的。”天很冷，出航站楼之后我们都打了哆嗦，快步往停车场去。\n"},"tocStr":"{\"index\":null,\"endIndex\":null,\"map\":null}","htmlAst":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"今年寒假，疫情引而未发之时，爸妈来美国看我。","position":{"start":{"line":2,"column":1,"offset":1},"end":{"line":2,"column":23,"offset":23}}}],"position":{"start":{"line":2,"column":1,"offset":1},"end":{"line":2,"column":23,"offset":23}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"他们英语不好，担心转机的时候不顺利，所以定了直飞芝加哥的机票，傍晚到，我早上出发开车去接他们。因为是一个人开车，手机定了计时，每隔一两个小时就离开高速停车休息一会儿。","position":{"start":{"line":4,"column":1,"offset":25},"end":{"line":4,"column":84,"offset":108}}}],"position":{"start":{"line":4,"column":1,"offset":25},"end":{"line":4,"column":84,"offset":108}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"一路基本顺利，除了进城之后。前面几个收费站把硬币花完了，接下来的收费站没带够硬币，又误入人工硬币收费关卡，被收费大妈批了一顿之后滚蛋了，回去之后在网上补缴了费用；到机场之后，想到之前收费站的事，在航站楼里的小卖部买了包巧克力糖，换了一堆零钱；发现停车的航站楼不是爸妈要停靠的那个，导航又不明确，只能开车离开停车场，一边慢行一边看路牌。到了正确的航站楼，距离爸妈的飞机到达还有一个多小时。芝加哥当天极冷，于是也不好在周围闲逛，就只在接机口站着等。","position":{"start":{"line":6,"column":1,"offset":110},"end":{"line":6,"column":223,"offset":332}}}],"position":{"start":{"line":6,"column":1,"offset":110},"end":{"line":6,"column":223,"offset":332}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"倒是没有着急，盯着出站口被人推开又自己关上的门，呆若木鸡，一种在被人漠视和假装无感于漠视中锻炼出来的，故作少年老成的冷漠表情。一会儿就要见到爸爸妈妈了，我会拥抱他们吗，会一惊一乍地嘘寒问暖吗，会有一股暖意从心底涌上心头吗？","position":{"start":{"line":8,"column":1,"offset":334},"end":{"line":8,"column":112,"offset":445}}}],"position":{"start":{"line":8,"column":1,"offset":334},"end":{"line":8,"column":112,"offset":445}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"想来本科的时候，爸妈也是这样在等我的。那时候家乡还没有通高铁，去学校的时候坐的是夕发朝至的绿皮车，回家的时候动车票买到邻近的城市，爸妈开车到高铁站接我。有时候在高速的服务区吃饭，有时候他们先吃过了，来的路上买必胜客或者肯德基的套餐，这样我在车上就把午饭解决了。","position":{"start":{"line":10,"column":1,"offset":447},"end":{"line":10,"column":131,"offset":577}}}],"position":{"start":{"line":10,"column":1,"offset":447},"end":{"line":10,"column":131,"offset":577}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"事情也不是一开始就这么顺利的。第一年寒假的时候，当时那个高铁站也才刚通车不久，出站口的广场和地下通道还扎着脚手架，第一次来这个车站，我有点找不清方向。打电话问他们，我爸习惯说东西南北，我只认识前后左右，指挥了半天又绕回了原地，我爸开始急了，吼了起来。我也不甘示弱，挂了电话，直奔汽车售票处要自己买票回家。拖着行李箱到了站台上，一路上手机一直在响。接了电话，那边爸爸的声音还是很强硬，但明显有一种不敢再发怒的谨慎。这是最容易让人蹬鼻子上脸的，我直接吼了一句“老子就是要让你不爽！”，又把电话挂了。","position":{"start":{"line":12,"column":1,"offset":579},"end":{"line":12,"column":248,"offset":826}}}],"position":{"start":{"line":12,"column":1,"offset":579},"end":{"line":12,"column":248,"offset":826}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"挂完电话之后就后悔了，真的要自己回家吗？架总要吵完的，回家之后，该怎么收场呢？于是就在周围人的目光中离开站台，脸红得很，也不知道是冻，是怒，还是羞愧。离开站台后给妈妈打电话，重新核对周围的建筑位置，终于在广场去地下停车场的楼梯旁边会合。见面的时候，妈妈刚想说话缓解气氛，我先给了爸爸一个拥抱。然后找了一家餐厅吃饭，回家，比无事发生还更加其乐融融。后来回学校之后，爸爸在网上跟我告状，说妈妈因为这个拥抱嫉妒他，找了他好几次茬。","position":{"start":{"line":14,"column":1,"offset":828},"end":{"line":14,"column":213,"offset":1040}}}],"position":{"start":{"line":14,"column":1,"offset":828},"end":{"line":14,"column":213,"offset":1040}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"父母和孩子的关系，在绝大多数时间里都是极不对等的权力关系，而且是总有一天要从一种不对等逆转成另一种不对等的权力关系。我们家和舅舅家住的近，所以常走动。表弟出生的时候，舅舅年纪已经不小了，表弟刚会走路的时候，在我们家小区的草坪上，鬓角已有白发的舅舅在表弟面前S形跑，双臂向后伸，嘴里念着小鸟小鸟飞。高中的语文老师讲课爱跑题，讲李密《陈情表》的时候，他感慨说人的衰老就像是时间的逆转一样，老人越来越像一个孩子，越来越需要子女像当初的父母一样照顾他们。不久，老师请了短假，回来后左臂上多了一块黑色的孝牌。《请回答1988》里面，德善的爸爸很因为总是忽视德善而道歉，说爸爸也是第一次当爸爸。可是，哪有那么容易的道歉呢，孩子也是第一次做孩子，有些愧疚连愧疚的资格都没有，只能在比无事发生还更加其乐融融的气氛里，被时间抛在身后。","position":{"start":{"line":16,"column":1,"offset":1042},"end":{"line":16,"column":359,"offset":1400}}}],"position":{"start":{"line":16,"column":1,"offset":1042},"end":{"line":16,"column":359,"offset":1400}}},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"广播报出了他们飞机的班次，出站的人流渐渐拥挤又渐渐稀疏，在他们看到我之前，我先看到了他们，对眼前的陌生有些茫然，面有疲倦之色。我接过他们的行李箱，“还顺利吗？”“挺顺利的。”天很冷，出航站楼之后我们都打了哆嗦，快步往停车场去。","position":{"start":{"line":18,"column":1,"offset":1402},"end":{"line":18,"column":114,"offset":1515}}}],"position":{"start":{"line":18,"column":1,"offset":1402},"end":{"line":18,"column":114,"offset":1515}}}],"position":{"start":{"line":1,"column":1,"offset":0},"end":{"line":19,"column":1,"offset":1516}}},"collectedBy":[["doc",[{"slug":"autumn-tour-grand-teton-and-yellowstone","filename":"2024-10-13-autumn-tour-grand-teton-and-yellowstone.md","date":"2024-10-13","title":".xls | 秋游大提顿和黄石公园","layout":"post","keywords":["doc","xls","jpg"],"excerpt":"今年秋假去了 Grand Teton 大提顿和 Yellowstone 黄石国家公园。","cover":"2024-10-13-Yellowstone.png","content":"\n今年秋假去了 Grand Teton 大提顿和 Yellowstone 黄石国家公园。两个公园南北相邻，向南最近的城镇是 Jackson Hole，也就是美联储开会的地方。\n\nGrand Teton 依托于提顿山脉，山的海拔不算特别高，但是胜在山脉东侧的湖泊和盆地，衬托得山势雄伟。园内落叶阔叶林和常绿针叶林混搭，秋季色彩明丽。\n\nYellowstone 整个公园相当于一个活火山的火山口，园内有大量温泉、间歇泉、地热，还有黄石河切削而成的峡谷和瀑布，一年四季的景色都很优美。但是园内植被主要是常绿针叶林，所以秋天并不额外出彩。\n\n另外秋季两个公园内的野生动物都不活跃，不过对于像我这样没有 100 - 400 mm 长焦镜头的普通游客影响不大～\n\n两个公园的门票都是一周内无限次进入，好处是景区内商家不存在行政垄断，吃饭加油的价格并不比外面贵；坏消息是外面和公园里一样贵，提顿村汽油每加仑超过 $5，杰克逊稍微便宜一些但也很贵。\n\n![大提顿公园地图](/photos/2024-10-13-GrandTeton.png)\n\n![黄石公园地图](/photos/2024-10-13-Yellowstone.png)\n\n### 流水账\n\n- 第一天\n    - 在盐湖城中转，期间下载了两个公园的 Google 离线地图\n    - 中午到 Jackson Hole 机场，在租车行取车\n    - 在 Dornans 下车拍照\n    - 下午开车沿 Hwy 191 向北，在沿途的停车区短停拍照，看到 Pack Trail Fire 山火的烟\n    - 经过大提顿和黄石公园南入口，分别买票\n    - 到达黄石公园 Moose 瀑布后返回\n    - 前往提顿村，路上在 Jenny Lake outlook 拍照\n    - 入住酒店\n- 第二天\n    - 从提顿村前往黄石，经过 Teton Park Road，沿途在停车区拍照\n    - 在黄石公园依次游览 West Thumb 间歇泉、Mud Volcano 火山湖、Upper & Lower 瀑布\n    - 试图前往 Dunraven ，因为不太会用离线地图，一直开到了 Roosevelt Lodge 才发现走错了，而且那里秋季不开门\n    - 返回，抵达 Dunraven Pass 时日落，没找到上山途径，在路对面的山坡上看晚霞\n    - 在公园内吃晚饭，不比宾馆贵\n    - 夜行回宾馆\n- 第三天\n    - 试图在宾馆附近拍日出，东方有山，看见太阳时高度角已经很高，未见红日\n    - 在黄石公园依次游览 Old Faithful 间歇泉、Steamboat 间歇泉、Congress pool\n    - 试图返回 Jenny lake 拍日落，没太赶上，发现另一个拍日出的机位 Cathedral Group Turnout，事后证明不是秋季的最佳机位\n- 第四天\n    - 早起前往 Cathedral Group Turnout，\n        - 看提顿峰顶的第一缕日光\n        - 在长焦镜头取景框里看到大角公鹿，没能拍下清晰照片\n        - 回程发现了更好的机位，向东可以看到地平线上的日出，向西有若干金黄色落叶阔叶林作为提顿峰的前景，非常后悔\n    - 在 Jenny lake 拍照\n    - 退房后，大提顿以东的整个平原/盆地隐没于远方山火扩散来的烟霾中\n    - 前往 Mormon Row，是一处早期定居点，遇花栗鼠一只，蓝鸟一对\n    - 穿过 Jackson 镇，进入 Elk Refuge，此处的烟霾比提顿附近略轻。\n    - 返回 Jackson 镇吃午饭，加油，回机场"},{"slug":"doc-graduation-ceremony","filename":"2024-05-26-doc-graduation-ceremony.md","date":"2024-05-26","title":".doc | 参加毕业典礼","layout":"post","keywords":["doc"],"excerpt":"写点尬的，先来首高雅音乐～","content":"\n> 写点尬的，先来首高雅音乐～\n> \n\n【爱江山更爱美人.mp3】\n\n美国的冬春学期五月份就结束了，毕业典礼中的 hooding ceremony 一般在此学期的最后一个周五，commencement 在接下来的周一。\n\n我早就毕业了，但是答辩的时候刚刚过了毕业典礼的日期没多久。毕业之后回了一趟家，然后返回原实验室做博士后。\n\n---\n\n今年春天，我们研究方向的师生每周茶聚的时候，我们老板盛赞我选择下一年的春天参加毕业典礼是个明智的选择，毕竟冬学期的活动太冷清了，都没有人重视。\n\n当时我的面部肌肉稍微拉起来一个微笑，没有接话。\n\n这是在提醒我，他可没有忘，所以请我也不要忘了报名今年的毕业典礼哟～\n\n刚入学的时候，我觉得我们老板怎么这么水，数学水编程也水，就这还是两校出来的学生？现在的我真心地除了佩服还是佩服，我们老板不论安排什么任务，还是讲什么知识，说起来都笑吟吟的，我认识他六年有余了，从来没见他红过脸——这个世界如此地混沌，他却能微笑着一句话，剪断一个将来可能有无限枝叶的世界线分叉——那还有多少事，多少人的“自由意志”，都包含在他的自由意志之中呢？\n\n---\n\n说第二年参加毕业仪式是一种“选择”，是因为至少还有两种做法：1. 答辩之前就参加当年的活动，我们组比我高一级的学姐就是这么干的；2. 毕业之后的冬季学期结束的时候还有一次 hooding ceremony, HK 兄弟就是这么干的。\n\n两种做法我都没有选，因为我本来完全不打算参加任何毕业活动的。\n\n毕竟对于迂腐的小知识分子，一个行为能带来的世俗荣誉感越大，做了就越庸俗，拒绝就越优雅～\n\n我们本科的毕业纪念册上，居然有一个文本框要填什么“所获荣誉”，简直是人心不古世风日下，于是咱仗义执言：“物理学院院内足球联赛亚军；BiliBili 放映室写评论赢电影票活动获奖观众”——优雅，实在是太优雅了.gif\n\n![https://syimg.3dmgame.com/uploadimg/xiaz/2022/0607/1654566377264.gif](https://syimg.3dmgame.com/uploadimg/xiaz/2022/0607/1654566377264.gif)\n\n纪念册打印出来之后我一看，律神的第一行写着“珠峰物理实验班第一学年平均分数第一名”。律神是名副其实的大学霸，大一的时候专业课都接近满分。我只是个 90 分飘过的混子，而体育课思政课之类的我又碰巧分数比他高，算 GPA 的话居然比他还高了一点点。大一下学期的电磁学期末考试实在是太简单，直接把他气到在群里@老师，大二转学到了数学班。\n\n~~对了，数学班的班花毕业纪念册好像写得也很优雅。我自己其实真无所谓，但我有个朋友真的很想知道一下人家的联系方式。~~\n\n---\n\n出来混总是要还的嘛。\n\n仗着成绩不错，在外校选修了拓扑学，尼玛人话都听不懂多少，就要去理解紧致啊同伦啊这些概念，这回 GPA 真的下来了。而且在外校的一个学期 ~~让喜欢的女孩子终于好意思拒绝了我的纠缠~~ 打断了之前在本校的研究进度，回来之后又去了一个完全不同的课题组混经验，到毕业也没混出什么名堂。\n\n寄出去 19 封申请信，只回来 2.5 份录取通知书，那半份硕士录取的老师还发邮件催了好几次，意思是硕士录取就已经很给我面子了，不要不识好歹哟～\n\n来到博士学校，才知道这份 offer 是因为和我同年招聘来了一个新老师，系里估计他需要学生，就把申请信里说对这个方向有兴趣的我给捞进来了。\n\n来了之后我依然笑嘻嘻地在混，但是研究方向的不确定性，技术路线能不能走通都不好说，更别说知道能做出什么结论，结论的科学意义有多大了。\n\n最焦虑的时候，我背着书包回家，包还在背后往床上一躺就睡着了，然后一个实验失败的噩梦又把我给惊醒，起身时屋内漆黑，窗外华灯初上。\n\n确定答辩日期之后，其实是可以提前报名当年的毕业典礼的，但是我实在是怕给自己立 flag，觉得干脆就不参加典礼了更好，跟家里也是这么说的。\n\n结果下半年， 比我晚入学两年的老乡 HK 兄弟毕业了，朋友圈发了很帅气的照片。这回破防的是我了，“富贵不发朋友圈，如锦衣夜行，谁知之者！”老板提了一嘴我就报名了。\n\n---\n\n大三的时候，物理学院出钱，让我们班三个同学去美国一所学校做一个学期的访问学生。外校的新生报到时，我们刚进大厅，身前不远有一家三口，小姑娘转身面向爸爸妈妈，笑着说她要去排队咯，然后又转身，金发单马尾一蹦一跳地往前跑去了。确定她走远后，妈妈倒在了爸爸的怀中，眼中泪水不住地流。\n\n然后我们几个相视一笑，就这？我们坐了快二十个小时的飞机，天没亮在麦当劳眯了好几个小时再过来，你们开了几个小时的车就感动成这样？\n\n后来我觉得当年的自己真幼稚。人生道阻且长，怎能不抓紧一切可庆祝的机会去庆祝，给自己加油打气，说服自己正走在正确的方向呢？\n\n现在我觉得当年觉得自己真幼稚的自己真幼稚。稍微没品且无自觉了一点，但当时的我们，其实也是在给自己打气啊。\n\n【Fear brought me this far.mp3】\n"},{"slug":"txt-graduation-ceremony","filename":"2024-05-26-txt-graduation-ceremony.md","date":"2024-05-26","title":".txt | 参加毕业典礼","layout":"post","keywords":["doc"],"excerpt":"今日发布的另一文，是写同一件事的姊妹篇。","content":"\n> 今日发布的另一文，是写同一件事的姊妹篇。\n> \n\n【Fear brought me this far.mp3】\n\n美国的冬春学期五月份就结束了，毕业典礼中的 hooding ceremony 一般在此学期的最后一个周五，commencement 在接下来的周一。\n\n我早就毕业了，但是答辩的时候刚刚过了毕业典礼的日期没多久，所以今年才参加毕业典礼。毕业之后回了一趟家，然后返回原实验室做博士后。\n\n今年春天，我们研究方向的师生每周茶聚的时候，我们老板盛赞我选择下一年的春天参加毕业仪式，毕竟冬学期的活动太冷清了，都没有人重视——真是个机智的选择。\n\n当时我的面部肌肉稍微拉起来一个微笑，没有接话。\n\n---\n\n典礼之前气氛凝重。\n\n去年10月份，驻在且主宰巴勒斯町 (Palestine) 之加沙地带的哈马斯组织突击以色列，随后以色列动员正规军反击。（我在博客上做了[新闻剪报。](war-in-2023-between-hamas-and-israel)）局势发展到典礼前两周的周五，包含本校学生在内的人群，要声援“巴勒斯坦 (Palestinian) 人民”，反对购买了美国军火的以色列进行“种族灭绝 (genocide)”，在学校扎帐篷、静坐、抗议。\n\n典礼前两周的周六深夜，校内所有建筑上锁，警察以侵犯私有地产 (trespassing) 为名警告，后扫荡逮捕了空地上拒绝离去的人群，有人受伤，有人被控拒捕和袭警，有人指控暴力执法。\n\n典礼前一周的周四深夜到周五凌晨，一夜之间，校方围绕校园一圈，以及在校内部分建筑之间，搭起了钢管作边框的预制栅栏，栅栏的底座钉在水泥地上，之间用铁皮绑住，尽头钉在建筑的墙上，只在个别位置留下专人把守的路口，下班时间门将走后上锁。\n\n不过物理系正好位于这个铁网迷宫的一个拓扑范畴边界上，即使下班时间也可以从不同的门去往不同的路径同伦 (path homotopy) 等价类，算是影响不大。\n\n---\n\n典礼前的周四上午，物理系年例集体合照，拍完照片去取预租的学位袍。一套衣服租需要 $90，嫌贵？买或者租而不还的话 $900，不穿参加不了典礼哟～\n\n取衣服的位置在学校书店地下一层，看到队伍已经拍到一楼门口了，心里咯噔一下子。好在美国人排队的平均自由程比国内大不少，每个人在自己位置上跍踊的热运动温度也比较低，所以队伍排起来也不算压抑。问清楚了还衣服的时间和地点。\n\n美国的学位袍是各校自己定的样式，连颜色都没有本黑硕蓝博红的规定。来这里的第一个寒假前，看到冬天毕业的学生都穿着土褐色的袍子，霍格沃茨里面最没有特点的赫奇帕奇的专属色，真想退学重新申请，唉，沉没成本啊沉没成本……\n\n装学位服的袋子里有一帽子，一袍子，还有一扁三角形布料，应该是就是 hood。这个词的本意是兜帽，此处展开后前端是一个类似于 ~~JK制服~~ 水手服的三角形领子，后半截确实可以被理解成兜帽，但是长度够垂到大髀，估计没人想套头上。\n\nHooding 就是由导师把这个大领子套到学生身上，类似于国内的拨穗。所以邮件里才要求博士生集合的时候不要自己把领子穿上了。\n\n---\n\n周四晚上睡不着，于是去校园里散步，顺便听秦晖先生的油管视频。自从养成散步的习惯以来，已经在校园里摸索出一条路线，可以全程户外的同时校园 WiFi 也不掉线，省流量。视频在全屏模式下，按电源键关掉屏幕，然后立即抬起屏幕点继续播放，可以熄屏且免广告。\n\n很多学生呼朋引伴在校园里，大家都穿便服，毕业周也是期末考试周，可能既有毕业生也有觉得考试是件大事的屁孩。大家几人十几人一群庆祝和发泄，做一些平时不敢做的事，美其名曰创造回忆。\n\n比如有一男生在中央草坪边一座亮黄色消防栓旁边酝酿半天，半蹲半跪，我经过之后，他身旁的朋友发出一阵欢呼。我什么也没有闻到。\n\n比如有一女生坐在法学院门廊旁边的亮黄色消防栓上，我经过之后，她身旁的朋友发出一阵欢呼。除此以外我什么也没有看到。\n\n比如有一群学生，在中央草坪一角的大树下，和我打照面经过，举起手里的易拉罐畅饮。我没看清易拉罐是何种饮料之容器。\n\n---\n\n周五是 hooding ceremony 的正日子。早上穿便服去学校假装工作一上午，中午系里有烤肉自助，吃完回家换衬衫正装裤子和鞋，毕竟穿一天实在是太热了。\n\n本来答辩的时候也想这么穿的，结果写论文期间吃饭不太克制，答辩那天早晨发现胖得裤子穿不上了。现在减肥初见成效，很高兴。\n\n换衬衫回来之后赶紧去卫生间看打领带的教学视频，勉强赶在集合时间之前打好了。\n\n学姐也赶回来参加庆祝活动，在我办公桌上放了一束花。\n\n然后我们系的老师和同学一起往准备厅走。我老板也穿戴好了。 陈郝问他的学位袍是 H 家的还是 M 家的，我老板答曰 Amazon 家的——我们之前闲聊的时候说到学位袍很贵的事，陈郝一本正经地给我科普，如果留在学界的话，一般都是买本校的袍子将来正式场合一直穿的——这都让我知道你不懂装懂了～\n\n在准备厅门口，让我们扫二维码填表，好让学校请的摄影师根据信息把照片发给我们。准备厅内签到，拿到自己预先填好的名片，学院的头儿问清楚每个人名字的读音，用笔在名字卡的读音位置补充标记。然后按导师的名字排队。\n\n离开准备厅前往礼堂。整队很快，在路上等了一会。没话找话，我问我们老板最喜欢的球队是哪只，他说巴黎圣日尔曼，卧槽我不该问的，他问我，我只能照实答多特蒙德，然后他开始说奇怪的话，什么门柱啊运气啊，啊对对对，祝你们下赛季走得更远好吧……\n\n进入堂内，先进去的家长们举着手机录视频拍照；落座后放音乐，原来管风琴是摆设；讲台后面的彩色玻璃很好看；老板问我们之前来没来过，我说维尔切克的讲座好像在这里，也可能是我记错了。\n\n各种讲话，每人的讲稿倒都不长，校友代表是文学男博士，成就是创业写了个给图书馆使用的 APP；毕业生代表是生化女博士，丈夫是神父，说在这里讲话让她感受到了他工作的不易和家庭的重要。\n\n然后依次上台，院长念名字，导师站上祭台，学生站在台前，挂上领子，和校教务长握手，合影，下台，拿一个毕业证书摆拍大头照，回座位。\n\n仪式结束后，外面的院子里准备了酒水和零食。我和老板匆匆吃了两大盘，然后赶回系里，师妹上午通过了博士资格考试，我们回去之后开了一瓶香槟给她庆祝，然后闲聊胡扯。我们老板非常得意地发表了他对于为什么要按老师而不是学生名字排队的归因。\n\n晚上，庆祝毕业的同学们一起去了一家中餐馆吃饭。老外们一个两个都在点地道中餐，于是我点了一个蜜汁核桃虾仁。\n\n---\n\n周六穿着袍子和一起毕业的硕士学弟还有他妈妈一起，在校园里拍照。啊，妈妈不在身边的孩子像根草～\n\n---\n\n周日搬家，新家远，需骑自行车上学，且是丘陵坡路。\n\n---\n\n周一早晨 commencement，来学校的路上经过操场边，有抗议人群站在栅栏外举巴勒斯坦旗和标语牌示威。本来 commencement 还打算参加一下的，但是骑车过来实在是太累了，于是没去，中午时间到了就把袍子还回去了。\n\nCommencement 结束后 ~~大宴群臣~~，非毕业生对毕业最有实感的活动才开始：吃。校园里各处已经搭好了棚子，每个棚子有一家本地的餐厅在不限量供应食品，有韩式墨西哥菜、珍珠奶茶、烤肉三明治、冰淇淋、可乐……\n\n不想喝可乐的话，也有白水。每个亮黄色的消防栓接出来一根银白色的金属装置，然后连到一个蓝色大水桶，桶底有水龙头可以接水喝。\n\n你们谁爱喝谁喝，我反正不喝。\n\n![](/photos/2024-05-26-legal-high-SP.png)"},{"slug":"farewell-grandpa","filename":"2024-04-08-farewell-grandpa.md","date":"2024-04-08","title":".doc | 爷爷没等到我回来","layout":"post","keywords":["doc"],"excerpt":"消息的时候，脑子觉得我应该哭，心里却只是有点堵，哭不出来。","content":"\n去年春末夏初的时候，每周和爸妈视频电话的时间没人接听，一小时后他们发消息说爷爷住院了，接着视频电话就打过来了。爷爷听力早就不好了，画面里看他还戴着呼吸机，我没有看到他的反应，不知道听见我没有。\n\n这就是我最后一次见到爷爷。本来接下来的周末听说情况稳定了，结果迅速恶化，总共住院不到两周。\n\n看到消息的时候，脑子觉得我应该哭，心里却只是有点堵，哭不出来。当时这边是晚上，我在办公室，我们老板从来不黑脸，从他很有耐心的话中，我觉得他对我的论文初稿很不满意。于是浅呼一口气，继续作图继续写。\n\n---\n\n我上小学前一直和爷爷奶奶住在一起，周末被爸爸妈妈接“回”家里去。那时候我爸白天工作，晚上复习考研；我妈在一个国企内部的小医院，经常上夜班。\n\n那段日子的绝大多数时间并不开心。小孩子哪懂什么考研和夜班，只怀疑爸爸妈妈是不是不要我了。和爷爷奶奶在一起按理说是一种安慰，但是要上幼儿园。\n\n奶奶退休前是小学老师。搞教育的人，经常对自己家孩子的教育有点不切实际的想法，入园就给我插到了中班去。发现跟大孩子一起根本融不进去之后，又给我调到小班，完美错过小孩子刚认识的时候交朋友的阶段。\n\n再加上幼儿园学的东西真的好难，老师教折纸，先这样折，那样折，翻过来，在这个地方剪一刀——三步以后我必然听不懂。只能在其他小朋友举起劳动成果的时候偷瞟左右，趁大家不注意把自己的纸团藏到桌洞里去。开始是伸手放进去，后来熟练了，手腕一抖就投进去了。半个学期就能攒满一桌洞，需要老师举起桌子倒出一摊，拿笤帚扫成一堆。\n\n于是毫无意外成为大家的笑柄，我们班里有个傻子，嘿嘿。\n\n所以不想上幼儿园。早上和爷爷一起走着去幼儿园，走两步我就战战兢兢嘱咐一句“可千万别忘了来接我啊”，很短的一段路，我能一字不差地问三百遍。爷爷攥着我的手，严肃认真地回“嗯，一定不会忘”，一字不差地回答三百遍。\n\n中午回家吃饭睡午觉，爷爷说，要是睡过头了的话，下午就不去幼儿园了吧。于是直到上小学的前一年，我每天中午都会睡过头，“睡醒了”就在家里跑来跑去，等到太阳西斜了，跟着爷爷去门球场，他跟老伙计们打门球，我在细红线勒出的边线外面玩沙子和计分板。\n\n就这样一直玩到天色幽蓝，那样的幽蓝仿佛日日如此，总有爷爷带我回家。\n\n---\n\n这样的日子回不去是理所当然，但是没想到连这样的回忆也再难听到了。这种糗事本来是家里聚餐时饭桌上最常听到的谈资，毕业回国和伯伯、姑姑、叔叔家相聚，席间还是他们在说，话题却变成他们记得的爷爷奶奶的故事，我成了远方来客，成了不便开玩笑的别人家的孩子。\n\n我才意识到，和我记忆中的退休老人形象不同，父辈们眼中的爷爷，还是他年轻时候的样子。\n\n我又意识到，不是爷爷年轻时候的样子，而是和我一样，是记忆中我们小时候他的样子。\n\n那时候的爷爷在我市周围某县的一家半导体工厂，所谓半导体其实指的是收音机，所谓工厂是一间福利厂，就是给县里机关和事业单位的家属安排工作用的，不以赚钱为首要目的。比如厂里的会计是副县长的老婆，进厂的时候是个文盲，算账是和认字一起学的。\n\n姑姑说爷爷是厂长；我爸说不对，爷爷是厂里唯一的技术员。\n\n这些故事总有许多个版本，就比如厂房施工的时候，有辆满载一板车砖头的驴车上坡，结果有个熊孩子喊了一声“吁~”，驴子停在半坡不走了，把赶车的工人吓了一跳又气得不轻，但是不敢发作，因为不知道是谁家的孩子。\n\n那熊孩子是谁来着，是不是我爸？我爸说不是，是会计的儿子。真实情节说不清楚，只有“吁”是全世界驴子停车的通用口令，是无数大语言模型在甚高维嵌入空间的交点。\n\n后来改革开放，厂子散了，爷爷联系了隔壁县的一所师范类大专，成了一名物理老师。后来全家跟着学校搬迁到城市，我出生长大的地方。\n\n很奇怪，这些回忆日常得异常，那些惊天动地的大事，模糊得像烛光投在墙上的影子。\n\n日寇侵华的时候，往我们老家所在的海边渔村仍了一颗未爆的哑弹就再没来过；爷爷的叔叔带船队北上做生意，结果连人带货和船一起被扣了，爷爷的爸爸卖了好多田地去赎人，于是土改只被定了个中农；工农兵推荐取代高考前的一两届考上了大学；政治运动里整人没资格，被整也没把柄……\n\n可能也不奇怪，能活到今天的大家，要么是惊涛骇浪的幸存者，要么是幸存者的后代，除了史书上主角中胜利的那一小撮，谁还不是有点运气在身上呢。除了胜利的一小撮，比起一句顶一万句，一天顶一万年的狂飙突进，谁不更希望打门球，看孩子玩沙子，玩到天色深蓝呢？\n\n---\n\n于是继续玩沙子，玩到天色幽蓝，爷爷带我回家。\n\n有一天在幼儿园里，画册上有一道益智题，一个四乘四的方阵，横竖斜线四个方向上四种水果排列起来。我觉得图案很漂亮很有趣，想回家给爷爷看，于是中午一到家，就要找纸笔要画下来。结果画到一半，剩下的图案就不记得了，急得我要哭。\n\n爷爷在旁边微笑着看，见我画不出来了，把笔要了过去，把剩下的水果补全。爷爷画不好水果，就把水果的名字写在空白的地方。这么神奇的吗？爷爷不是没看过那本画册吗？这两字是什么，真的是菠萝没骗我吗？\n\n这叫规律，世界上的所有事情都是有规律的。爷爷拉开木柜子上一个很沉的抽屉，金属和润滑油的气味飘散出来，他拿出好多小灯泡、电闸和电池盒，组了一个电路，拉下不同的电闸，不同地方的小灯泡次第亮起来。\n\n我还是不信，把那几个水果的名字认全了，下午要去幼儿园验证一下爷爷猜的对不对。晚上回家吃完晚饭看新闻，播音员说的话和电视上写的字是对应的吗？只有爷爷很高兴，出门溜弯的时候，逢人就说他孙子脑子开窍了。\n\n还是继续玩沙子，慢慢有其他小孩加入了进来，社恐的我也有了一两个朋友。在幼儿园还是不敢出去做广播体操，于是在教室里上凳子，算是帮老师打扫卫生。爷爷出门溜弯的时候，逢人就对他说，听说你孙子脑子开窍了……\n\n---\n\n然后回到爸爸妈妈那里上小学，从朝夕相见，到周末不见，到只有周末相见，再到每个寒暑假相见，再到没能再见。\n\n这次回家，爸妈开车去接我，回城那日天气极好，车在河边新城一侧的快速路行驶，对岸的天际线满满当当是已经炒到上万一平米的住宅楼。师专的图书馆曾经是河边唯一的高楼，如今隐没难寻，仔细找到后却发现像人群中站着个矮胖墩，尴尬，不如不复相见。\n\n回到家里，旧桌旧椅旧沙发，其中一个沙发上坐着一只洗得干干净净的黄色玩具熊。小熊也已经等了我五年了啊，于是趁着爸妈还在收拾其他行李的机会，把行李箱推进自己房间，轻轻关门，无声地任由泪水流下。\n\n---\n\n有一年我爸从外面回来，兴高采烈要找爷爷，进门就喊“老头儿呢？老头儿呢？”奶奶在包饺子，双手沾了面粉和馅料，只瞪了他一眼。当时的我坐在地上玩，抬头看我爸，感到很不高兴，这个大人怎么这么没大没小的。\n\n如今我也快到了当年我爸的年龄，被他抓到他笔记本电脑面前，问他的网页浏览器图标上怎么有一个头像。原来是不知道什么时候无意中打开了个没用的功能，这点小事都整不明白，想叫他“老头儿”的冲动愈发强烈。"},{"slug":"state-of-blog-2023","filename":"2023-08-15-state-of-blog-2023.md","date":"2023-08-15","title":".doc | 博客咨文 2023","layout":"post","keywords":["doc"],"excerpt":"以往过年的时候，都会在博客写一篇年终总结。今年没写，主要是当时觉得自己春季学期结束就要毕业了，需要努力工作，至少要摆出一副努力工作的样子。","content":"\n以往过年的时候，都会在博客写一篇年终总结。今年没写，主要是当时觉得自己春季学期结束就要毕业了，需要努力工作，至少要摆出一副努力工作的样子。\n\n之前的文章里大概也提到了，论文投稿之前各种小修小补、准备参加三月会、投简历、面试且自以为成功找到了工作，毕业已经是再努力也没办法在春季学期结束之前完成的事情，于是博客恢复了更新。\n\n跟老板说了一下，毕业推后到了暑假，~~上周~~ 上上周完成。45 分钟的演讲，理论上无限实际上 20 来分钟的问答，难度最高的环节是演讲之前打领带，温莎结。\n\n越到这种时候越觉得，如果把人生比作道路，更准确的喻体应该是高速公路，显然不是因为速度高，而在于其中一个一个的进出口，真正留给人选择的机会有限，剩下的时间和路程里，能改变行程的基本都是事故。所谓答辩，不过是出口收费站过 ETC，其重要性还不如和老板半闲聊时，假装不经意地说自己想毕业。\n\n---\n\n### 数据\n\n毕竟是博客咨文，说回博客和各个内容平台的事。\n\n博客的流量比较稳定，每天都能有一点，一月无事也能有 300-400 访问，有更新的时候能到 600-700，碰巧击中流量密码的话能上千。最近新加了 Google Ads，迄今累计收益 50 美分，成了名副其实的洋五毛。(~_~;)\n\n微信公众号一如既往地店大欺客，一篇文章的展示周期在三天以内，不加星标的话几乎看不到推送，打开率基本是关注人数的 1/10。两次例外，可能是击中了流量密码，分别是 《python decorator 装饰器笔记》和《PINN 基于物理的神经网络笔记》，完全不知道为什么，后一篇文章甚至因为格式问题，根本没放读书笔记的主体部分，就因为提了一句《三体》？总之关注人数比上次年终总结多了两倍，接近 200 人了…… (−_−＃)\n\nMatters 吧，不提了，简体中文作者还剩几个？基本上成了微信被删文的备份站。(╯°□°）╯︵ ┻━┻\n\n作为对比，我的前女友·隔壁课题组的学妹·托洛茨基主义者·未明子粉丝，在 B 站发了一个未明子式的视频（一个白板写写画画，旁边一张帅脸，讲授哲学，时长半小时甚至一小时以上），内容是从哲学角度批判高等教育的布尔乔亚劣根性，一把子攒了几千粉丝，几十万观看量。我只看了文字稿和评论区——我看不懂，但我大受震撼.jpg\n\n两相比较，一言以蔽之，曰：彻底失败。\n\n---\n\n### 反省\n\n既然已经做了流量生意，说自己从来就不在乎做没做好是在是有点虚伪了。\n\n和前女友的交往，确实让我学到了很多东西。很多“常识”，要么不是那么寻“常”，要么只是观点而不是知“识”。世界的全貌，观众的参差，是从小走学习考试独木桥的我，需要时刻提醒自己才能意识到的现实。\n\n另一方面，自己作为一个内容消费者，看自己喜欢和订阅的自媒体的时候，也试图摸索出来一些成功密码。一言以蔽之曰：同义反复，频率恰当（前提是以视频为媒介，微博既出，阅读已死）\n\n看自媒体生产的内容这件事，毕竟是一个娱乐行为，只能从各种正事之外挤出来。正事不论多少，每天每周基本是固定的，自媒体要想干得长久，就必须把自己嵌入观众的生活习惯中，尽可能降低观众点进你作品的注意力成本。\n\n频率要求必然导致同义反复，批量生产已被证明是算法青睐的模式。在前期已经做出规模的自媒体大号已经拉起团队，进行专业化分工的当下，个人还想作出点东西，这些模式大概率是自己之前的专业技能，比如做饭之于王刚师傅，下象棋之于徐银川特大，玩红警之于月亮3。暂时能想到的例外，就是时评键政，在此不表。\n\n---\n\n### 嘴硬\n\n作为一个物理博士·生物狗·小镇做题家·眼红美本富二代的苦逼研究生，我写博客的本意是践行费曼学习法，我的本职工作是学习，不是练习。\n\n练习可以同义反复，甚至以耐得住枯燥为法门；学习不行，学习需要耐得住枯燥，但不能以枯燥为荣。\n\n在公理化体系被发明之后，学习需要尽快摆脱同义反复的阶段，从排比句式的知识中识别逻辑关系，添加进自己已有的知识体系，用『逻辑推演』替代『倒背如流』，整个过程就叫领悟，如果这个相变过程比较快速，就叫顿悟。\n\n很多学习类网红搞不清这个道理，也做不到，所以学习笔记一篇一篇地晒，一考试就是大专。\n\n熟练之后，领悟也许可以重复，但无法保证频率的稳定，因为你不能保证所学的每件东西难度都相同。既然不能同义反复，这注定是个于流量无缘的分类，我们也看到，有些学人涉足流量之后，确实变了。\n\n---\n\n### 求职\n\n说到本职工作，之前谈好的博士后岗位无了。\n\n交上两封推荐信之后，那老哥来和我视频联系。他所在大学的研究生罢工活动前不久取得了胜利，博士和博士后的工资待遇提高了不少。老哥的入职 offer 是在工运之前谈妥的，所以启动资金不足以支付新的博士后工资。老哥推荐了一个基金会的资助机会，让我去申请一下。\n\n毕业前 Paul 办了个在家聚会，同学听了我的事之后骂声一片，说这一看就说明之前只打算给最低工资。此事我办得也不太体面，只在申请截止日期之前，用 ChatGPT 随手糊了一套申请材料。差老哥自己的推荐信，他看了一眼说算了。然后说还是瞄准其他资助机会，我也没说啥，基本默认结束了。\n\n老板写推荐信那周的全系茶歇，为了在同仁面前装叉，跟我说他认识那老哥的博导，我不如直接去找她，毕竟博后的门派声望重要得很——我心说，难道门派对博士就不重要了吗。\n\n发邮件过去完全没有回复，老板又给我列了个接近20人的名单。用 ChatGPT 写邮件挨个轰炸了一遍。收到两份回信。\n\n我比较感兴趣的是我们老板做博士时的隔壁。收到两封推荐信之后，约在答辩的第二天面试。面试的结果我拿不准，可能老大爷比较有经验吧，各方面都没有说死，比之前的老哥显得“渣男”一些。这样也好，博后本来就不是个稳定关系，像之前的老哥，话说得太好听反而更加让人失望。\n\n有两条困难，一是经费获批的时间不确定，二是明年他会 sabbatical，不见得有很多时间指导我。最后说 8 月底会有一场相对公开的组会，让我在那之前联系他拿 zoom 链接，了解一下组里的工作方向。\n\n即便顺利的话，入职时间也是明年，在此之前我会在现在的课题组里继续之前没完成的一些项目。\n\n---\n\n### 攀比\n\n说到工作，之前的同学基本上今年或去年也都毕业了。\n\n本科同学里，风神在某公司深圳分部做量子计算，跟我说的年薪是 50 多万，因为入职的时机不好；木木在同一家公司的上海分部，做光刻胶材料，据风神说年薪 100。有望留在学界者，聊哥在锦屏山实验，毕业之后好像要 gap 一年；班长欧陆硕士英国两校读博，没听说毕业的消息，看 arxiv 好像在做凝聚态；潇洒哥继续在国内做天文。其他人都没有消息。\n\n博士同学里，同实验室的学姐在一家生物公司做临时工，年薪 6 万有望转正；小马去了一家量化交易商实习；低我一级的阿卷年底毕业，先去大摩实习。我们年级的天文美国三人组应该都会留在本专业，国际学生则不一定。凝聚态热门组的两人都在本组或合作组继续做博士后。方做粒子物理，回国做博士后。美国博后的普遍工资也就是 5 万上下。比较在意者，和我关系不好的一个女生去某芯片硬件公司做软件工程师，年薪 16 万，上网查了一下，这个工资是“资深软件工程师”，博士刚毕业就能资深吗？狠狠地嫉妒了。\n\n本来觉得毕业去搞钱挺划不来的，毕竟内卷一辈子，可能只是将将摸到别人的起跑线。而且学界身份比之企业界还是更唬人一点，作为一个自由派、民族主义者和中国人，看到前女友那种宗教狂热，又总觉得有些事需要有人做，而我依然有希望够身份去做。“够身份”是一种非形式逻辑谬误，但就像清教徒“上帝的选民”的信念一样，逻辑上不必然成立的东西，实践中却可能有效。\n\n但是看到自己的本职工作投出去连同行评议环节都到不了，直接被编辑就给毙了；业余玩票的天文反而水了两篇文章了，又觉得这评价体系，这逼科研，谁爱做谁做吧。\n\n现在的想法是，暂且做完下面一期的博士后，看看这个学界对我到底如何定价，稍不顺意，就去搞钱。趁休假改掉之前超时工作的毛病，业余时间继续搞点 IT 副业。以我的执行力，希望明年博客总结的时候能做出一些东西。\n"},{"slug":"what-is-intelligence-not-same-as-intelligence-is-what","filename":"2023-06-17-what-is-intelligence-not-same-as-intelligence-is-what.md","date":"2023-06-17","title":".tex | 什么是智能≠智能是什么","layout":"post","keywords":["tex","doc","md","ai"],"hasMath":true,"excerpt":"“什么是智能”的问题每每得不到回答，是因为它的逆问题“智能是什么”没有答案。","content":"\n## 0\n\n这是一篇酬和之作。\n\n徵文标题说的是：\n\n> **機器會製造「內涵」嗎？**\n> \n\n但是正文提出的问题是：\n\n> AI透過程式組合出回答你問題的文字組合，有「涵義」嗎？\n> \n\n可是，「內涵」和「涵義」两个词的——内涵/涵义——就不完全一样啊……\n\n“内涵”(connotation) 通常指词语或表达方式所隐含的情感、态度、暗示或附加的意义。它涉及到词语或表达方式所引起的情感、联想或隐含的观点。也就是弦外之音。\n\n而“涵义”(meaning) 一般指词语、表达方式或行为所传达的字面意义或字面上的定义。它强调的是直接的、明确的意义。\n\n看热闹不嫌事大，那我们再把问题搞复杂一点——在逻辑学里也有一个“内涵”(intension)，和“外延”(extension) 相对应。用**面向对象编程**的说法来理解，一个类里面定义的所有状态量和内部方法的集合，就构成这个类的“**内涵**”；所有（已经和将来能够）从这个类实例化出来的对象的集合，就构成这个类的“**外延**”。\n\n所以看起来，征文者想问的是日常“内涵”也就是言外之意，但是怕杠精（比如我）用有严格定义的逻辑“内涵”解构掉，所以换了“涵义”一词。\n\n这个问题很显然是因应最近大语言模型掀起的这一波 AI 浪潮。这个问题往前再问一句，就是“大语言模型是智能体/有智能吗？”\n\n- 前两年 DeepMind 的 AlphaGo/AlphaZero 系列 AI 在围棋中击败人类棋手时，人们也在问这个问题。\n- 上世纪四五十年代专家系统 (expert system) 刚刚开发的时候，人们也在问这个问题。\n- 从电子计算机往前追溯到机械计算机，甚至是巴比奇的差分机的时候，人们就已经开始问这样的问题了。\n\n这些问题求并集，然后在问题数量趋近于无穷下的极限，就是“什么是智能”。\n\n这样的问题每每得不到回答，是因为它的逆问题“智能是什么”没有答案。我们并没有智能的准确定义，只能一事一论。而之前的智能和非智能体的区别太明显，以至于作出判断也不能对智能的定义有所启发。\n\n## 1\n\n而对“智能是什么”的探究，哲学、逻辑学、计算机科学、生物学、管理学，不同领域的研究者有着不同的思路。\n\n### 古哲学·洞穴之壁与理念世界\n\n古希腊哲学家柏拉图在《理想国》里提到了“洞穴之壁”的寓言故事。\n\n有一群被囚禁在一个深洞的囚徒，从出生开始就被束缚在这个洞穴里，脖子和腿都被铁链锁住，没办法转身或离开。囚徒身后的洞穴入口处有一道火焰，火焰后有人持物体走过，物体的投射在洞穴内的墙壁上形成了影子。囚徒们就以为这些影子就是唯一的存在。\n\n这里的囚徒代表着人类，洞穴代表着世界，影子则代表着我们对于现象世界的感知和观念。人们的知识和信念往往受限于自己的经验和感知，就像囚徒们只看到了洞穴墙壁上的影子，而在影子之外还存在一个理想的理性世界。柏拉图用这个寓言故事表达了他对于人类认识和智慧的理解。所谓智慧，就是从洞穴的影子反过去推测火把前物体的能力。\n\n当然，这种思想被 Marx 主义定性为一种客观唯心主义、唯理论，是受其批判的。\n\n### 逻辑学·从命题到希尔伯特算符\n\n柏拉图的学生亚里士多德，今天在低年级的物理教科书里基本是个反面典型，但他对逻辑学进行了系统化和全面的研究，提出了许多逻辑学的基本概念和原理。这些成果后来成为了欧洲哲学和逻辑学的基石，对西方哲学和科学的发展产生了深远影响。\n\n所谓逻辑，就是研究命题的对错，以及如何判断命题对错的学问。而命题，就是能被判断对错的句子。但是句子显然可以再分成不同成分，于是就发明/发现了主体、客体、谓词、谓词的量词……等等概念，以及用这些概念构造命题的方法。\n\n但是要注意，虽然逻辑主要由语言来表达，但是逻辑还是和语言不同，主体、客体也不等于句子的主语、宾语。这两者的区别，基本可以类比于之前洞穴之壁寓言里的实体和影子。\n\n这种努力到目前为止的巅峰，基本上要数希尔伯特形式化逻辑系统了。感兴趣的朋友可以自行查阅戈得门特《代数学教程》的第一章，这玩意相当于思想界的引体向上，反正我是一个也拉不上去……\n\n### 计算机·从半导体到抽象语法树\n\n希尔伯特是德国的数学家，《代数学教程》也是数学而不是哲学教材。显而易见，逻辑虽然由哲学家奠基，但是主导权很快落到数学家，至少是哲学家兼数学家手里了。\n\n命题的“真”与“非真”同构于 {1, 0}，各种逻辑运算都可以分解成“或”与“非”两种基本逻辑运算的组合，这就是以数学家乔治·布尔 (George Boole) 命名的布尔代数。因为 {1, 0} 又可以同构于半导体电路的高低电位，和各种类似继电器的门电路组合，所以很容易用计算机在物理世界表示出这些逻辑运算。\n\n我们的电脑由上亿个这样的电位和逻辑门组成，一般的科普文章应该会去介绍芯片啊光刻机之类的东西，本文关注的是另一个方面：虽然生产电脑配件的厂商很多，不同的型号的元器件设计不同，组装出的成品应该千差万别，但是他们可以运行同样的程序，理想条件下（虽然实际工程中常常不理想）我们也可以期望他们跑出同样的结果。\n\n这说明所谓计算机科学，并不等同于研究计算机元件的电子科学和工程，这里电科和电子工程相当于洞穴岩壁上的影子，而计算机科学就相当于火光前的物体。这种超越物理的计算本质，一般用一种叫做“抽象语法树”的数据结构来表示。\n\n### 生物学·从神经元到神经网络\n\n人们发明计算机的时候，基本上还是把它当作工具，就没期望它有什么主体性和智慧。\n\n而随着生物学逐渐发现了神经系统及其作用，也随着物理学在二十世纪初的大发展之后的相对平静，很多物理学家开始插手其他学科。既然生命和非生命体的背后都服从同一套物理规律，既然物理学的众多成功经验说明，搞清楚构成系统的所有微观组成就可以理解宏观的系统，那么搞清楚人类的智力器官的基本单元以及相互作用，按理说也就能够理解什么是智慧。\n\n![a cartoon illustrating a neuron](/photos/2023-06-17-neuron.png)\n\n上图是一个神经细胞的结构示意图。从其他神经细胞释放出来的名为神经递质的化学物质，到达神经元左侧短且密集的树突之后，激活细胞膜表面的离子泵，主动运输离子跨过细胞膜，从而产生电信号。电信号沿细胞膜传导到右侧的树突，刺激凸触释放神经递质给下一个细胞。\n\n![a handdrawing style illustration of perceptron](/photos/2023-06-17-perceptron.png)\n\n上图就是根据神经元的工作原理抽象出的数学模型，名为 perceptron。一个 perceptron 就是一个函数，接受多个输入的自变量，加权求和之后套一个非线性的激活函数，得到一个输出。很多个这样的 perceptron 并连和串联，就构成下图，计算机算法中的神经网络。\n\n![a handdrawing style illustration of a neural network](/photos/2023-06-17-neural-network.png)\n\n而从实验方向研究神经系统，我们隔壁系就有，经常来我们系招人。基本上就是在小鼠的天灵盖上锯开一个天窗，然后给它带上个头盔，头盔上有能从天窗伸进去的电极，采集脑神经的电信号。以前头盔有网线伸到实验室天花板，实时传到数据中心的超算。现在好像进步了，改用 Wi-Fi 了。\n\n这实验怎么通过的伦理审查，咱也不知道，咱也不敢问……\n\n### 管理学·DIKW “数据-信息-知识-智慧”模型\n\n![a pyramid of DIKW model](/photos/2023-06-17-DIKW.png)\n\nDIKW 四个字母分别代表 data, information, knowledge, wisdom，即数据、信息、知识、智慧，是一种知识管理中的心智模型。\n\n四个层次，前一层都是后一层的基础，后一层都是对前一层的理解。\n\n如果是书面文字，数据就是笔画和字母；如果是语言，数据就是人声的响度、频率和音色。由笔画/字母/声音组成的有含义的字词就是信息。表示信息之间的关系的，可以判断对错的命题就是知识。包含和统摄各条知识的思想体系，就是智慧。\n\n反过来说，虽然智慧高于思想，但它仍需要通过把各条知识的表达汇总起来，才能被人感知。对知识的命题的理解依赖于构成名字的各个概念的涵义，属于信息水平的内容。而每个字都有不考虑其涵义的笔画字母构成。\n\n这层与层之间**看似**并没有插入额外的内容，智慧可以直接由笔画构成。但是我们一层层理解的深入，其实是不自觉地借用了我们当前社会约定俗成的解读方式。\n\n比如下面这个图片里的符号，对于现代人就只是数据，无法解读成信息。但是对于苏美尔人，这是用楔形文字表示的数字，是等腰直角三角形的腰和直角边的比值，也就是 $$\\sqrt{2}$$ 的近似值。\n\n![sumerian numerical approximation to square root of two](/photos/2023-06-17-ancient-root-2.png)\n\n约定俗成的数据解读方式，也就是关于**数据的数据**，根据西方的构词法，可以叫做“**元**数据”(meta-data)。\n\n数据和元数据一起构成信息，信息和元信息一起构成知识，知识和元知识一起构成智慧。俺坚持写博客的动机，就是用费曼学习法，把无意间使用的元知识显式地表达出来，而且记录下来，争取学而不退转。\n\n## 2\n\n回顾了这些，再来看大语言模型，就会发现它落在了各方努力的延长线的交点。\n\n大语言模型里有一个重要概念叫做“嵌入”(embedding)，就是把语言的基本字元 (token) 可逆地映射到一个超多维度的向量空间里。本来“国王”和“儿子”之间没办法加减乘除，但是嵌入后的向量空间里有加法和数乘，如果嵌入函数选得好，“国王”的向量 + “儿子”的向量，结果向量就约等于“王子”的向量。\n\n![illustration of vector addition from wikipedia](/photos/2023-06-17-vector-addition.png)\n\n生成式语言模型的核心就是一个超多元函数，接受前一个字嵌入后的向量作为输入，给出另一个向量作为输出，用嵌入函数的逆映射翻译成字元；再把旧的输出作为新的输入，直到输出结果是“语段结束”这样一个特殊字元为止。模型训练的过程，主要就是通过现成的语料，拟合这个超多元函数的参数。\n\n从 DIKW 模型来看，语言模型操作的是最基本的数据，它的输出究竟是什么信息，是不是正确的知识，体现了多少智慧，是人根据当下的社会文化来解读的。\n\n而实现 AI 的电子计算机，或是复杂生命的大脑，他们和智能之间的关系，应该就类似于具体的计算机电路和抽象语法树之间的关系。以此类比，未来的智能科学应该会成为一门独立的专业，它和计算机科学和神经生物学的区别，就像今天的电子科学与工程，和计算机科学之间的区别一样。当下神经生物学的热度，将来恐怕多半会被分流。\n\n这种对字符的计算不同于逻辑运算，语言模型不判断输出结果在逻辑上的正确与错误，这既给了他啥都能说几句的 feature，又给了它经常编假消息的 bug。\n\n想要改掉这种错误，引入对 AI 的纠错机制，治本之道恐怕还是诉诸于对世界的正确描述，与理论相关的还是要靠逻辑，与现实相关的还是要靠科学。\n\n只不过，大语言模型提供了一种数据结构，有希望把人类已知的真理储存在一起。对这种数据结构本身的研究，有可能反过来启发科学的发展。柏拉图的洞穴之壁可能不再是一个比喻，未来更大的语言模型的，亿万维度的参数空间有希望成为洞穴门口的那团火。\n\n只不过这一切都是“可能”，现在还只是 AI 的萌芽阶段，还没有足够的证据来证实或者证伪这种畅想。而且 AI 的参数量再大也是有限的，它所能表达的信息也就有限，而真理应当是无限的，就像科学一样，总要训练更新更大的模型，总要发现已知的未知，然后欣然接受更多未知的未知之存在。\n\n如果电子计算机实现的 AI 独立于人类产生了意识和超出人类的智慧，很难想象他们会继续用人类语言这种对他们来说很不方便的方式来交流。\n\n所以，哪怕是做个 AI 生成内容的质检员，科学家依然有事可做。这算是科学的堕落吗？当然不算，如果算的话，那从计算物理也被当作理论物理的那天起，人类就已经投降了（逃）\n\n## 3\n\n现在正面来回答问题：AI透過程式組合出回答你問題的文字組合，有「涵義」嗎？\n\n答：有。\n\n因为语言的「涵義」来自于语言的内容，和整个社会的文化，并不来自于这句话的作者的身份。即便是人与人之间的交流，诉诸身份也是一种非形式逻辑谬误，是理性不足的表现。只有在信息不足仍不得不下结论的时候才该使用，比如法律判决时的自由心证主义和/或法定证据主义。\n\n而鹿妈眼里真人鹿酱与 AI 鹿酱的区别，如果有的话，好像主要体现在动机的区别。动机这种东西，很多智慧不高的生物，比如小猫小狗都会有；而现在的 AI，似乎还没有展现出超出编程者设计的动机。编程写入的信息有限，现有 AI 的动机也就有限，鹿酱的赢面还是很大的。\n\n而动机是生物与非生物的区别吗？而什么是生物 ≠ 生物是什么，那就是另一个含混而复杂的问题了。\n\n## 4\n\n这篇博文发布的时候，高考应该已经结束了，马上该填报志愿了。\n\n那么，西元 2023 年，AI 来袭的当下，该选个啥专业在 AI 浪潮中幸存，或者选个啥专业给 AI 老爷带路呢？\n\n![a screenshot of a quotation from Three Body about attitudes towards aliens](/photos/2023-06-17-three-body-quotation.png)\n\n我的建议是，不要听别人的建议，按自己的兴趣来就好了。\n\n刚刚改开的时候，有一个超级热门的专业，叫科技英语。科技落下了好多年，对外开放需要语言交流，两者一结合应该是热门又稀缺了。结果呢，你现在还听说过这个专业吗？\n\n科技很重要是不错，语言很重要也不错，但是搞科技的人自己可以学英语，学英语的有几个搞得了科技？社会的进步主要靠创新，而创新的方向难以预测，不论这种预测分析听起来多有道理。\n\n如果真的找不到兴趣，那就在能力范围之内，找个难度最高的。如果想从事智力劳动，那数学含量是个不错的衡量标准；如果不排斥体力劳动，那训练时间越长越值得考虑。\n\n但这只是填志愿来不及时的权宜之计，发掘兴趣是人一生的课题。\n\n兴趣不是为了让你成功的时候更得意，毕竟成功的话不论做什么都很得意；\n\n兴趣是为了你不成功时也可以不失意，毕竟平凡才是人生的真谛。\n"},{"slug":"OPT-workshop-notes","filename":"2023-05-19-OPT-workshop-notes.md","date":"2023-05-19","title":".doc | OPT 申请手续笔记","layout":"post","keywords":["doc","xls"],"excerpt":"快毕业了，学校组织了一个毕业实习 OPT 相关的签证手续的讲座，以下为讲座的笔记。仅供参考，可能有理解错误，不构成法律建议，不构成移民广告。","content":"\n\nOPT 是 Optional Practical Training 的缩写，指的是在美国完成学业期间或者之后，允许有一段实习时间，可以工作。但是此时这个人的身份依然是学生，不是工作签证，更不是移民签证。\n\n## 谁有资格申请\n\n已进入美国，并且维持了至少2个学期 F1 学生身份者。\n\n### 学业完成前 pre-completion\n\n在毕业前，学习过程中间可以申请，但是需要与导师商量，很少见。\n\n### 完成后 post-completion\n\n毕业后找工作，应付非移民工作签证还没通过的那段时间，这是最常见的情况。\n\n或者除了没提交论文，其他毕业要求都已满足的准毕业生 all but dissertation, 简称 ABD。申请这种情况的学生需要在EAD日期结束之前完成学位，否则需要回国完成学位（远程答辩）。\n\n## OPT 基础知识\n\n每个有学位的学习阶段都有一次 OPT 机会，但是必须在毕业前申请，不申请就毕业视为放弃，不能攒到下一段学习中多用一次。\n\n仍然是F1学生，不是工作签证。\n\n申请时不需要已经找到工作。也允许换工作和同时干多个工作。可以做有偿/无偿工作，本大学不提供无偿工作的职位。\n\n不需要雇主做任何事情，申请人自己赞助。\n\n## 在 OPT 期间维持学生身份\n\n> 也就是说，下面各条没做到的话会被取消合法居留身份。\n\n![how to maintain the OPT status](/photos/2023-05-19-main-status.png)\n\nOPT 期间从事的工作必须与你的专业领域相关。\n\nOPT 申请通过后会得到一张 EAD 卡作为资格证明。在获得 EAD 卡之前不具备工作资格，没有例外。\n\n只能在 EAD 卡上指明的起止日期内工作。\n\n### 信息申报\n\n在OPT获批并开始日期后，需要创建SEVP门户账户。\n\n以下信息变更之后的 10 天之内，需要通过 SEVP 通知当局：美国家庭地址、雇主及其地址、就业起止日期。\n\n### 不超过90天的失业时间\n\n每周工作少于20小时被视为失业。\n\n在EAD卡的授权期内累计失业时间不能超过90天。\n\n### 上课\n\n只能兼修与当前或未来领域无关的课程，具体情况可以联系 OISS 咨询。\n\n### 离开美国旅行\n\n可以，但是需要携带相关文件\n\n1. 护照\n2. 有效F1签证\n3. 带签名的I20\n4. EAD\n5. 就业证明（可选，如果已经找到工作了的话）\n\n**在OPT申请挂起期间出美国也是可能的，但存在风险**，因为EAD将会寄到申请人的美国地址。\n\n再次进入美国后要在 I-94 记录 ([i94.cbp.dhs.gov](http://i94.cbp.dhs.gov/)) 中确认自己的身份仍然是 F1 学生和 “D/S” 状态。\n\n## 谁可以申请延长 OPT\n\n### 24个月STEM OPT延期\n\n科学、技术、工程、数学专业的毕业生可以申请将 OPT 再延长24个月。\n\n在OPT结束的最后90天内申请。USCIS必须在 OPT 结束前收到申请。\n\n申请时必须有一份工作，雇主必须注册E-verify，需要填 I-983 表。\n\n### H1B 申请获批之前，可以申请“配额间隙” Cap Gap\n\n配额间隙雇主在每年 4 月 1 日提交 H1B 申请。如果获批，H1B从10月1日开始。如果OPT在10月1日之前到期，“配额间隙”将在SEVIS中延长，直到H1B的决定出来为止。\n\n## 申请流程\n\n- 必须在美国申请OPT，应做好准备直到收到 EAD 都一直呆在美国。\n1. 参加研讨会，获取一份申请资料包\n2. 从 OISS 顾问处申请 OPT I-20 表格\n3. 准备并提交 I-765 表格给USCIS，申请OPT\n\n### 需要上传的 I-765 文件与OPT I-20的证明文件\n\n- 移民文件：护照、I-94\n- 之前的 OPT 和CPT，如果没有可以跳过\n- 2英寸 × 2英寸的白底照片；拍摄日期在30天内；公共图书馆、Walgreens和CVS提供此服务\n\n### 时间窗口\n\n**估计申请审批过程需要4周时间。**（往年是3个月）\n\n申请窗口：学业结束日期前的90天 ↔ I-20 结束日期 ↔ 节目结束日期后60天\n\n选择 OPT 的开始日期：I-20 结束日期后的第1天 ↔ 60天宽限期结束\n\n![time window of OPT application](/photos/2023-05-19-time-window.png)\n"},{"slug":"job-search-efforts-during-march-meeting","filename":"2023-04-05-job-search-efforts-during-march-meeting.md","date":"2023-04-05","title":".doc | 三月会·两面试·一座谈","layout":"post","keywords":["doc"],"excerpt":"记录今年三月会上找工作的相关努力和随想。","content":"\n### 会前\n\n今年的三月会在拉斯维加斯。\n\n距离会议大约两周，下巴有根胡子根部起了毛囊炎，很快恶化成带状孢疹，俗称上火。美国学年的下学期在5月份就结束了，毕业论文还没怎么写。找不到工作，博士后项目的申请季正忙着论文投稿，眼睁睁地看着滑过了两个项目的申请截至期；隔壁组老师转发的博后项目，在我发了申请材料之后不久，就在网上又发了一遍招聘广告；申请了两个德国研究所，一个已经发了拒信，另一个没回应……还要准备会议上的演讲，不上火才怪。\n\n周五组里演讲排练，本打算重用去年开会的幻灯片，发现论文稿中的主要内容居然都没有，才意识到过去的一年着实也还是做了不少事情。收到德国研究所的拒信消沉了一天，但是很快 ChatGPT 热潮兴起，于是把读博期间所有听说过的教授拉了一个名单，把他们的课题组主页介绍，和 AI 生成的我论文稿的摘要一起喂给 ChatGPT，让它写套词邮件。效果还行，收到一条回复，约我会议期间见面。回信的老哥用跨尺度方法研究动物行为，同时在欧洲和东亚经营两个课题组，去年会上很出风头。会后不久来我校作讲座，我们一起吃过一顿午饭。会前不久 APS 的邮件列表里有人群发邮件招人，是今年即将在西部某校开始教职的现任博后，目前正工作于给我拒信的德国研究所，尽管嫉妒，但也让他吃了一发 ChatGPT 邮件。\n\n### 开会\n\n步行去会场签到，领到了名牌，居然就是一张厚纸上挂了根绳，连个塑封都没有。\n\n签到后勘查了一下会场的布置。生物物理有关的会场都在主走廊第一条岔路的两侧，每个门口有展板，上书每个时段的演讲主题。不像去年只有我一个人参会，今年组里三个人都有演讲，再加上之前在我们组的硕士凯蒂和她现在的同学，把日程一标记，发现感兴趣的小节基本上都冲突了。我虽然社恐，但还是觉得人际关系比较重要，或者说因为社恐所以觉得人际关系比较重要？\n\n回到宾馆，收到了群发邮件哥的回复，要我确定三月会后一两周的时间，安排一次远程面试，介绍一下我现在的工作，以及说明我对他的实验室可以有何贡献。有点意外，因为他群发的邮件说了自己会来参加会议，我的邮件也说了自己愿意在会议期间见面，这个回信是兴趣缺缺的意思？略感失落。\n\n### 面试 1\n\n在不同的分会场之间乱窜的时候，去得晚会场坐满的话需要在后排站着。在其中一个场子站听的时候，一个穿绿色冲锋衣，背运动背包的老哥走了进来，听了一会就出去了。感觉有点面熟，和群发哥个人网站上的照片有点像。\n\n于是悄悄离场，看到他正在走廊里和朋友谈话，身前的名牌有名字那面翻过去了。暂时离开闲逛，发现主走廊里供应咖啡，排队接了一杯，回来再刺探，确定是他。\n\n打招呼，原来是 ChatGPT 太啰嗦了，邮件最后才说我也在三月会，他没看到。问了我的演讲在什么时候，他会来听，就不需要 zoom 会议了。\n\n我的演讲所在时段的题目十分古怪，感觉跟我做的东西关系不大。进去候场的时候发现，整个小节除了我们实验室的俩人，其余的演讲都是同一个方向，而且研究的都是同一模式生物的同一结构。我们组俩人的演讲在整个小节的最后，自我感觉表现不错，破题的时候拿小节的题目开了个玩笑，结束的时候时间正好用完。群发哥在我演讲前半小时左右到会场，我们结束之后就离开了，没有上来和我说话。\n\n结束后回到宾馆，收到了他的邮件，约我第二天下午见面。在会议网站搜索了一下他的日程，发现正是在他的演讲结束之后。看他的演讲题目题目，似乎是关于自己的最近一篇论文的，把文章喂给 AI 工具生成了一份摘要，没来得及看就被同学拉出去玩了……\n\n他的演讲在第二天下午，时间上处于整个时段的中间。我在时段开始的时候就坐进会场了，他比我晚来了一会，坐了一会又出去了，。会场比我演讲的时候大一倍，但是也没坐满。他在上面讲的时候，我在下面看昨天 AI 生成的文章总结，感觉信息量比截至当时听过的绝大多数演讲的内容丰富，演讲的水平也远在平均水平之上。研究对象比我现在的研究对象在生物系统的层次上高一个层级，但是感觉研究的方式和流程类似。研究的完成度高得多，理论和实验都有。虽然理论似乎是所在领域挺传统的一个模型，但是毕竟比我们只是摆实验数据好太多了。\n\n会后见面，我们在走廊旁边找了俩座位，我拿出了自己的幻灯片，他从头到尾把细节问了一遍，确认我会做我们组模式生物的基因编辑，又问了我在整个项目中的工作占比。\n\n然后就问了一个堪比谈恋爱时被表白一方“你为什么喜欢我”的天问：“你贯穿整个研究生涯的问题是什么？”啊这，大脑直接宕机。看我实在憋得不行了，老哥让我可以说中文的，原来他能听懂，但是不会说。最后实在逼急眼了，说了实话——我就是想在学界混吃等死，ChatGPT 都来了，强人工智能还会远嘛，物理学不存在了啦。老哥噗哧一声乐了。\n\n然后让我提问，我问假期有多少，答曰按学校政策办，养过细胞的应该知道周末可能是要去学校的，所以只要工作量够，周中不作出勤要求。\n\n感觉聊得比较顺利，最后说回头会发邮件给我，让我给他两三个联系方式，要推荐信。\n\n### 面试 2\n\n本来感觉反馈不错的大佬，感觉开会第一天可能大家都还没安顿下来，于是周二才再发邮件确认见面时间，这样一来就约到了周五中午，在 DBIO 的服务台旁边见面。\n\n本来打算事前准备的，他的课题组有三四个演讲，但是基本上都和我的演讲或者前一个面试冲突，最后只听了一个。\n\n结果周五中午就是整个会议的最后一节了，DBIO 的桌子已经撤走了，大家心猿意马归心似箭。12点过了十分钟左右见到了人，五分钟之后和他谈话的人离开。到处都在收拾关门，我们找了一个桌椅已经搬空的房间，屋里只有一个学生躺在地上睡觉，我们两人相对席地而坐。\n\n刚要掏电脑出来给他复述一下我的演讲，他摆了摆手，让我尽可能简短地口头概括自己的工作。后面的一系列问答都是这个风格，两个人在地上打坐，快问快答，跟禅宗的机锋一样。上来是为什么要做现在的工作，我自认为说的还行，但是说着说着发现这™不是上一场面试的答案嘛，早怎么没想到呢？然后得意忘形，忘了这位大佬不是做组织结构而是研究行为的，本来很容易圆过去的，没发挥好。然后是我本科时最喜欢的一门课是什么，这个问题上次吃午饭的时候他就说自己喜欢问，于是让我狠狠地装了一逼。再然后就是“臭做实验的怎么来我们理论组要饭来了”和“臭做结构的怎么来我们研究行为这儿要饭来了”两大问题，回答得不好。之前得意忘形，把自己手里另有 offer 的事说出去了，导致后半截我们双方又有点敷衍。\n\n最后和我交底，东亚的研究所有足够的经费，虽然他一年还是花不少时间去当地，但是并不总是能见面指导。欧洲方面如果决意入职的话，他需要专门申请经费。这个意思已经比较明确了，所以我们很客气地互相说可以在花时间考虑一下，日后可以邮件联系。\n\n### 座谈\n\n座谈会其实发生在我演讲所在当天中午，两次面试之前。\n\n所谓座谈，是德国几个研究机构联合组织的，在德国从事研究的相关信息的宣讲会。 ~~~~位置离生物物理的几个会场比较远，凯蒂朋友的演讲结束之后从会场溜出来，赶到的时候已经开始了。进门两侧有贝果面包、果酱和乳酪，这么多天第一次吃午饭。\n\n会场有六七个圆桌，每个桌上放了一个写有研究机构名字的小标签，桌边坐一两个对应研究所的工作人员。主持人依次介绍了每个桌的研究机构，然后给机构的负责人三五分钟的时间介绍自己。之后就是自由时间，我看马普所的桌子就在面包附近，其他机构也不怎么做基础科学的研究，就找了个椅子坐下了。马普所的负责人是一个满头白发的长者，着装在与会者中偏正式，气场很足，神似觉爷。\n\n第一个问题关于移民德国的难度，以及德国是不是有点排外。长者答曰德国现在是移民政策最为开放的国家之一，考虑到“之一”，再考虑到灯塔国的外国人毕业在非学术岗位连工作签证都要抽签才能拿到，不算边境“走线”的话，这个回答确也不能算错。德国之声之前也出过一个视频，也有同样的论断，但是那个视频后面还有半截 “aber…”。\n\n随后有人问马普所的项目和岗位结构。回答的结果和之前了解的差不多。每个研究所有自己的招生权，一期博士后的时间一般是两年，只在必要时延长至三年或更长。新知识是马普所的研究职位除所长之外几乎没有终身职务，研究所就是研究者找终身教职之前的副本村。但是不知是政府还是啥，有条规则说拿到博士学位的九年后雇佣单位必须提供终身职，结果就是九年之期以前就会被清退。此条是否与前一个回答相矛盾，没问。\n\n被问到马普所更青睐于何种研究时，长者明确说是更困难更有野心的题目，而非为了拿到教职而做的安全题目，甚至很明确地说，就是要发掘那些将来有可能拿诺奖的题目和学者。这一点自然是不同于美国式的口头上的自由放任和实际操作中的专打安全球，有趣是也和国内的看法不同。当年 CLS 面试的时候，我也不知天高地厚地说自己有鸿鹄之志，台下老师们答曰“不要那么功利嘛”，没想到两个视计划与顶层设计为制度优势的文化，对于功利的理解竟有如此大的不同。\n\n还有人问马普所选择申请人的标准。回答是每个研究所有自己的标准。但是他也谈到了自己的标准：学习成绩为主，*做研究的时候应该很清楚自己在做的东西底层的物理是什么。*那么如何判断学习成绩呢？主要是来自名校，然后是成绩排名，如果是没太听说过名字的学校，成绩排名的要求也就更高。回答很真诚，让人对如此明显的第一学历歧视也反感不起来，甚至没有反驳的意愿。\n\n这个回答显然是针对美国模式，选拔以科研经历为主，在论文作者栏占位更重要。研究组的骨干是不需要花时间上课的博士生，申请博士的本科生，能对整个项目有多少贡献呢？而且这些贡献基本上都是献祭对课业努力得来的，上方标注的句子就是对此的吐槽。更何况考虑到国内学术环境的昭著臭名，基本上都需要海外的研究经历，除了珠峰计划这类特殊项目提供公派名额，基本都是自费联系国外导师，不仅把学术选拔变成了与学术无关的信息差，和学生经济条件的选拔，还豢养了一个倒卖此类信息的中介产业，此种政策的学术正义性何在？\n\n但是再回来看呢，成绩单能反映出多少成绩？想出国的学生，有多少明目张胆地跟上课老师要成绩？某校直到几年前还有“及格重修”这种合法的更改成绩单的操作，配合上国内各科考试历年题目的高度相似性，不利于安定团结的话就不说了。既然要求名校，那么高中出国又比本科毕业出国优势不止一点半点，又是阶级筛选，殊途同归。\n\n两者一邱之貉，都是在不同的大义名分之下，落实为可执行的操作时，原有的大义不断被解构和歪曲，过程中不断把自己的判断力外包。外包无所谓，毕竟分工既是社会发展的表现，又是重要的动力。然而，拿飞机举例，把乘客安全送到目的地需要机组和地勤配合和信任，但是安全送达毕竟是有客观标准的。而教育和研究系统，其培养成果本身就由自己消化，选拔过程天然构成运动员兼任裁判员的现象，我选出来的人有不行的，没被选中的也有行的，那好办，把资源全圈给胜选者，再把落选者的路掐断就好了嘛……\n\n两种模式菜鸡互啄，谁也取代不了谁，归根到底，还是今天的物理学自己乏善可陈。量子力学和相对论肇起之时的摧枯拉朽不提，就连标准模型构建过程中的萧规曹随，今天也难望其项背。扎实理解知识，你的实际研究中能用到多少？早早上手研究，这么多年有多少有价值的工作自己心里没数？年轻人觉得攸关前途命运的大事，不过是老板平凡一天中收件箱里的一段字节罢了，录不录你，录你还是录他，区别不大。\n\n一言以蔽之，时无英雄，遂使竖子成名。\n\n下午，前一天和群发哥聊天的一个女士在他之后不久演讲，看幻灯片首页的工作单位，似乎是他博士实验室的后辈，今天即将入职他现在的研究所，~~也就是说，这位正是抢走了我 offer 的仇雠~~。于是在朋友圈发了一条吐槽。她的演讲超时被主持人叫停了，刚想追加一条评论“超时了，真菜”，想到最近几天朋友圈发的有点多，忍住了。\n\n大学四年我唯一佩服过的人峰神在下面回复，说他本来也想申请同一个研究所。我问他现在去哪，过了几分钟看到回复“上班了”，赶紧揶揄说“富哥V我50”，但是座谈会上的话在此刻反刍，叹息收敛成深呼吸，默默收起了手机。\n"},{"slug":"say-her-name-mahsa-amini","filename":"2022-10-06-say-her-name-mahsa-amini.md","date":"2022-10-06","title":".doc | 说出她名字：Mahsa Amini","layout":"post","keywords":["doc"],"excerpt":"A nation only deserves as much as its people have courage for.","content":"\n> A nation only deserves as much as its people have courage for.\n> \n\n物理系每周三有一个例行的讲座，讲座之前会找一些学生和演讲者一起吃午饭，公款报销。本周轮到我们的研究方向，于是我们几个报名吃饭。中午隔壁组的同学来和我们碰头，学姐摘下耳机来，说抱歉自己走神了没听见敲门，在自己国家正在革命关头，实在是很难静下心来。\n\n几天前，一位伊朗的库尔德族年轻女子 Mahsa Amini 走在街头，因为头巾佩戴“不规范”，被道德警察带走，随后死于警察局。以此为导火索，抗争运动骤起。相关消息雪片般传到 Twitter，当时和她同行的两位女士用身体堵在将 Animi 带走的警车前阻止警车离开，被警车推行数米仍不放弃；有位男士帮其他示威者挡子弹，衬衫脱下，背上一片霰弹枪打出的血红的浅浅弹坑；有一名警察独自持械在街上巡逻，被周围涌上来的路人围攻；夜里，地上一垛篝火，用女士点燃的头巾组成，一名年轻女孩解下头巾手握住一端，头巾在转圈的舞步中飘扬在空中，落入火中溅起一片掌声；成群的示威者攀爬一座建筑，撕下了挂在建筑外墙上的政治人物画像……\n\n周四，我在办公室摸鱼刷推特，学姐进来看到了我的屏幕，让我赶紧往上翻，对对，就是这个，快转发，谢谢了。于是我就转发了，但那条推特是 BBC 中文网对这件事的一个追踪报道，配的文案是“伊朗总统同意调查阿米尼之死”，转发了之后显得我很像是“你看青天大老爷这不是开恩显灵了嘛”的小粉红，不过解释起来实在是过于复杂，于是就没说啥。\n\n问学姐伊朗国内的情况，她说之前已经有过多次抗争了，希望这次不一样。现在伊朗国内已经断网，很多消息传不出来，听说政府已经开始使用致命武器，至少有几十个人牺牲。其实三十多年前，学姐的母亲还年轻的时候，就因为类似的原因被道德警察拘捕，受了鞭刑，和她一起被捕的人里面甚至还有孕妇；她的一个叔叔因为曾经在君主制时期伊朗的军队中服役，被新政府处决，前两年伊斯兰共和国政府甚至捣毁了被处决者墓园的墓碑，就为了阻止人们纪念他们……海外的伊朗人决定在周末集会示威，希望我有时间的话也能参加，还短信发给了我活动的海报。\n\n我给海报配文“学姐的社会实践活动”，发到微信朋友圈，没有被微信删掉。今年新到美国的一个学弟看到了，来问我情况，还问我能不能来我办公室问学姐一些问题。学弟的朋友圈里经常转一些妇女劳工等等弱势群体权益方面的公众号文章，偶尔原创一些痛斥新自由主义的全球化架空了工会剥夺了工人机会的进步主义小作文。虽然我不是左派，但是当下的中国，能站在 political apathy 的对立面，至少能算是个短途的同路人吧。\n\n周五中午物理系自助烧烤的时候，我们年级好多人都收到并且接受了集会的邀请。学姐还说找了当地的 FOX 记者报道此事，于是大家一起开共和党及其中下层选民的玩笑，像什么“我看了一眼 Tucker Carlson 的节目，就一眼哈，说的也不是完全没道理嘛”、“我现在不那么怀疑地平说了，你看我们脚底下这块地不就挺平的嘛”……学弟也来吃烧烤了，本来想把他拉过来直接介绍给学姐，但毕竟我很社恐，看他在和自己的同级同学社交，一直没有机会。\n\n下午学弟发微信来，我去他办公室把他领过来，介绍给学姐，学姐很高兴有更多人关注这件事。学弟的问题主要是这个活动有什么女性主义的组织在策划，有什么女性主义的诉求。学姐说没有，大家主要是靠想法而不是靠组织在一起的，都觉得这个政权该完蛋了。学姐问他中国的情况，学弟说他只是反对清零政策。学弟问我能不能让他搭车，我说我也不打算开车，毕竟虽然是和平示威，但仍有出人意料发展的可能性。然后学弟离开我们办公室又折回来问，现场会不会有伊朗政府的特工。学姐说每个人的想法都不一样，可能也有支持伊朗政府的伊朗人，但他们应该不会来这种活动。\n\n集会在市区一个公园的东南角，是围绕公园四条路中最繁华的路口。因为之前提到的顾虑，我把 UBER 终点定到了公园中心，结果到了发现公园比想象中大很多，走到集会地还要接近 20 分钟。下车的地方正在赶集，具象化的“人类的悲欢并不相通”。走着走者隐约听到汽车的鸣笛声和人声，才确定自己没走错方向。\n\n![]({{ site.baseurl }}/assets/photos/2022-10-06-say-her-name-wide.jpg)\n\n不断说着“借过”在人群中穿行，找到了学姐，身边是好几位同级的同学。安鲁和女朋友也在，手里举着一个大标语板，背后写的是“拜登，别为了核协议出卖伊朗的百姓”。\n\n迟到有一个好处，就是人群已经成型，你需要做的就是融入人群，滴水入海，心理上的门槛和负担要小很多。饶是如此，刚开始的时候也不敢大声喊口号，之前从学姐那里拿的海报也不好意思举高。后来发现正常说话的声音会完全淹没在人群中，再发现全力喊的声音依然会淹没在人群中，于是渐渐放松下来。\n\n![]({{ site.baseurl }}/assets/photos/2022-10-06-say-her-name-narrow.jpg)\n\n“Women, life, freedom!”\n\n“Say her name! Mahsa Amini!”\n\n“Your silence, their violence!”\n\n“Down with the dictators!”\n\n“No to Islamic Republic!”\n\n“Iranians, make your choice! USA, be their voice!”\n\n人群里有几个喇叭和音箱，有人领头，其他人附和。短的口号领头者念一遍大家重复一遍，长的口号领头人说上句大家说下句。喊过几句英语口号，就用波斯语重复一遍。我一边跟着喊口号，一边替最后一句话捏一把汗，复习在中国，社会活动者需要付出怎样的努力与境外势力切割，即便如此仍不能幸免于诉诸动机谬误。\n\n人群原本占据公园一角的部分草坪和人行道，后来几个活跃分子提了一个音箱到右转和直行车道之间的安全岛上，面对大家带头喊口号。经过的汽车很多鸣笛响应，打开车窗对我们竖大拇指或者比 V 字。活动的最高潮，有几位伊朗女孩在安全岛上，用剪刀剪掉了自己的长发。街对面商铺的玻璃墙上，人群的映像蔚然。\n\n午后，活动在大家齐唱一首伊朗歌曲后解散。临走之时，一对老夫妇看到我胸前捧着的黑白宣传画，很喜欢，于是送给了他们。学姐和她丈夫开车来，把我送了回去，我们在我住处附近的奶茶店喝了奶茶。\n\n在游行现场我没有看到学弟，但他晚上在朋友圈发了三个单词，是波斯语中 women, life, freedom 的拉丁字母转写。\n"},{"slug":"how-to-narrate","filename":"2022-10-03-how-to-narrate.md","date":"2022-10-03","title":"转载 | 《叙述》","layout":"post","keywords":["doc","html"],"excerpt":"近日在喷嚏网发现了一个讲如何写记叙文的系列","content":"\n> 近日在喷嚏网发现了一个讲如何写记叙文的系列，但是给出的链接已经过期，通过搜索引擎找到了豆瓣用户[username太长了](https://www.douban.com/people/usernametoolong/)的转载。([https://www.douban.com/note/509996701](https://www.douban.com/note/509996701))\n>\n> 转载日期在 2015 年，豆瓣的发帖者称作者是 xilei, 给出的原文链接也来自喷嚏网，也已过期。\n\n<hr class=\"slender\">\n\n## 【叙述-1】厕所的故事\n\n> xilei 发布于 2009-3-1 14:36:00\n\n### （一）\n\n小时候，看电影的时候，我一直有一个疑问：为什么电影里的人从来不上厕所？\n\n那时，我还是个8、9岁的小男孩。学校里还经常包场看电影。小孩子好动，看电影前总是乱跑。电影放到一半了，才想起好像应该去上厕所。\n\n那时，好看的电影很多：《红孩子》、《地道战》、《平原游击队》、《闪闪的红星》还有《黑三角》。尿憋久了，忍不住就往电影院后面的厕所里跑。每次都是摸黑横穿过排椅，猫腰跑到最后，掀起左边的布帘，杀将进去。\n\n有时，晚上也做梦，有人追。自己在前面跑啊，跑啊。怎么也找不到厕所。\n\n白天的时候，回想起来。才觉得自己发现了一个天大的秘密：\n\n自己从来没有在电影里看见有人上厕所。就是写有男、女的那种。\n\n这念头只是一闪而过，觉得自己思想觉悟不高，有点低俗了。电影里都是革命英雄人物。他们每天都在忙正事。哪好意思象小屁孩那样，一天到晚没事，就想上厕所。\n\n我想，电影里不谈厕所的事情，才是正常的事情。厕所都是无关紧要的事情，不好意思谈。\n\n后来，看电影就习惯了。再也没想过那个问题：\n\n为什么电影里的人从来不上厕所？\n\n### （二）\n\n长大后，看《真实的谎言》。突然发现，电影里的人居然还是可以上厕所的。\n\n电影里有这样一个情节：\n\n有人要杀施瓦辛格，老施从容地走进厕所里，对着洗手间的镜子，从容地洗手。他预先把一个伪装成肥皂盒一样的袖珍摄影机对着门口。门外和他背后的人都干些什么，在他的特工眼镜里，一清二楚。\n\n那个追踪过来的杀手，走到老施的身后，掏出枪来，指着老施的后脑勺，正好扣动扳机。说时迟，那时快，老施抢在子弹出来的前面，头一低。然后，反手给了杀手一家伙，把他就给解决了。\n\n后来，又有人追杀过来。老施在厕所的隔间里，躲来躲去。杀手的子弹象水枪一样，一排排一阵阵扫过去。厕所里精彩的枪战定格在这样一个画面中：一位正在上厕所的老者，战战兢兢地打开隔间门。裤子还在脚下，他吓坏了。不知道发生了什么。\n\n我这个乐啊：这老施太帅了。导演也太可爱了。可算看见电影里的人上厕所了。\n\n这是我印象比较深的一次电影记忆。好比如说之前，你发现一些东西怎么从来没人碰过，你会以为：肯定那里面有什么禁忌和秘密。\n\n结果，有一天，你发现：怎么就不能碰呢。看吧，就算是厕所，人家也可以用的那么好。\n\n再一想，也很简单：既然在生活中就存在，为何就不能在电影中存在呢？\n\n### （三）\n\n后来，电影看多了。才发现电影中的厕所，其实，跟生活中的厕所的用途不大一样。\n\n生活中的厕所，就是生理意义上的用途。而电影，则是一种转折的秘密结构，或者是一种意外迭出的神秘角落。\n\n在《疯狂的石头》中，那个假装断腿打上石膏骗自己父亲的儿子，在厕所里得意洋洋地打电话。他不知道外面正站着七窍生烟的老爸。这时的厕所，是一个很容易泄密的地方；\n\n在《三峡好人》中，赵涛就是在洗手间墙上的海报上，了解到了情敌的秘密；\n\n在《非诚勿扰》中，葛优用手抹去脸上的水，对着镜子，心里说：豁出去了。他走出洗手间，跟舒淇讲他过去的故事。\n\n在导演们看来，厕所是这样的一种地方：\n\n一个人面对自己，短暂休息的机会；\n\n一个意外事件发生的秘密场所；\n\n一个用来泄密，发生转折的时间和空间。\n\n所以，重要的，是不是电影中的人要不要上厕所。而是，电影的故事需不需要他们上厕所。\n\n如果软弱的人，需要面对自己，给自己打气的话，他们就上厕所；\n\n如果有些事情不好交代，或者需要一个承上启下的引子的时候，他们就上厕所；\n\n如果需要枪战的时候，有两个比较好的选择，一个是楼顶，另一个就是厕所。\n\n### （四）\n\n有一次，儿子给我说：老师说，有些东西好写，比如说，一件最难忘的事情，或记一件好人好事，或者是某年的春天什么的，就好写。再比如说，让你写厕所，你怎么写呢？\n\n估计大多数人都会写成：在厕所里发生的一件好人好事。某个同学生病了。其它的同学学习雷锋，自告奋勇，发扬互助精神，帮他完成任务。最后，得到了老师的表扬。\n\n我说：“其实，写什么都可以。没有什么禁忌。关键在于你怎么写。你要明白你为何要写它。”\n\n我就跟他讲了关于厕所的一些想法。“有时，事件发生的地点，是有特别的意义的。或者因为真实，或者因为叙述的逻辑需要。当你觉得一个东西，不便于直接书写的时候，你可以把它放在一连串的事件中来看。或许它什么都不是，只是一个架子，只是一个纽带或者转折。讲什么很重要，但如何讲也是非常重要的。你得抓住一些特别的东西，把它直接写下来就成。”\n\n<hr class=\"slender\">\n\n## 【叙述-2】假如苏东坡和陶渊明来到现代\n\n> xilei 发布于 2009-3-8 15:03:00\n\n> \n\n### （一）\n\n本周末，儿子的家庭作业要写一篇作文。题目是：《假如苏东坡和陶渊明来到现代》。\n\n我喜欢这样的题目：有挑战，也很有想象的空间。\n\n早上起来的时候，我看见儿子已经在开始动笔了。我很想知道，他会写些什么呢。但是，我拿定主意，在他写完成之前，不要按奈不住自己，提前给他什么想法。\n\n反过来，我给自己出了一个题：如果这是我的作业，我会怎么写呢？\n\n### （二）\n\n首先，做一些随意的，但是适当的假设和推理：\n\n苏东坡和陶渊明都是古代的人了。如果他们来到现代，肯定有多东西都没见过。\n\n苏东坡会问陶渊明：家乐福是干什么的啊？什么东西叫法国啊？\n\n陶渊明说：咱没见识过。走，去看看先。\n\n.....\n\n他们也没看过电影。放电影前，看见周围的人手里都拿个小盒子，凑在耳边说话。\n\n电影放一半了，进入到卧室部分，苏轼说：世风日下啊，世风日下啊.....\n\n.....\n\n换了一部《后天》，陶渊明说：现代的人越来越不象话了，你看他们把气候搞成啥样了。能跟我悠然见南山的时候比吗？\n\n.....\n\n信马由缰后，罗列出一些素材，最简单的办法就是：想想这两个人会是什么性格，他们在现代的生活中，会有哪些不适应，会有哪些冲突，或者可以接受的地方。\n\n接下来，就是把这些松散的东西，组合在一起。\n\n换句话说，想归想。最终，你得把这些东西用一种形式串起来。给大家讲一个有点意思的故事。\n\n讲故事，就是寻找一种叙述的结构：\n\n你得有一种符合逻辑的讲述方式，把你认为重要的那点东西讲出来，让人们感觉是真的一样。\n\n接下来，怎么做呢？\n\n\n### （三）\n\n我打算借鉴或者说是山寨一下《非诚勿扰》的结构。\n\n让我们换一种角度来看这部电影。如果我们现在是故事的讲述者，我们很容易发现故事的叙述逻辑。\n\n简单的说，《非诚勿扰》分为三个部分：\n\n第一部分【和谐终端机】是个引子。这部分主要的作用是解释秦奋相亲的缘由。就跟后面故事要安排笑笑为第三者一样，都是为了一个目的：叙述的合理性。\n\n故事的讲述，首先要设置一些合理的背景，让人容易接受这样的假设，从而对故事的延续造成驱动的悬念。\n\n故事的前提，如果设置的很好。读者的好奇心，就会自然而然地引发。而对于故事的叙述者来说，故事的主角在合理的背景中可以自己活动、讲话，展开故事。\n\n第二部分【相亲】是一种相亲大集合。各种相亲的场合堆叠在一起，有一种现实的对应感，不乏幽默的细节。\n\n在这样的部分中，细节和重复，是叙述的基本要素。\n\n细节可以跟人留下真实、幽默等等愉悦的情感。而重复可以象多棱镜一样，折射出同一件事情的不同的侧面。\n\n有时，重复也是一种衬托。为主线的叙述铺路。\n\n冯小刚曾经说：《非诚勿扰》的第三部分【北海道】才是电影中最重要的部分。这部分流露出某种公路电影的气质，自然主义的写实的叙述，贯穿其中。\n\n所以说，讲好一个故事，是不简单的事情。\n\n你得有足够的细节，有简练而充分的交待和暗示。在叙述的过程中，有各种各样合理的花絮铺垫、转承。\n\n不见得都是刻意为之，但是，为了避免叙述的平淡，你都找到很多方法，让叙述的吸引力一直牵着人走。\n\n### （四）\n\n我们暂时不用考虑过于复杂的处理。不过，我们仍然可以借鉴到一些可用的东西。\n\n让我这样来考虑《假如苏东坡和陶渊明来到现代》如何使用类似的结构：\n\n我先要安排一个理由，说明苏东坡和陶渊明来到现代：他们怎么来的，来干什么。然后，自然牵连出后面的故事。\n\n然后，就用重复的方法，写他们在不同的地方的不同经历：他们在家乐福怎么样；他们看电影怎么样，看见手机会怎么反应.....\n\n最后，该如何收场呢：给他们一个选择，他们是会选择留在现代，还是古代呢？\n\n我把整个这个构思的过程这样梳理一次：\n\n1. 我们都某处获取了一个想法，或者一些素材，我们感觉有一个可写的主题，或者我们认为讲述本身能带来很多东西，我们有叙述的冲动，但是，可能不知道叙述会带我们到什么地方；\n2. 寻找一种合理的结构，把之前的素材，串联起来。\n\n你要判断的是：是否来龙去脉讲清楚了。人家是否能接受这样叙述的逻辑，你所想要表达的情感强度，是否被合理地从线性的叙述中被释放出来。\n\n什么地方不够充分，什么细节又该舍弃。\n\n有时，故事中的人会带你到你想去的地方，甚至会超过你最初的想象。\n\n\n### （五）\n\n到此为止，我并没有真正开始写这篇文章，我只是在说一种思路：怎么用一种简单的方法，把一些松散的素材连接在一起。\n\n到中午的时候，儿子的作文写完了。我问他是怎么写的。\n\n儿子说：“我是分开写的。先写的是苏东坡。”\n\n“苏东坡去参加高考，一看试卷，他就乐坏了。难题都是文言文，这不都是送分嘛。还有几道题，考的就是他自己的文章。”\n\n我说：“这很有趣。后来呢？”\n\n儿子说：“不过，苏东坡很惨。他没考上大学。他语文考满分，但是数理化，都不会。只是偏才。他跟教育部写信申述，没用。我想，苏东坡在现代社会肯定呆不下去。大学生毕业都找不到工作，还去卖猪肉。苏东坡肯定不愿意卖猪肉。”\n\n我都听乐了：“好玩。说说陶渊明。”\n\n儿子说：“陶渊明简单。他去超市买牛奶，去哪儿都抱怨：你们这是怎么搞的？又是三聚氰胺，又是特仑苏的......”\n\n我说：“想法都挺好的。把你的作文拿来，我看看。”\n\n看了一下，我跟儿子说：“你的想法，真的很棒。”\n\n“写作文，能这样，已经不错了。不过，如果有时间的话，还可以写的更充分一点。最好的叙述是，把一些个想法，还原成一个故事。你去寻找一些简单可用的结构，把这些素材重新组织一下。”\n\n儿子说：“什么是结构？”\n\n我说：“你可以把它简单理解为一种容器。一种有逻辑、有形状的东西。很多人只所以有很多想法写不出来，是因为没有注意或者说是不知道一些基本的容器结构。这些结构有时会帮你把一些零碎的东西安排好，帮你梳理出其中的联系。”\n\n早在09年到来之前，我就答应儿子，给他讲一些简单的写文字的方法。你不需要把自己变成作家，但是，你也不要认为写字有多么高深莫测。\n\n我想把这些文字都放在一个栏目下，名字就叫做《叙述》。\n\n我希望能讲出一些真正简单、实用的东西。我会讲：为什么大多数人都喜欢听故事，故事是如何写出来的；为何《读者文摘》总是从讲故事开始；discovery的叙述有什么特点；什么是马尔克斯的叙述；以及如何从看一部电影，或是听一部交响乐，一个奇怪的建筑中，获取结构的启示。\n\n当然，我还是想告诉他：最重要的是忠实于自己的直觉，不要被流传已久的谬误所禁锢。很多东西，都是时间积累下来的。素材，或者情感，甚至所谓的技巧。保持对外部世界的敏感，保持自己独立的思考，比是否会写字更为重要。\n\n我想告诉他：只有一个人有需要表达的动力，加之适当的合理的技巧，他就能感觉到叙述的快乐。各种各样的叙述方式，也会被合理的创造并使用起来。\n\n\n<hr class=\"slender\">\n\n## 【叙述-3】为何我们需要从故事开始 \n\n> xilei 发布于 2009-3-22 20:57:00 \n\n### （一） \n\n我从不给儿子买任何版本的作文精选，尤其是那种高考或者中考的满分作文选。我今天还在网上看见这么一篇博文，里面贴了几篇近几年的全国高考的满分作文。\n\n我摘一些文字如下：\n\n【摘选1】\n\n> 他想起了周瑜。“小乔初嫁了，雄姿英发，羽扇纶巾，谈笑间樯橹灰飞烟灭。”他问自己难道自己不正是那东吴的督都吗？自己满腹经纶，胸中有的是治国平天下的笔墨，而此时？面对这一片漫漫江水，他陷入沉思。 \n> \n> 他的思绪像长了翅膀似的，继续飞扬，斟一杯酒，临江而酾，是祭奠那死去的英雄，也是祭奠自己的往昔。是啊！他清醒了：哀吾生之须臾倒不如托遗响于悲风，取山间之色，听江上清风之歌唱。他不再悲观，不再耿耿于怀。 \n> \n> 后来，他用自己的行动证实自己的顿悟。他在黄州兴修水利，奖励耕织，清廉从政。黄州的百姓感念这一位父母官。后来修了一祠庙来缅怀这一伟大的文人，知心的父母官。文学的殿堂里永远可以听见那《赤壁赋》华美的乐章。\n\n【摘选2】\n\n> 古人说：“上有天堂，下有苏杭。”美丽的西湖承载了多少中国文人的梦，苏轼虽被贬至此，然而他没有悲怆，没有哭天地，没有愤愤不平，风雨任平生。他懂得了“为官一任，造福一方”的简单道理。于是，一道苏堤便横卧西湖。他要让西湖储藏的心灵，淹没他所有的痛苦，所有的忧伤。 \n> \n> 《明月几时有》一词道尽了诗人在外想家想人的心境。“不知天上宫阙，今夕是何年……”然而他也没有因此悲伤叹息，对生活失去勇气，失去信心。他让天上的明月传达自己对远在千里之外的故人、家人的思念。一句“但愿人长久，千里共婵娟”不仅让他的风雨一生得到升华，而且抚慰了多少中国人思乡思人的心灵。这个时候，他把其豁达的心交给了饱怀思念之情的人们。他要告诉他们――生活的风雨摧不倒我们，我们同在。 \n\n\n【摘选3】\n\n> 生命如风。  \n> \n> 好一个亘古的比喻。你也许感慨于它的来也匆匆，去也匆匆，不着一丝痕迹。我却跋山涉水，在时空里淘尽沙砾，找到了这个比喻的真谛：  \n> \n> 唯有风，可以穿越荆棘。  \n> \n> 狄金森把人生描绘成篱笆墙的内外，我们一层又一层地爬过，事实上，这层层篱笆缀满荆棘，我们通过时，往往遍体鳞伤，身心俱毁。这时，你看到，风在墙外千萦百折，不屈地呼啸而过，空气中凝结下壮观的痕迹。  \n> \n> 我们趋行在人生这个亘古的旅途，在坎坷中奔跑，在挫折里涅盘，忧愁缠满全身，痛苦飘洒一地。我们累，却无从止歇；我们苦，却无法回避。烈日暴雨来过，飞沙走石来过，我们布满伤痕，还要面对一片片荆棘的丛林。  \n\n<hr class=\"slender\">\n\n我不知道是不是真的。如果这样的作文，能代表中学作文的高水平的话, 我只能说：这种小老头似的文风要不得。\n\n貌似文采飞扬，不过是拾人牙慧，东拼西凑。所有的词语都是奇形怪状地堆砌在一起。内心空洞，毫无生气。\n\n看着累不说，而且看过后给你留下了什么呢？空空荡荡，什么也没有留下。\n\n不过，我敢说，很多语文老师，都喜欢这种。而且也希望学生们写成这种东西。\n\n你打眼一看，觉得好有才气，其实不然。\n\n文字的东西，才气不是这样表现的。而且，才气在文字里面根本就什么也不是。\n\n如果你的文字根本就没有什么东西，什么样的才气都是空气。\n\n### （二） \n\n我觉得现在的学校里面根本教不好孩子写字。\n\n作文是从小学就开始了。小学生写记叙文，中学生写散文，或议论文。\n\n这样的安排还给人一种错觉：散文、议论文比记叙文更高级。你看每年的高考，好像都是写议论文的。没有说写记叙文的。\n\n但是，事实上：很多学生都不能完整地表达一件事情，完整地记录下一个属于自己的想法。\n\n写记叙文，记一次春游，记一件难忘的事情，还是记一次雷锋活动。能不能记点别的？\n\n写散文，老师就说：“散文就是形散而神不散”。\n\n什么都是散的，最后，就只有散架。\n\n老师说：你们要多背好字好句。写作文都会用上了。\n\n所以，我们都看见了满分作文都是这么干的：词藻华丽无比，思想都是来自于课本。所有的口水都是用经典名言粘上的。最后，都成了应试的八股文。\n\n这不是写字，这是报纸剪贴。\n\n\n### （三）\n\n其实，对于学生来说，他们写作文真正困惑的是这样两件事情：\n\n1. 不知道什么东西是应该写的；\n2. 想写东西，但是不知道如何写。\n\n老师们给出的建议是：你要多读多看多背多写啊。这些话说了等于没说一样！\n\n干什么事情，不需要勤奋啊。\n\n其实，我们生活的世界如此丰富，很多时候，我们并没有真正用心去看，去发现。\n\n有一次，儿子问我：“你怎么知道什么该写，什么不该写呢？” \n\n我说：“你得明白人们为何要写。绝大多数人写东西的动机，其实，很简单。”\n\n“比如说，你要矫正牙齿，我就得给老师写假条。我就得写明合理的原因。因为这时你是在解释，说明理由。你就必须简单明了。”\n\n“我们在公司里面，也经常写东西。比如说，你去给客户讲解一个产品。你不能总是说：我们的东西好啊，赶快来买啊。这样做没人会理你。你得跟人家讲一个关于产品的故事。你们为什么要做这样一件产品，人们为何需要它，你们是如何做到的。人们为什么要相信你们。这种叙述的逻辑，是理所应当的，就是要和人家建立信任。”\n\n“当然，很多人写文字，是为了自己。为自己留下一些记忆。因为每个人的一生中，都有很多这样的时刻。要么让人触动，要么让人反省。很多人想写下来，就是为了留住并传递那种难忘的感情。”\n\n“你知道为什么人们喜欢唱歌吗？唱歌是一种宣泄，歌词和音乐，能把人内心的记忆、想象和憧憬，激发出来。它能帮助人释放能量，发现自我。文字也能做到这一点。”\n\n“从来没有人规定，什么东西不可以写。但是，对于写的人一定要知道自己想写什么，这很重要。如果认为华丽的文字就是好的文字，这从根本上就错了。文字展示的不是关于词语的记忆，而是展示人的行为、情感，乃至心灵。”\n\n“对学生来说，文字首先是一种沟通工具。写得结构简单，逻辑清晰，简单明了。是最起码的要求。”\n\n### （四）\n\n我一直认为，学校里的作文课，应该教学生写故事。\n\n先不要把故事想的很复杂，可以是很简单的那种，不是复杂到小说家写的那种。\n\n我说应该这样做的五个理由：\n\n1. 故事可以培养人的观察能力；\n2. 故事可以训练人的逻辑结构的能力；\n3. 故事可以让人习惯把握自己的思维和情感；\n4. 故事不仅仅是关于文字的，也可以是图像的，音乐的。我们生活的世界中，有很多现成的例子，可以让我们自我习得。\n5. 故事不光是属于文学家，不光是属于语文课。而是属于我们所有人，所有的事业和工作。\n\n### （五）\n\n要了解故事，首先要学习感受：什么样的故事是好故事。\n\n这不需要任何人教。好的故事是有影响力的。它能让你笑，让你痛哭，让你沉思。不需要任何专家告诉你里面含有何种高深的理论。你的直觉和情感能告诉你一切。\n\n让我们来看看好故事的能量。\n\n春晚的小品《不差钱》是好故事。好故事能让人发笑，让人快乐；\n\n加菲猫说：球状就是身材。这是语录，也是故事，也是广告。能对自我宽恕和幽默的故事，是好故事。哪怕这故事，只有一句。但是，它能引发一大堆人会心的微笑；\n\n关于人性，巴菲特就爱跟投资的人经常讲一个故事：\n\n有一个搞投资的人死了，去见上帝，要求上帝，安排他到天堂里去过。\n\n上帝说：“天堂里都是你们这些搞投资的，都满了，只有地狱里还有空。”\n\n那个人说：“那麻烦你跟他们说一句：地狱里有石油。”\n\n过了一阵，天堂里的人都开始往地狱里跑。\n\n上帝对那个人说：“你可以搬到天堂了。他们都下地狱了。”\n\n那个人说：“不行，我也得去地狱看看，万一是真的呢。”\n\n好的故事好像什么也没说，但是，该说的它都说了。\n\n昨天晚上，我和儿子一起看了一个视频短片《世界构建》。这个短片讲述了这样的一个故事：\n\n只剩下1个小时了。\n\n一个男人，一跃而起。你看他在用手比划着什么。\n\n你看见他3D建模一样复制楼房。雕刻窗户，建造银行、路灯和一切。他在建造梦想中的美丽的世界。那个世界里有古老的街道，美丽的花朵，还有温暖的阳光。\n\n当他快建立好的时候，他把时间调到阳光明媚的时候。他跑进街道旁的一扇木门里躲了起来。\n\n这时，风吹着旗子开始动起来。远处传来钟声。\n\n一位美丽的女人打着赤脚，从街道的另一扇门出来，她惊喜地看着这一切。她突然转身向男人的方向走来。\n\n男人看见屋顶有一块还没有上色，脸上掠过一丝焦虑。\n\n女人走到盛开的花朵的面前，开心地笑了。在门后的男人，也释然了。\n\n女人回望着街道上的一切，念念不舍的转过街道。离去。\n\n男人从门后走出来。他听见风的声音，他听见破裂的声音，他的世界，被风吹走了。\n\n男人伸手从空中攫取一张照片，照片上是那个美丽的女人，男人送上一个吻。他的脸上还有泪水。\n\n画面变黑了。\n\n男人推开病房的门。\n\n他俯身亲吻没有知觉的妻子。\n\n桌上放着一个水杯，杯里插着那朵梦境中的花朵。\n\n我跟儿子都被这个故事所深深感动、震撼。美妙的感受，无法言语。\n\n我跟儿子说：“这就是我心目中的好故事。有些故事，可以带给你生理上的愉悦。但是，有些故事能真正激发你内心崇高的情感。”\n\n儿子说：“故事好像很简单，但是，好像又很多。”\n\n我说：“这就是故事的魅力。”\n\n儿子说：“为什么会这样呢？”\n\n我说：“这本来是一个很老套的故事。但是这样的讲述，出乎人的意料。故事的结尾，才揭示出男人建造世界的秘密。让你看了，才觉得：这是个多么美好、温暖的世界。”\n\n### （六）\n\n儿子说：“我可写不出这种故事。”\n\n我说：“这里面有很高的技巧了。我们一时都达不到。但是不妨碍我们从这些故事里面学到一些有用的东西。”\n\n“叙述是一种认知的流动。人的大脑很奇怪。你看，故事都是线性讲述的。但是，故事一旦讲完后，人们会在大脑里重新组合，并梳理出他们理解的逻辑。”\n\n“好的故事是这样的：人们不需要被教育，需要的是被触动。”\n\n“所以，写故事，不需要排比句。不需要花俏的东西。因为华丽的东西，没有情感的流动，那就是一张纸，单薄，没有体积，也没有温度。写字，不是炫耀，而是真诚地叙述。你得首先说服自己相信，你才能写好它。故事里面的场景，人物，始终有一种东西在里面流动。它会把写字的人带到该去的地方，也会把读者带到该去的地方。”\n\n“所以，写好作文最简单的做法就是：先学习叙述一件事情。让叙述的过程来说明一切。”\n\n“在写的过程中，你会看见自己曾经看见过什么，你记住了什么，什么东西对你很大的影响，什么东西是你一直不能面对的。什么东西是你不能忘记的。当然，最重要的是，你要写下来，当时的过程，或者一种情绪。”\n\n儿子说：“我什么时候才能做到这点呢？”\n\n我说：“现在就开始，你可以做到。”\n\n我说：“你们老师让你们看《读者》文摘，你们总是记得抄句子。其实，《读者》的文章有个特点，你们却没有学。”\n\n儿子说：“什么特点。”\n\n我说：“就是讲故事。你看《读者》是不是都是这样的：讲一个故事，然后，说明一个道理。”\n\n儿子说：“好像差不多都是这样。”\n\n我说：“如果你仔细看，你会发现每个故事里面还是有很多细节上的不同。故事的讲述，有很多不同的技巧，你需要自己自己反复体会，你有故事，故事就象水一样，你让它从山上流下来，就是瀑布，让它绕着村庄走，它就是河流。有时，你的任务，就是得寻找适合的容器，把它盛起来。容器就是结构，下次我们就会讲到，到底有哪些常用的结构，可以让我们把水盛起来。”\n\n“《读者》这类的文章，基本上是属于启发、教益类的故事。你会发现很多讲述是如此简单，只是需要足够的细节，足够的真实而已。不过，你想过没有：我们生活不就是这样吗？每天有太多这样那样的故事，我们从来没有时间写下来。我们觉得那都是小事，不值得写，或者说，谁会在乎呢。其实，只要你在乎，你就可以写下来。”\n\n儿子说：“这跟我们的作文有啥不同呢？”\n\n我说：“故事是一种平实的叙述，不需要言必名言名句。不需要排比句，不需要形容词。只需要老老实实地讲述。你要用真实的情感去带动你的文字，不要去在意它如何艰涩，不好看，而要在乎它是否在人的内心中有情绪的积淀，它是否是有重量，是否有温度。它是否忠实于你的个性，是否忠实于你的情感。是否有一种消融内心坚冰的力量。”\n\n“故事就是写自己想说的话，那是一种精神的印记。如果你想放弃自己的想法，只是想什么是符合标准的做法，那么，可以肯定的是，你永远也不会知道如何开始。”\n\n<hr class=\"slender\">\n\n## 【叙述-4】叙述的基本原理 \n\n> xilei 发布于 2009-3-29 17:55:00 \n\n### （一）\n\n每年的三月，儿子都会参加市上的电脑比赛。作品通过后，有一个技术的答辩会。答辩会的主要内容有两部分。第一部分是由作者自己讲解作品，第二部分是由老师提问。\n\n我一直觉得讲解作品是参加竞赛中，最有价值的部分。孩子们在学习里，总是学太多的书面知识，有太多的书面作文、太多的书面考试。而面对很多人做口头讲演的机会却少之有少。\n\n一个人，在大众面前演讲，向大家介绍自己和自己的作品，展示自己的思维，是一种非常重要的能力。这需要适当的思维的训练，需要养成构思、叙述、传达的循环反复的习惯过程。\n\n我一直希望学校的语文课有口头语言表达的训练内容：它是一些可以参照的简单可用的基本构思框架，任何孩子一个都可以模仿和练习，任何人都可以用自己的话，运用素材，讲在众人面前述一个跟自己有关的故事。\n\n这听起来有点难，或许就算是大人都不容易做到。因为在我们从小到大的课程中，没有人告诉过我们该如何做。\n\n### （二）\n\n我至今还记得儿子小学六年级的时候，我第一次跟他讲这样的一课：如何介绍自己的作品。\n\n我当初的想法是这样的：不仅要教会儿子如何完成这件事情，而且我要把思考的全部逻辑过程展示出来。让他以后遇到类似的事情，就知道该如何去做。\n\n我跟儿子说：不论是文字，还是图像，还是口头表达，有一条重要的法则，要牢记：所有的叙述，都是向受众传递信息。\n\n儿子说：“什么是受众？”\n\n我说：“你去讲你的作品，你是讲给评委老师听，还是讲给下面的同学听呢？”\n\n儿子说：“当然是老师听了。”\n\n我说：“老师就是受众。就是那些想听你话的人，或者说是你想讲给他听的人。”\n\n儿子说：“明白了。”\n\n我说：“受众确定了。那么，接下来，你就要想啊：老师想听我讲什么呢？”\n\n儿子说：“我怎么知道老师想听什么？”\n\n我说：“如果是平时的话，你的确不知道。但是，现在不同。你要想你是干什么去了？”\n\n儿子说：“我是去答辩。”\n\n我说：“老师呢？”\n\n儿子：“老师是评委。”\n\n我说：“对了。你做演讲有一个环境的因素在里面：就是要围绕你的作品来讲。老师来干什么来了？老师做两件事：第一件事是先听你说；第二件事是根据竞赛的规则提问、考核。第一件事就是我们现在正准备的，第二件事才真正是老师要做的。”\n\n“好，我们现在换一个角度来看。我告诉你，如果我是你们的老师，我会怎么评审呢？”\n\n儿子说：“你怎么知道我们老师想什么呢？”\n\n我说：“我仔细读过你们的电脑竞赛的要求，参赛标准。你来看看，老师想问什么，其实，这上面都有！”\n\n我把网站上的参赛和答辩要求，都指给儿子看。\n\n“这是主题要求。这就告诉我们，你给老师介绍的时候，要说明你的主题是符合要求的。”\n\n“这是技术要求。这就告诉我们，你要给老师讲你的作品里面使用了哪些特别的电脑技术。”\n\n“这是制作的过程介绍。这就告诉我们：你要给老师讲你的制作过程。”\n\n儿子说：“我明白，是不是相当于要把这些都放在演讲的过程中？”\n\n我说：“是的。”\n\n儿子说：“可是这么多东西，我怎么才能把它串在一起，一口气讲下来呢？”\n\n我说：“儿子，不急。刚才我们讲的是一个内容的分析过程。现在，我们知道了，老师可能想听哪些部分的内容，我们做的是一个内容的逻辑分析。但是，要口头演讲的话，要换一种方式，才能把所有的方式串起来。”\n\n“首先，我们把整个内容的逻辑简单梳理一下，让它听起来是流畅、合理的。”\n\n“当有很多主题，看起来比较散的时候，你又想把很多东西串起来。一个简单的办法，就是不要一个一个讲这些主题，而是讲述做事的过程。然后，把你想讲的东西再挂上去。”\n\n“如果我是你，我就会这样给老师讲这样几个方面：\n\n首先，我会讲我为何会做这个动画，我是如何想到的，我为何可以做这个动画；为什么要先讲这个呢？因为你和老师是初次见面。你是谁，老师也不知道。你怎么构思，怎么想，老师也不知道。\n\n讲事情的起源，看起来是多余的，其实不是。很多叙述是一种认知的需要。你要打动人，说服人，最重要的是要让人知道你是什么样的人。\n\n可是，老师不知道你是什么样的人。老师是从你说的话，做的事情中了解。\n\n所以说，你给老师讲你做动画构思的过程，就是在传递这样的信息：我是怎样的一个牛人。\n\n其次，我要讲在制作的过程中，我使用了何种技术，我是如何理解这种技术，如何使用它的，不去谈技术的细节，因为后面老师会考你的，你说的东西要简单明了，不要太复杂，复杂容易让自己偏离重点。\n\n所以，你还是这个办法，讲你用什么技术解决了什么问题，讲你使用技术的体会。你做的东西，那种独特的感受，一定有。你就讲最关键的一、两个体会就行。\n\n老师一听就明白了：你到了哪个层次。他心里基本上就有数了。\n\n再三，我会重点讲一些制作过程中的细节。我如何收集材料，如何准备，如何付出努力去完成项目等等。细节会为作品强说服力，也会感染他人。”\n\n我给儿子说：“演讲有两个屡试不爽的基本技巧：一是讲述一个关于自己的故事；二是讲述自己在做事的过程中，如何思考和行动。”\n\n儿子根据我的建议，做了一份讲演稿：\n\n> 《我们的神舟》——演讲稿\n> \n> 开始提示：声音大点、语速不宜太快，讲话时，给老师交流眼神\n> \n> 各位老师们好！\n> \n> 我是某某小学六年级学生某某，我的参赛作品是一个Flash动画，名字叫做《我们的神舟》。\n> \n> 我为什么要做这个动画呢？\n> \n> 因为在2005年，我在学校观看了神舟六号发射的现场直播。之后我就开始对神舟火箭的整个发射过程有了兴趣，所以我回到家马上就在网上查找神舟六号的相关资料，知道了什么是逃逸塔，什么是返回舱，而且对神州发射的整个过程都有了比较详细的了解。因为在当时，我刚好又在自学Flash，就趁着这个对神舟感兴趣的时期，我就做了第一个版本的神舟动画，大体上的过程都有了，但比较粗糙。尽管这样，但还是得到了家长与老师的鼓励与支持。\n> \n> 1年多过去了，遇到这项比赛。第一，我还是挺喜欢神舟的；第二，我觉得自己的Flash水平也有所提高，所以我就又做了第二个版本的神舟动画，作为参赛作品。下面就请老师们观看我的第二个版本的神舟动画吧！\n> \n> ……（开始播放动画）\n> \n> 因为神舟构造本身就很复杂，所以我把火箭的许多部件做成一个一个的元件，便好组装、拆散；做元件的另一个优势是，神舟火箭不管怎么放大、缩小、旋转，都不会失真。\n> \n> 我在场景上又加入了淡入淡出，这样，每个场景的背景都可以循环多用，并且看起来也非常紧凑、连贯。\n> \n> 整个作品制作分成了三个阶段，第一个阶段是收集材料，花费了很多的业余时间：我自己上网站，查相关资料，反复看神州发射的录像。整个构思是在这一年中积累完成的，第二个阶段是元件制作，整个flash包含了上百个元件。最后第三个阶段是合成。第二个阶段和第三个阶段大约画了整整5天的时间。\n> \n> 今年，我国将发射嫦娥号一号。我现在又在自学3DsMax，我希望自己能在电脑上展现这一过程。\n> \n> 谢谢大家！\n> \n> ……（技术操作+答辩）\n\n这个演讲稿，儿子反复修改过好几次，又在口头上反复练习演讲了好多次。\n\n这是一个经过精心设计的看起来很普通的演讲，但仔细读来，里面包含了丰富的信息和情感。\n\n### （三）\n\n上面的演讲的设计过程，就是我教给儿子的关于叙述的基本原理的一次应用。\n\n所谓叙述的基本原理，是我自己给出的一个思维基本框架的定义。\n\n这个原理的核心内容如下：\n\n任何目标导向的叙述过程的设计，都可以用一种如下的方式或者步骤来进行思考：\n\n1. 内容分析：确定受众；\n2. 逻辑设计：确定内容要素、梳理内容的逻辑结构；\n3. 结构设计：在生活中寻找叙述的框架，最简单有效的方法就是讲述一个关于自己的故事，完成逻辑的基本诉求：把所有的要点元素或素材组织在一起，合理地放置在故事的背景中；\n4. 情感设计：在讲述事件本身的同时，讲述态度、情感和方法；\n\n文字只是叙述的一种表象。本质上说，叙述是一种思维的过程，只要通过合理地训练、反复地练习，久而久之，每个人都能获得这种人性的技巧。\n\n\n<hr class=\"slender\">\n\n## 【叙述-5】海明威的叙述\n\n> xilei 发布于 2009-5-1 15:37:00 \n\n### （一）\n\n在很多年前，我读过一篇海明威的短篇故事，名字叫《三声枪响》。讲的是一个叫尼克的小孩跟随父亲在湖边度假时发生的故事。\n\n故事一开始，就写尼克在帐篷里脱衣服，看见帐篷外父亲和叔父的影子在灯光的照耀下晃动。尼克为自己感到羞愧。\n\n是什么事情让尼克感到羞愧呢？\n\n接下来的文字开始转入正题。\n\n原来，很多天前的一天傍晚，父亲和叔父要离开宿营地去远处的地方打猎。临走的时候，父亲跟尼克说：如果有什么事情，需要他们返回的话，就朝天放上三枪。\n\n尼克看见：父亲把船往湖里推，叔父坐在船头。过了一阵，尼克听见叔父开始唱歌，也听见父亲划桨的声音。\n\n尼克开始往回走，周围的黑暗迫使他尽快返回。\n\n尼克返回营地，在帐篷里躺下，怎么也睡不着。他不时听见很多声音，但是，他不能确定那些声音到底是不是猫头鹰的声音。\n\n尼克干脆坐起来看书，他强迫自己不去想其他的事情。尼克看书，直到天亮。\n\n直到后来的某天晚上，尼克听到从森林的远处传来了一种怪异的声音，他马上拿起了猎枪，对着天放了三枪。\n\n等尼克的父亲和叔父回来的时候，他们看见尼克已经睡着了。\n\n叔父说：看吧，我说没事的。这小家伙就是胆小罢了。\n\n尼克的父亲说：他还小。毕竟是孩子呢。\n\n第二天早上尼克起来后，父亲带他到外面。父亲让他意识到，晚上听见的声音，可能是风刮到树枝发出的。\n\n所以，这天晚上，尼克躲在帐篷里，感到羞愧。\n\n然后，故事回到开始的部分。\n\n故事结尾的时候，是这样的：父亲叫尼克赶快穿上衣服，对他说：我们一起出去。\n\n\n### （二）\n\n昨天晚上，我跟儿子讲《三声枪响》，我还找出原文让他自己看了一遍。儿子看完的时候，还又往后翻了一页。\n\n我说：没有了。他的结尾有点突然。戛然而止。\n\n儿子点了点头。\n\n我说：你有什么感觉没有？\n\n儿子说：他写了尼克的害怕。但是，居然在故事里面几乎没有提到过“害怕”这个词。\n\n我说：对的。他没有说，但是你看过后，就是感觉到眼前自然就有那种画面，那种感觉可以直达你这里。\n\n儿子使劲点了点头。\n\n我说：换了是你们，你们会写成什么呢？你们肯定会写：我害怕，我很害怕，我害怕得毛骨悚然，我非常非常害怕。然后，举例说哪个古人或者名人曾经在哪个角落里说过孤独、害怕之类的话。你说是不是？\n\n第一段A名人的名言名句，第二段B古人的经典诗句。第三段本大人的总结发言，得出关于害怕的意义。\n\n儿子几乎笑倒。\n\n不过，我不是信口雌黄。现在的中学生作文里面充斥着这样的作文思路。\n\n比如很多的中学生最佳作文，一般都是这样的：满篇都是格言名句，充满了华丽而空洞的形容词。一段段的排比句，貌似看起来很有气势和文采。\n\n我跟儿子说：这种写法，只能败坏一个人的感觉。一个人老是想着别人说过的话，那他不可能相信自己的眼睛，他也不敢写出自己的真实情感。如果是这样的话，写文字成了什么？炫耀记忆和词藻的游戏？\n\n儿子问：按你的说法，记忆好词好句的做法，是不对的？\n\n我说：做摘要，没有错。但是，不能那么用。你要写东西的时候，最好先把别人的东西忘掉。你要首先想的是：我要表达一个什么，我要传递一个什么感觉，或者想法。\n\n我跟儿子说，我可以证明：不用名言名句，不用排比句，一样可以写出非常棒的文字。\n\n那个时候，我想到了海明威的《三声枪响》。\n\n### （三）\n\n你可以把《三声枪响》，看成是海明威写的一篇假期的游记作文。\n\n海明威可能就是那个尼克，一个跟父亲和叔父出去外面打猎度假的小孩。\n\n海明威没有写度假的那个地方风景如何的优美，因为优美的风景太多，以至于小孩总是忘乎所以，根本没有时间来欣赏美景。美景太多了，小孩只是高兴，不需要象大人那样热爱抒情。\n\n小孩有小孩担心的事情，比如说害怕，或者死亡。\n\n海明威想写一个独特一点的东西：他在自己的头脑里，寻找自己作为孩子时的独特感受。或许，有一天，他发现了一个小秘密：每个孩子都有害怕的经历。那种感觉，常被大人忽略，其实，却常常隐藏在孩子心里。\n\n海明威决定写一个关于尼克的故事，故事的主题是：害怕。那个时候，他还没有想好作文题目，该起一个什么样的名字。\n\n海明威想：我要怎样才能写出一个关于“害怕”的故事呢？\n\n海明威没有去用google搜索，那个时候，还没有互联网。海明威也没去图书馆找。他不喜欢去翻别人说过的话，他也不喜欢用很多的形容词。他喜欢站着写作，因为这样，他能写得简短，快些写完，才好休息。\n\n在海明威的头脑里，“害怕”不是那样一个被压扁的形容词，而是由一个又一个有形状能刺激人想象的场景：\n\n他不觉得非要说出那个词，才能表现出那样的效果。他认为环境、人的动作和对话，会泄露出很多的秘密。\n\n比如说：你可以想象一下，在伸手不见五指的夜晚，你一个人在回家的路上。突然身后，传来了细碎的脚步声。那声音跟你的脚步的节奏一样，人走的时候，那声音在，人不走的时候，那声音也停止了。\n\n环境会改变一个人的心理感受，人的内心的想象也会助长那种你想要的暗示。\n\n你可以想象：一个小孩独自穿过漆黑的森林返回帐篷时的心情。他的脚踩在路上干燥的树叶上发出的声音，周围猫头鹰的叫声，有一声没一声。\n\n如果是你，你会怎样？\n\n为了抵御某种内心的情绪，一个人会采取很多行为来抵制，或者反抗。\n\n尼克躺在帐篷里，怎么也睡不着。他只能爬起来看书，让自己什么也不去想。\n\n海明威并不把所有的东西都记录下来，他只是在陈述，一个动作接着一个动作。动作之间的逻辑关联，他认为读者其实完全可以想到的。无须详细一一描述。\n\n他相信：文字的张力是靠读者的想象去完成的。\n\n海明威写了一个孩子在黑夜中的挣扎：先是努力去分辨各种声音，然后，爬起来读书。最后，实在忍无可忍，尼克还是爬起来，朝天上放了三枪。\n\n看，到这里，你终于明白了，海明威为何把作文题目叫《三声枪响》了。\n\n尼克的父亲和叔父的对话，简单明了。寥寥数语，人物的性格和态度栩栩如生。\n\n但这一切都不是写作者说出来的，而是从故事中人物的言语中自然渗透出来的。\n\n\n### （四）\n\n我跟儿子说：一般来说，写文字和其他的任何创作和设计，没有任何不同。你不要认为，写作和设计都是一拍脑袋，就什么都有了。其实不是，基本的过程是有章法可循的。\n\n比如说，你要写一个东西。可能是因为某个触动和感觉在你心里蕴藏很久了，或者你有一种希望表述的愿望，让你有了一种想要捕捉的愿望。\n\n一般来说，很多创作的起点，都是来源于灵感或想法的。\n\n接下来的是，如何用一系列的手术刀似的方法，来捕捉这种创意。很多时候，你会发现，你开始的想法或许是不完整的，甚至会导出相反的感觉。\n\n接下来的工作是搜集材料，收集很多素材。围绕主题的，或者跟主题相反的材料。然后，做归纳、过滤、剔除。\n\n你要确定的是这些材料对于叙述的主题是否是有益的和互补的。\n\n接下来，要寻找一种把主要材料组织在一起的结构。\n\n创造任何一个东西，结构都是非常重要的。因为文字如同建筑，你没有构造的话，再好的素材，都是一遍散沙。\n\n我们经常会看见很多简单的故事，因为结构的妙用，变得很容易让人理解。\n\n比如说：《平民窟的百万富翁》，用《开心辞典》的方式，把主角成长的片段很方便地串联起来。这种结构，重点突出，详略得当。根本不需要中间的过渡。因为这种娱乐问答的方式，自己本身就是允许跳跃的。\n\n再比如说：《海角七号》也是同样的道理。那七封情书，是一个多么温暖的线索，把所有的元素，串在一起。如果没有这根线。你得花多大的力气，把那么多的场景和素材，放在一起，而不感觉凌乱？\n\n接下来是安排场景，安排段落之间的逻辑。\n\n海明威写尼克害怕，段落之间是有非常明显的逻辑推演的。\n\n尼克看见父亲推船下湖，他看见叔父坐在船头。他听见歌声和船桨划动的声音。他的周围弥散着夜晚的气息。\n\n他回家的路上，一种情绪开始弥漫。\n\n他想听清，到底是什么动物在叫。\n\n他睡不着，从床上爬起来看书。\n\n后来的一天晚上，他实在是无法肯定，拿起枪对天空放了三枪。\n\n海明威知道：这世界上有一种很厉害的结构，就叫因果关系。你只需要把它一层一层地撕开，无须多言，每个人都会有真切的体验。\n\n### （五）\n\n我建议儿子把《三声枪响》多读几次，甚至可以学着模仿这种写法。我告诉他，以后写作文的时候，不要觉得自己什么都没有，也不需要靠什么好词好句。\n\n我说：我不相信，你没有自己熟悉的东西。你的生活中，有很多细节的东西存在。你只是没有仔细想过。比如说，我经常听说你们中午打饭很热闹。那么，你为何不回忆一下有那些细节，让你有如此体会。你为何不把这些画面，用最简单的方式写下来呢？\n\n儿子想了想，马上很激动的说：我们中午送饭过来时，盆子下面有油。大家抢饭的时候，不小心，总会把油蹭在衣服上......\n\n 我说：对了。这就是细节，这就是画面啊。你只需要简单的回忆，用简单明了的话，把你看到的东西描写下来。就已经是很棒的素材了。为什么不这样写呢。为什么要想象看不见的古人，而不是先从自己的身边下手呢？\n\n我把《三声枪响》讲完后，帮儿子做了一个总结：\n\n1. 睁开眼睛，相信自己内心是有东西可写的\n    首先，写文章的时候，要相信自己的内心的感觉，要确定自己到底要表达一个什么感受或者观点；\n    一次只表达一个感受，或一个观点；\n2. 观点明了、逻辑清晰、结构易懂\n    写的时候，要挑选素材，然后寻找一个简单的结构，确定好段落的逻辑。\n    用自己的话写，只要逻辑上没有问题。\n    任何文字是为内容服务的。所以，对一个初学者来说，重要的不是文笔好不好，而是首先要写清楚。只有写清楚，读者才知道你在说什么。\n3. 海明威的叙述\n    如果你肯定的话，别人早就知道的事情，你可以不写。\n    你只写事情浮现的部分。就如同那些气势磅礴的冰山，我们虽然看见的只是浮出海面的八分之一，而剩下的部分，通过想象就可以顺利完成。\n    忘掉形容词，忘掉格言名句。当你根本没有什么可依靠的时候，你的眼睛就会睁开。你的能力就会自然而然地生长出来。\n    做任何事情，最重要的是要树立信心。写字也是一样。\n    一个对自己有信心的人，简洁不是一种叙述的形式，它就是叙述本身，它就是叙述的动力和方向。\n\n\n<hr class=\"slender\">\n\n## 【叙述-6】结构:因果和重复 \n\n> xilei 发布于 2009-5-21 17:11:00 \n\n### （一）\n\n现在，每到周末，我都要求儿子写一篇钢笔字。\n\n他握笔的姿势不好，整个笔是竖起来的，写字象鸡啄米。遇到作业多的时候，力气用到最后，字都是东倒西歪的。\n\n我说：背打直了。手放在桌子上，吊在外面着怎么能写呢。\n\n儿子听着，有时会很不耐烦地挪挪屁股，象征性地动一下。\n\n有一天，作业的书写太乱了，简直都看不下去了。我大光其火。\n\n我说：这样可不行。你写的字，别人都看不清楚。你得花时间练习练习写字。\n\n我让他先注意写字的姿势，然后，给他说了一个练习写字的办法。\n\n我的要求很简单：我不要求你写成一个书法家，但是，你起码要把字形写清楚。\n\n我找了一本字帖，翻到其中的一页，拿了一张纸，让儿子先临摹了一排。\n\n儿子写了一排。比划着写，怎么也不赖。\n\n写好后，我把字帖拿开，让他自己写一排。字象弹簧一样，立马回到从前。 \n\n我说：你知道你的字，为何跟刚才的字不一样吗？\n\n儿子在发愣，不知道该怎么办。\n\n我说：我跟你说一个写字的技巧。你马上就会改进很多。我们先不谈什么笔锋，你看看你的字形结构！\n\n我指着纸上的一个“仁”字，我在字上面各自画了一个长方形，把字分割看。\n\n“你先不把字看成是字，而是一幅画。那么‘仁’这幅画，包含了左右两个部分。我们用方形把它们圈起来。你注意感受人家写字时，这两个部分的相对大小。还有块与块之间的位置。”\n\n“写字首先，是要横平竖直。你看看你的单“仁”旁，你左边的这个竖，都是歪的。站直了，别趴下！”\n\n“你看看右边的方形的位置，相对于左边，大概是在什么位置。这是一种的平衡的感觉。你多看看别人起笔的位置，多体会，自己写一写。”\n\n“同样，象这个‘音’字，是上下结构，上面的立，是一个扁平的长方形，下面的日，可以写成竖立着的长方形结构。如果你写成同样的形状，感觉就象压扁了一样。竖立的形状，才能撑得住。”\n\n挨着把一排字的结构，和儿子的字做了对比和分析。每个字，写了几十个。\n\n儿子把字重新写了一遍，象换了个人写的一样。\n\n我说：一个字的字形有很多变化。但是，刚开始，学一种就行。重要的是，你要先学会看懂人家是怎么结字的，然后，才好模仿。模仿好了，就可以加入自己的特色。那个字，也变成你的风格了。\n\n我认为对于初学者来说，写字的关键，在于识别字形结构。\n\n写字是这样，其他任何领域里的学习都是一样。\n\n记住：不论你干什么，你首先要了解其中的结构。\n\n### （二）\n\n举一个例子来说明。\n\n在《读库》0804里面有这样一篇文字：《电影编剧的秘密》。里面讲了这么一个故事：说的是老外怎么写西部片。\n\n在老外眼里，西部片是一种类型电影。\n\n什么是类型电影？就是电影的故事结构，已经模式化了。凡是这种电影，结构都这么写。\n\n美国西部片的结构通常是这样的：\n\n【故事开始】\n\n1.英雄来到了小镇；\n2.小镇被恶势力控制，小镇人民无力反抗；\n3.英雄初露本色，有超强本领，打破小镇平静；\n\n【故事中间】\n\n4.英雄与恶势力发生冲突；\n5.小镇人民不理解英雄；\n6.英雄与恶势力冲突升级，因为得不到支持，英雄受到磨难；\n7.英雄在频临绝境时，凭个人智勇杀入重围，消灭恶势力；\n\n【故事结尾】\n\n8.小镇人民挽留英雄，为英雄拒绝；\n9.英雄离开小镇。\n\n仔细想想，好像是这样。\n\n我们明明知道美国电影很有模式化，也明明知道很多是假的，但是，我们还是乐意去看，我们乐意上当！\n\n为什么我们总是愿意相信这样的一种“偏见”：美国电影的故事比中国电影的好看？\n\n答案很简单：\n\n美国的各种类型电影积累了很多千锤百炼的叙述方式，它的故事的结构满足了人性的基本需求，也符合人的认知心理。\n\n因为经典结构能很好地沿着受众的认知的路径，一步一步释放信息，跟受众达成了一种沟通的默契。\n\n在这种结构的约束下叙述，整体的基础是稳定的。\n\n### （三）\n\n上周周末，儿子他们布置的作文内容是：给某名人写一个短小的墓志铭和写一篇关于李白的小传，老师从网上下载了李白的文字资料，让他们参考。\n\n墓志铭上周曾经写过一次，老师还把班上同学写的好的文字打印出来给大家分享。\n\n有些写的真不错，但是，有一些文字，我一看就笑了，感觉不妥。\n\n我马上在网上挑选了一些墓志铭，让儿子看。\n\n我说：“文体的真实性，很重要。墓志铭是写给死去的人，重点是对一个人的总结或评价。不能成了作者的抒情描写，这是喧宾夺主啊。这样写，对死者缺乏尊重。”\n\n儿子说：“反正也是练笔，又不是真的墓志铭。”\n\n我说：“不行。你得当真的来写。你明明是写的就是墓志铭，你却写成了抒情散文诗。方向都偏了。”\n\n儿子还在等我后面的话。\n\n我说：“你这样理解吧：你打算写一个请假条给老师，本来写清楚就行了。结果，却写成了抒情诗。老师看了后，猜了半天，也没有搞清楚，你到底要干什么。”\n\n“所以，不能乱来。文体的真实性，很重要。你的文字用途不同，你叙述的结构就不同。”\n\n我一下意识到，学生的作文训练缺少必要的结构训练：\n\n把什么东西都写成了散文，是要不得的。\n\n### （四）\n\n因为前面的事情，晚些时候，我还专门看了看儿子写的小传，眉头又皱紧了。\n\n“怎么都写成了排比句。你不觉得这样很单薄吗？你这样写东西，结构都有问题，文章都不成形。”\n\n儿子说：“我们班上都是这样写的。”\n\n我不知道从什么时候开始，中学作文的文字都变成了抒情散文。不论是男生和女生，都在写这种软绵绵的东西。\n\n我在网上，找了一篇别人写的“鲁迅小传”。我给儿子分析，别人是怎么写的。\n\n我说：我觉得它这个结构，你是可以借鉴的。他的写法是这样的：分成是三个大的部分。第一大部分，是对鲁迅的一个总的概述，第二段按照他的生平时间来写，只写重点的事件。最后的部分是对鲁迅的评价。\n\n我说：你写李白的小传，也可以拿来主义，分成三部分。第一部分，对李白做一个总结性描述。第二部分，也是按照生平时间来写，写他的生平经历。最后部分，因为他是伟大的诗人，当然要对他的诗歌做一些评价。\n\n儿子按我的话去做了，很快写好了。\n\n我看了看，“整体的结构是没什么问题了。第一部分和第三部分，都没有什么问题。在第二部分，有点乱。”\n\n“第二段，我们的目标是写李白的生平。好的，我们把我们认为的事件，都写出来。但是，这不能搞成排比的方式。在这种事件的挑选中，我们要做的是：你选出的事情，要让它呈现出一定的逻辑关系。它不应该是一堆无关紧要的东西，随便堆放在一起。”\n\n我说：“我为什么反对用过多的排比句？因为排比句，过于重视词语的优美，而忽略了叙述的逻辑。如果你前面有很多的叙述铺垫，你可以用。但是，如此简单的重复，留给读者常常是空洞的感觉。因为华丽的词语本身需要让读者去想，而不是自然感受到。这会破坏语言的感觉，也会影响到阅读的流畅。”\n\n“所以，好的做法是沿着设计好的结构的轨道跑。好的故事形状，会带来很美妙的感受。”\n\n“好了，我们回过头来说，怎么写第二部分。我们怎么去寻找第二部分的叙述逻辑。一个很简单的办法，就是依据事实，自己提问。”\n\n“李白是个很自负的人，16岁前就云游四方。那我们就要问了，他为何要去云游？他为何要自负？他想干什么？答案是：李白对自己有一个很高的期待，希望自己在仕途上，能一展抱负。”\n\n“接下来才有李白进京。他自己希望得到唐太宗的赏识，不过，皇上看中的只是他的诗才。在皇帝眼里，他不过是一个用来娱乐的工具而已。”\n\n“如果你是李白会怎么样？你肯定会很失落。”\n\n“所以，李白才写下了‘抽刀断水水更流，借酒浇愁愁更愁’的诗句。他在表达自己内心的郁闷。”\n\n“李白在宫廷里不受重用，刚直不阿的性格，就会带来麻烦，最后，他肯定是得罪了不少权贵。离开了皇宫。”\n\n“你看我说的这么干巴巴的。但我把整个叙述的线索拉出来了。我这么做是为了在素材中寻找叙述的逻辑。你在阅读李白的材料的时候，也要做同样的事情，在脑子里面一定要去寻找可以把素材联系起来的因果关系。这样，你写下的东西，才会非常的结实。”\n\n“因果关系是一种重要和常见的结构。也是一种没有任何认知障碍的逻辑结构。一旦你在素材中梳理或找到了这种关系，基本上，剩下的问题是写的问题了。你在下笔之前，你的眼睛已经看见了远方。虽然你还不完全知道过程的细节，但是，你知道自己的文字会带你到哪儿。你的文字是有方向感的，它自己不会乱跑，不会散架，更不会崩溃。”\n\n儿子花了些时间，重写了第二部分。\n\n文字上还有问题。但我能确定的是：总体的结构对了。\n\n我不能确定的是：用完全不使用排比句的方式写作文，儿子在考试的时候，会被判一个什么样的分数呢？\n\n文字的逻辑好解决，而生活的逻辑，却很难很难。\n\n\n### （五）\n\n再补充一点：\n\n排比句的用途在于：不断重复，增加层次感。但是，如果通篇都只是在词语上做排比功夫，则会呈现出一种华丽而虚伪的文字。\n\n其实，本文的结构，也是：重复。我依赖故事的主题重合来表达。没有用排比句来重复，而是依次讲了几个看起来不一样的故事。\n\n有时，简单的故事比豪华的句子更有质感。它的感受性更自然一些。因为故事的叙述往往是从容的，符合人的心理感知。\n\n我们以后会提到叙述的多声部手法。那是一种象音乐“排比句”的叙述结构。\n\n我们可以看到很多好的作品，如何把简单的重复，运用得如多棱镜一样，绚丽夺目。\n\n\n<hr class=\"slender\">\n\n## 【叙述-7】一味地抒情没有力量 \n\n> xilei 发布于 2009-6-14 20:32:00 \n\n### （一）\n\n周末的时候，我和儿子去小区周围的书店，买《读者文摘》。学校的老师要求他们经常看这个杂志。我经常看儿子他们做一些摘抄的笔记。\n\n我们买了杂志出来，儿子跟我说：爸爸，我发现了一个秘密。\n\n我说是什么。\n\n儿子说：我刚才付款的地方，放了一排的影碟。都是《变形金刚》、《终结者》之类的。\n\n我说：哦，这说明了什么呢？\n\n儿子说：我猜是因为新的《星际迷航》要上映了。商家就把这同类的电影，摆放出来，让大家看。\n\n我说：有道理。商家是在做营销。\n\n儿子：什么是营销？\n\n我说：就是商家想一些办法来帮助推销商品给顾客。比如说《星际迷航》的新电影要上映了，商家就找一些同类的书、影碟和杂志，摆放在一起让大家选。他们就是想办法，让人能顺便多买一点。\n\n儿子说：原来他们是这样想的！\n\n我说：那当然，他们是动了脑子的。\n\n儿子说：哪还有没有其他促销的办法呢？\n\n我说：有啊。刚才这种，叫同类促销。还有一种，貌似没有关系，但实质上，有关系。\n\n我说：曾经有超市在卖小孩纸尿裤的地方，也摆放啤酒。结果，这两种东西都同时卖得很好。\n\n儿子说：我不明白。\n\n我说：看起来两件东西没有关系是不是？其实，如果这样想，就很容易理解：妈妈在家里带小孩，爸爸到超市买纸尿裤，顺便买点啤酒犒劳自己。\n\n儿子说：原来是这样。但是，他们是怎么知道的呢？\n\n我说：是的，这只是一种猜测。比较合理的猜测。其实，没有人一开始就知道会出现这个结果。\n\n儿子说：那谁会知道？\n\n我说：电脑。我们去家乐福购物，你到出口的地方付款。收银员扫描货物，那些销售商品的数据就汇集在一起。数据会发现很多人在做同样的事情：买了纸尿裤的人，同时也买了啤酒。\n\n我说：是电脑数据在提示人该怎么做，可以更方便卖出更多的东西。他们也会根据自己的需要，经常调整货物摆放的位置。\n\n儿子说：难怪上次，我发现卖文具的地方挪了地方，我在里面转了一大圈才找到。\n\n我说：你进去后，会重新定位。有很新鲜的感觉，也会发现旁边有不同的东西，可以选。\n\n晚上的时候，儿子要写作文了，还没有题目。我就说白天，我们聊的事情，可以写一写。\n\n儿子说：就是一些想法。也可以写吗？\n\n我说：那当然。这是一个真实的事情，为什么不能写？\n\n### （二）\n\n我对现在学校里的语文课，基本上不抱过高的希望。尤其是作文课。\n\n初中生，应该写一些说理性的文字了，很多时候，老师还在强调学生写抒情文字。\n\n我倒不觉得抒情的东西不能写，关键看你如何抒情。没事乱哼哼，写很多肉麻的排比句。太恐怖。\n\n我不知道现在是不是一个抒情时代，是不是现在学校的老师都是阴盛阳衰，不过，我觉得男孩子如果在课外推荐阅读的只是三毛作品，写一些软绵绵的抒情文字，真的是太恐怖。\n\n有时，我看儿子摘抄《读者文摘》的时候，就忍不住说：乱弹琴！\n\n我跟儿子说：其实，《读者文摘》最大的好处，不是里面的单个句子。语言，或者词语是有环境的。你这个词放在这里很好，放在其他地方就未必合适。词语可以在不同的语境下，呈现出不同的含义。\n\n儿子茫然。\n\n我说：不知你发现没有，《读者文摘》里面的文章，一般来说，最大的特点是什么？\n\n儿子摇头。\n\n我说：最大的特点就是，很多文字，都是这样的模式：讲一个故事，得出一个结论。\n\n儿子说：这样写，难道不是很简单？\n\n我说：简单又没有错。复杂往往才容易出错。很多人都用这样的简单技巧：讲一个故事，作一个启发，引导出一个结论。\n\n我说：华尔街日报的文章里面，也有一个很常见的叙述技巧：每次文字开头的时候，写一个具体的人物，或者场景。有点象电影里的处理：用一个近景聚焦，话题引出后，然后，再拉开来。最后，在结尾的地方，有可能的话，又再回到具体的场景中。\n\n他们为什么会一而再，再而三地这样做呢？经验证明，这样很有效。符合人的认知习惯。\n\n人的大脑从来都是很容易理解故事的。故事本身具有一种可感知的形状，比任何华丽的词语都更有形状。你想，故事是一个自然展开的链条：能帮助读者逐渐融入到叙述中，让他们理解信息、激发他们判断和发现的本能。\n\n因为人的认知有一个启动的过程。过于突兀的东西，会造成认知上的困惑。人对自己无法理解的东西，不能产生应有的情感。\n\n如果是这样的话，那么，那种一开头就用排比句来轰炸读者的做法，其实，相当愚蠢：给人对词语的炫耀以外，没有任何意义。\n\n也就是说，人的情绪没有任何准备，你一下就把情绪掀起得老高的，这种做法很突兀。如果你一直这么做，也不解释，人家很难理解。\n\n你自己也可以感受一下，就会明白：排比句中填充了很多抽象、压缩的词语，这些词破坏了语言本身的流畅感觉，而且要让人使劲去想它到底想表达什么。这样会造成认知的迟疑。很多时候，给人的感觉是，在阅读的过程中，依稀感觉到一些听令框框的干硬的东西，相互碰撞，但是，完全不能理解到底说了些什么。\n\n文字就是这样的：如果你组织的东西，人不能把握，你就等于什么也没说。一味地抒情没有力量。\n\n### （三）\n\n后来，我跟儿子讲德波顿的《旅行的艺术》。因为我想给他做一个示范，让他理解一本书可能是怎样构思出来的。\n\n我假设我自己就是作者，我被老师布置了一堂作文课，写一些关于以旅行为主题的文字。\n\n我不想写这样的文字：我去了某个地方旅行，然后，看见了一些风景，我有一些感想。\n\n我是一个哲学系的学生，这样写旅行为主题的文字，感觉上的确是还不够独特。所以，我想加入一点思考，写一些更有普遍意义一点的东西。\n\n我问自己的第一个问题：什么是旅行？\n\n我去 google 查了一下，上面有一个很好的答案：旅行，就是为了某个目的，从一个地方到另外一个地方。\n\n我马上明白：旅行的移动，需要一个工具。\n\n我知道：乘坐汽车、火车、飞机，有一种不同的感觉。我想起汽车的加油站、火车前进时，树木缓缓加速离开的情景，我在黑夜中，看见窗外玻璃中的自己。我看见飞机机翼下面的白云。那种不同工具下的体验，是一种旅行的独特体验。\n\n我想，每个人旅行的原因都不同：公干、游乐。人们总是向往一个远离自己地方，仿佛奔向梦想之地。\n\n人们为何总是喜欢那种异国情调的感觉？\n\n旅行，又会不会是一种逃离现实的办法？\n\n我发现，在一些文字中，也能发现旅行的痕迹：故国神游--思维从一个地方，到另外一个地方。\n\n好了，我想了很多，我从中发现了关于旅行的普遍含义，可以有这样的一些关键要素：\n\n1. 对旅行工具的不同感受；\n2. 人们在种异国情调的感觉面前，会有怎样的感受；\n3. 思想的旅行也是一种旅行。\n\n......\n\n当然，德波顿可能不是这样想的。我只是用了一个反向思维试图来理解书的结构。\n\n作为一个阅读者，如果发现了这种结构，那么，书就算看懂了。\n\n作为一个写作者，如果完成了这种结构，那么，书的骨架也基本完成了。\n\n这种逻辑结构，使得每个段落中的情节，前后关联，互有意义，浑然天成。\n\n任何叙述的难点，不在于叙述的词语，而在于叙述的角度、逻辑。是不是值得，是不是有它本身的意义。它有没有自己的思索，有没有自己的声音。\n\n其实，这是一个基本的方法。\n\n我跟儿子说：观察，然后提问，多问几个为什么，试着想办法回答它。把思考的过程和分析的过程、结果写下来。\n\n我说:写文字简单地说，就是确定一个主题，寻找一个结构，用好的细节或故事形式来表达。如此反复。\n\n如果你这样想过，这样做过。很多的东西，就会源源不断地冒出来。你根本不用担心，要用什么词语写。你能控制好内容，词语自然就如泉水一样涌出来。\n\n我们的身边有很多这样的素材，如开头的部分，我们提到的关于营销的对话。\n\n你无须写出象德波顿那样复杂的文字，但是，思考的原理，本质上是完全相同的。\n\n其实，这就是思考的力量，逻辑的力量。\n\n文字的叙述，无论如何表现，其背后都有一种思考的过程。只有那种内在的逻辑的表达，才能让读者知道你想说什么。\n\n你看见一些现象，你问到底是为什么。你去寻找那个驱动向前的逻辑力量。你就可以找到文字，找到答案。\n\n\n<hr class=\"slender\">\n\n## 【叙述-8】叙述的态度 \n\n> xilei 发布于 2009-10-27 13:42:00 \n\n### （一）\n\n10月1日上午，在家里看了今年的阅兵式。\n\n以前的两次大阅兵也看过，“小平您好”的那次最有记忆和感触。\n\n今年的阅兵怎么说呢？一种说不出的味道：看起来很热闹，感觉却很拘谨，不舒服。\n\n过了两天，就在网上看见了一个卫报记者做的几分钟的照片和影片的剪辑合成。这个精彩的片段，给我们提供了另外的一种视角。\n\n我看见了一种cctv从来没有展示的一些细节：阳光透过云层在天安门洒下游动的阴影；在微风中舒展的红旗；战士们整齐的步伐在舒缓的音乐中形成一种反差；游行队伍里人们舞动的手臂，他们的面容；还有孩子骑在父亲的头上在队伍中走过....\n\n作为一个旁观者的角度，卫报记者配了一个冷峻的音乐。于是，网上有很多人在骂，说这个片子不怀好意。\n\n一个热闹的欢腾的场面，为什么不是锣鼓喧天呢？\n\n又过了几天，我在网上下了一个凤凰卫视版的阅兵视频下来。我看了一段，马上就明白那种不舒服的感觉来自哪儿了。\n\n这种感觉就如同当初看NBC制作的北京奥运会转播一样：任何东西，只有通过对比，才能发现，同样的事情，用不同的方式讲述，其品质的差异会很大。\n\n所以，有网友批评cctv是：一流的设备，二流的解说，三流的摄影，不入流的导播。\n\n其实，cctv的问题不在于其专业水平，而在于其叙事美学的选择不同。\n\ncctv已经习惯于一种宣讲、致敬的美学。其美学特征为：字正腔圆、句式标准规范、场面宏大、激情澎湃。\n\n凤凰卫视则提供了另外的一种平民美学的范本，其美学特征为：基于沟通和理解的讲述方式，关注细节，语气是舒缓、亲切的。\n\n凤凰卫视的国庆阅兵有很多值得回味的细节：\n\n主持人会事先告诉观众，整个庆典仪式是怎么一个流程。每个流程中有什么看点。国外的媒体关注什么重点。\n\n整个庆典有现场报道，主持人会讲到一些有趣的佚闻：胡总从天安门层楼的某号电梯下去阅兵的；游行的人群中有人的鞋掉了，光着脚走过了检阅区；每个彩车里面还藏有很多人，万一车子出故障了，就用人推....\n\n丰富的细节，并不会给人揭丑的感觉，反而感觉到温暖。一种体量的叙述，会让人有一种可以亲近的参与感。\n\n当士兵列队走过的时候，主持人会请主持嘉宾介绍他们手中的各种武器。\n\n阅兵有阅兵的主题。\n\n听了凤凰卫视的国庆阅兵解说，我终于有了一回人民当家作主的感觉。\n\n### （二）\n\n有一天，儿子从学校拿回了一摞同学的作文本。\n\n儿子的作文，总是只得了40多分（总分：60）。老师不喜欢他实话实说的写字方式，说他的文字没有感染力。\n\n老师直接推荐了班上写得很好的同学的作文，让儿子学习。\n\n儿子给我推荐了一篇，叫《风声》。老师说这篇特别具有“哲学”气质。\n\n这篇作文得了56分。\n\n文章的开篇是这样的一段话：\n\n> 我如泥一般烂在沙发上，四周都是疯狂涌入的笛鸣。静止的空气，囚禁的心灵。\n\n老师在旁边打了一个很大的五角星。五角星表示：good,very good!\n\n文中还有很多这样类似的五角星句子：\n\n> 哪个男儿，在红日烈风下，不心生豪情，哪个男儿，在啸风中，不欲定天下。\n> \n> 即使此刻立即化为灰烬，也要对酒当歌，与风合吟。\n> \n> 好个狂气的风声，撩我发髻，夺我衣衫。\n> \n> 好个放肆的风声，湮灭我的声音，同化我的灵魂。好个自由的风声，吹断了我的枷锁，笑塌了我与尘世的隔阂。\n> \n> 我是风的信徒，我是自由的奴隶。我不求长生不死。我只愿跪拜于这风声中直至消亡。\n\n儿子问我：“什么感觉？”\n\n我说：“我很高兴，你没有写成这样。看了半天，我还不知道，他到底在说什么。”\n\n我说：“看了第一段，就看不下去了。我对这种文风，只有六个字的评价。”\n\n儿子停下手中的作业，望着我。\n\n我说：“这就叫：抒情败坏叙述。我并不是说，任何抒情都不可以，而是，你得讲求基本的叙述逻辑。”\n\n“叙述，是一种沟通的过程。你要传递信息，你要选择什么信息，如何组织和结构。你不能一站上来，就扯开嗓子喊，一个人在哪里莫名其妙地抒情。这一点没有任何哲学气质，完全是发神经的做法。”\n\n“你看这些作文都写成什么样子了：一上来就用排比句，而且是大段大段的排比。然后呢，把所谓的名人名言切割、包装，整理成段，也不管他逻辑上跟文字有没有关系，就往上搭理。简直就是收破烂的。这些写，迟早要把脑子给写废了。”\n\n儿子说：“老师说，如果这种文章能写的话，以后什么文章都可以写了。”\n\n我说：“这简直就是在误人子弟！你们都在看余华的《活着》，你们看作品中，也没有，动不动就乱排比的，乱抒情的。”\n\n儿子说：“就是。老师让我们找好字好句，结果，我们找了好久都没有找到。”\n\n我说：“其实，你们有一个同学写的挺好的。他写他在乡下和奶奶在一起的时候的一些小事。我觉得很真实，至少我知道他在告诉我值得记忆的是什么东西。可惜，老师让他重写。我觉得越写越差了。为什么不相信哪些真实的细节，而要去追求哪些虚无缥缈的形容词呢？”\n\n这位同学在重写之前，在本子上写了自己的“罪状”：语言太没有感染力了。\n\n这位同学重写了一篇。在文章的开头，他写了一段这样的话：（此处为排比句）。老师给了个大大的问号。\n\n我想：这也是同学无声的抗议吧。\n\n我把其他同学的作文也很快翻了一下。没有办法看下去，都是写成了一个模子，都跟打了鸡血一样。\n\n我跟儿子说：“有空，我推荐你看看卫报记者和凤凰卫视的国庆阅兵。”\n\n“cctv版的解说，就跟你们的作文一样，打了鸡血一样。你回过头来，看看不同的叙述方式。你会发现，叙述其实，就是一个沟通和理解的过程。”\n\n“如果你不想让人家理解，你只管自己在哪里嚎就是了。没人理你，因为，你也不想让人家理解你！”\n\n“可是，如果你想和人家沟通。那你就要想好了：我想表达什么，我该如何表达得真实、贴切和有亲和力。”\n\n“你们同学的《风声》的这种写法是根本要不得的：基本上属于逻辑混乱，词不达意。这种矫揉造作的文风在现在的学校里备受推崇，而且很容易在考试中得高分。但是，这些真的是垃圾啊！”\n\n“我宁愿你仍然写成现在的样子：关注自己的观点和感受，然后，思考如何把它表达清楚。文字上的技巧，可以慢慢来。”\n\n“我们宁愿真实一点，笨拙一点，也不要胡言乱语。如果一个人脑子坏了，就没法弄了。如果脑子还好，傻一点也没关系。”\n\n\n### （三）\n\n有什么样的社会，就会有什么样的文本。\n\n我的移动硬盘上有一个10多个G的NBC剪辑的北京奥运会开幕式。我最喜欢的是那个好莱坞似的片头。\n\n每次我看到那些画面的时候，我真的想到了四个字：山河壮丽。\n\n可是，我也看过cctv的版本：插播了很多无关紧要的领导的画面。很多美轮美奂的细节都牺牲掉了。\n\n最让人无法忍受的是耳朵里充满了打鸡血一样的解说的声音。这些声音老是让我想起了朝鲜人民的新闻联播。\n\n从今年的阅兵式后，我得出了一个结论：如果以后有类似的转播，最好不要听cctv的解说。\n\n有什么样的态度，就有什么样的叙述。\n\n\n<hr class=\"slender\">\n\n## 【叙述-9】好莱坞电影的秘密\n\n> xilei 发布于 2010-1-18 14:48:00\n\n### （一）\n\n要到期末考试了。儿子他们开始准备“万能作文”。\n\n第一次听说“万能作文”的时候，我是大吃一惊。\n\n还在想：怎么写，作文才能写成万能的啊？\n\n儿子把作文题目给我看，我才明白，原来“万能”是另外一种意思。\n\n比如说，作文题目是这样的：带着....出发。\n\n我想：这种题目当然是万能。\n\n我问儿子：可不可以写“带着怀疑出发...”\n\n儿子说：不能。老师说了，一般都写这种，“带着感动出发”、“带着回忆出发”.....\n\n卖糕得，原来万能也不是真的万能的。\n\n我说：可不可以写“带着锤子出发.....”\n\n儿子说：为什么？\n\n我说：我们这里公交经常自燃....\n\n儿子在一边笑弯了腰。\n\n“那肯定是一篇很牛逼的零分作文。”\n\n### （二）\n\n儿子上中学后，语文就改写散文了。不写记叙文了。\n\n我问他：为什么呢？\n\n儿子说：老师说的，记叙文，只能用第一人称来写。\n\n我说：这很容易。下次，你开篇第一句就写：我是某某某。接下来，就用第一人称写。\n\n儿子跟我说：这个寒假，他们老师要他们多读满分作文。\n\n那些满分作文，上百度就可以搜到。\n\n儿子和我，都认为，这些作文，大部分都惨不忍睹。（其实，我想说:大部分都是垃圾！）\n\n我说：等你考试完后，马上去看《阿凡达》。另外，我还推荐你看两部电影：《心灵捕手》和《大鱼》。\n\n好多次，我跟儿子说过：好莱坞的电影，会教给你很多东西。\n\n### （三）\n\n在我看来，很多好莱坞的电影，其实，讲的是同一个故事。\n\n经典的好莱坞的故事一般都是这样的：\n\n一个有理想但有缺陷的主人公，遇到一个突然降临的事件或动机，他面临着克服自己的弱点，展现出面对困难所需要的勇气和信心。经过一系列的痛苦、坚持和奋斗，他终于做回了自己--一个有点害羞的大英雄。同时，伴随着正义战胜了邪恶的大结局。\n\n我们拿两部电影来看。\n\n在《功夫熊猫》里，阿宝是个胖子，他的梦想是当功夫高手。阴差阳错的，他被选为神龙大侠。但是，他的师傅不待见他。他自己也曾经心灰意冷。但是，后来太郎出来了，这就是一个转折点。所有正义的一方没有选择的机会了。他的师傅接受了乌龟大师的批评教育，改变了想法，教给大宝功夫。阿宝也在关键时刻领悟到自我的力量。阿宝，最终打败了太郎。\n\n同样的，在《2012》用另外的元素，把故事重新讲了一次。\n\n主人公是一个在现实中不太走运小说家。他面临工作和家庭的双重困难：含辛茹苦写的科幻小说只卖了500本，而自己跟妻子离异，自己的儿子跟前妻的男友打得火热。他不知到底该如何面对现实和梦想的距离。\n\n这时，2012到了，地球开始毁灭了。小说家迎来了转机。\n\n他隐藏在平常现实里的聪明才智和勇气，有了向亲人展示的机会。\n\n爱、自由和责任，把这个渺小的凡人，变成了一个伟大的拯救行动的化身。\n\n最后，连导演都帮了他的忙，帮他在逃亡的途中，让事故消灭了他的情敌。他重新赢回了家庭和尊严。\n\n好莱坞的经典故事莫不如此：《变形金刚》如此，《阿凡达》也是如此。\n\n### （四）\n\n那为什么同样的故事模式，无论重复多少次，人们都爱看？\n\n大概可以有如下的几个理由：\n\n1. 人类天生喜欢故事；\n    一切叙述的本质就是沟通。而好的故事模式具有好的沟通模式。\n    好莱坞电影跟观众的沟通堪称典范：\n    它由巧妙的结构、鲜明的动机，以及一系列观众容易理解的事件前后因果联系所构成。\n2. 人类的好奇心；\n    对真实性、对细节的渴望，源于人的本能。\n    人类喜欢惊悚、恐怖，或酷爱遥远的宇宙，都是出于人的本能。\n    即便在虚拟的空间中，人也追求感觉上的真实一体性。\n    人可以理解在一种假想环境中的真实，但是，他们还是需要逻辑的连贯性。否则，他们会产生质疑。\n3. 人类存在对高尚情感的追求\n    人在现实中，不能获得的正义感，需要一个感情的出口。\n    人类的普世价值，在电影中，可以用一种有距离的现实来观察、呈现，并引起共鸣。\n    谁要是不承认普世价值，带他去看《阿凡达》就好了......\n\n### （五）\n\n好莱坞电影，其实，可以告诉我们如何叙述。\n\n首先，你要想清楚，你到底要表达什么。\n\n其次，叙述必须要有一个用来沟通的结构，或者逻辑。\n\n接下来准备或挑选素材中，你想呈现的因果联系。你的细节最好能感觉故事比较真实、准确、足够丰富。\n\n当然，现实中的叙述的冲动，可能是这样产生的：\n\n你看见了一个素材，触发了你的一个想法。然后，你才想，我到底要表达什么，然后，再去想如何弄。\n\n因此，不管你做任何叙述，还是创造其他的什么玩意。\n\n重要的是思维的过程要是正常的。如果思维的过程都不正确，那怎么弄都是瞎弄。\n\n当然，还有更重要的一点：\n\n你必须忠实于自己的内心，你不可能用一种黑灯瞎火的方式去写出一个伟大的故事。\n\n### （六）\n\n现在学校里的教作文的方式，是让我真正开了眼的。\n\n有老师这么教孩子写作文的：\n\n作文分三段，第一段写100字，第二段写200字，第三段写100字。\n\n这就是我说的：黑灯瞎火的方式。不知道在干嘛。\n\n你教孩子给段落写个小标题，不很好吗？字数能表明段落的逻辑吗？\n\n当然了，还有比这个更让人头大的。\n\n据说，有人送小孩回国读小学。小孩写了春天，说春天是潮湿的。\n\n老师就把作文给毙了，让小孩重写。春天都是温暖的，怎么能是潮湿的呢....\n\n家长吓得内牛满面。赶紧给小孩退学了。\n\n### （七）\n\n有一天，我在家收拾抽屉，发现儿子小学军训时写的日记。\n\n其中有一段，写他早上起来喝牛奶。美滋滋的感觉，跃然纸上。\n\n儿子上中学后，就没有写过这样的文字了。\n\n他们成天听写汉字、背古文，看满分作文。写字的时候，感觉和信心全无。\n\n学校是非常重视数理化，也貌似非常重视逻辑，但是，写出来的作文大多是没有逻辑的。\n\n这是为什么呢？\n\n我想了好久，终于明白了：你这也不能弄，那也不能弄。怎么可能有逻辑呢？\n\n如果有，那逻辑也多半是精神分裂、言不由衷，自断经脉的。\n\n没有人性，就没有情趣，更谈不上什么逻辑。没有人性，也不会有好的故事或叙述。\n\n就是这样。W\n\n那好吧！\n\n把作文书扔一边去，让孩子去看好莱坞的电影吧！\n\n[http://www.dapenti.com/blog/more.asp?name=xilei&id=25936](http://www.dapenti.com/blog/more.asp?name=xilei&id=25936)"},{"slug":"logical-science-from-west","filename":"2022-08-22-logical-science-from-west.md","date":"2022-08-22","title":".doc | 也谈近代科学从西方起步","layout":"post","keywords":["doc","tex","phy","m","phi"],"excerpt":"为什么近代科学偏偏是在丢过一次古典传统的西方起步的呢？为什么那些成功继承了古典时代智慧的中古文明，比如伊斯兰文明或古中国文明，反而没有成功萌发近代科学思想呢？","content":"\n前不久在公众号转载过“海边的西塞罗”写的《**嗯！您关注的是一个早晚要“凉凉”的公众号**》，标题起得让人不知所云，但是文章内容讨论的是“近代科学为什么从西方起步”的问题，原文说：\n\n> 既然你所讲述的，欧洲从古典时代到文艺复兴、科学曾经出现过一次“断层”，欧洲人是通过翻译阿拉伯人转译的古典时代文献才继承了希腊罗马先贤们的思想的。\n> \n> \n> 那么**，为什么近代科学偏偏是在丢过一次古典传统的西方起步的呢？为什么那些成功继承了古典时代智慧的中古文明，比如伊斯兰文明或古中国文明，反而没有成功萌发近代科学思想呢？**\n> \n\n作者立了一个靶子——\n\n> 我之前听到的比较靠谱的解答，**是古希腊罗马有较好的数学思想，当定量的数学思想与定性的“自然哲学”发生结合，近代科学就诞生了。**\n但这种解释，其实也回答不了一个问题——你可以说古代东方离着希腊远，没有受到希腊某些思想的“药引”的启发。但特别奇怪的是，中世纪的中东却不是这样。\n伊斯兰文明的伍麦叶王朝在公元九世纪曾经掀起过一场声势浩大的“百年翻译运动”，……近代启发西方的那些古典思想典籍，阿拉伯人全有，且早获得了好几百年。\n> \n\n给出的回答是所谓**“托勒密困境”**，即诸文明中的科学技术研究者因为要满足当权者/赞助者的功利性需要，将时间与精力耗费于附会科学（比如天文学）的非科学甚至伪科学（比如占星术）之上，而——\n\n> 这种错误的职业拼接，锁死了天文学的进一步发展的通路，导致其无法实现向近代科学的飞跃——即便托勒密会数学、引入定量计算，也依然没用。\n> \n> **而这种“托勒密困境”，其实也是所有古典时代学者的困境——他们在研究学问时，必须回答“求用”的问题。**\n> \n> ……\n> \n> **于是从托勒密到哥白尼，我们会发现西方在这一轮对天文学的失而复得中，其实并没有增添什么，而是丢掉了一种东西——那就是“求用”的思维。**\n> 欧洲知识分子们研究科学的正义性，来自于他们认定：自然作为一种上帝的造物，其本身就是美的。因此研究它、探索它本身，就是在赞美上帝，所以科学研究不必“求用”也有天然的正义性。\n> \n\n作者写近代西方科学的不求用，是为了托物言志，检讨自己为了读者的关注不得不在历史写作之外“写时评、表达观点、带情绪”，预告自己将来可能会去写作崇高的钻研历史的题目。\n\n给蹭热点找理由这件事，我也做过嘛，感觉写的比这篇文章还简约隽永且立意高远呢～（文人相轻.jpg）\n\n但是科学革命发源于西方这个问题，我也很感兴趣，而且有自己的思考，而且思考的结果和上文不同。\n\n<hr class=\"slender\">\n\n学物理的孩子应该都听说过《费曼物理学讲义》的大名，没听说过的话建议听说一下，自主招生考试面试装逼的时候用的上。费曼先生在引言中也立了个靶子说——\n\n> 你们可能会问，在讲述欧几里德几何时，先是陈述公理，然后作出各种各样的推论，那为什么在讲授物理学的时候不能先直截了当地列出基本规律，然后再就一切可能的情况说明定律的应用呢？\n> \n\n然后上来就讲原子论，开篇问：\n\n> 假如由于某种大灾难，所有的科学和知识都丢失了，只有一句话可传给下一代，那么怎样才能用最少的词汇来传达最多的信息呢？\n> \n\n可惜这个问题仅仅是为了引出原子论，实在是大材小用。这说明费老先生浸淫于西方科学中，“不识庐山真面目，只缘身在此山中”。而我对近代科学起自西方的解释，正好就是这两句话串起来。下面就要兜一个大圈子，把两句话圆起来。\n\n<hr class=\"slender\">\n\n科学者，对世界之正确认知也。\n\n根据这个定义，把人们已知的，关于这个世界的所有知识罗列到一个集合里，这个集合就是科学。我们只谈到了一个集合，不涉及逻辑推演，也不涉及数学带来的定量优势，更不判断从事科学研究的人是否功利。\n\n但是，集合这种知识结构过于简单——\n\n- 集合里的各个元素都是平等的，要想表示出整个集合，除了全默写出来没别的办法；\n- 集合里的元素之间没有顺序，想取得其中的某一条科学命题，只能像抓阄一样，凭运气抽到为止。\n- 一旦由于天灾人祸，集合中的部分内容丢失，除了重新把当初发现它们时经历的艰难困苦重复一遍，也没有别的办法。（哦，也可以去隔壁文明的图书馆翻译。）\n\n所以，必须找到一种更复杂的结构，来组织这些信息，解决上述问题。\n\n<hr class=\"slender\">\n\n计算机专业有门基础课《数据结构与算法》，谈数据结构，最基础的两种就是数组和链表；谈算法，最基础的概念就是函数。注意，这里说的是数据结构，刚才说的是知识结构，两者可以类比，但并非同一概念。\n\n数组，和集合几乎一样，只不过给每个元素标记了一个序号。在计算机里，由于规定数组连续存放，每个元素占用内存长度相等，所以可以通过序号，从数组开头偏置指针，以 O(1) 的时间复杂度取得任意元素，快。\n\n类比到知识结构，语数外理化政史地生，一年级二年级三年级，第一章第二章第三章，第一第二第三个知识点，背吧。列表与列表之间井水不犯河水，你数学老师说你体育老师拉稀了不能上课，你体育老师说你数学老师放屁，两者完全可以在你的知识体系里共存。\n\n链表，和数组一样有顺序，但是并不给每个元素标号，而是在前一个元素的末尾，写上下一个元素的位置指针。找到一个元素需要从链表的开头一个一个往后捋，慢。好处是修改方便，在链表中间塞进去一个新元素，只需要把前面一个的指针指向新元素，新元素的指针指向后一个元素，删除一个旧元素也类似，只对增删点附近一个很小的区域进行改动，整个链表不会伤筋动骨。\n\n但是不论数组还是链表，都需要把所有的知识全写出来，随着时间的积累，科学的总量早晚要超越人脑的记忆力，超越笔记的厚度，对于个人，要皓首穷经，要韦编三绝，才有希望提出一点新内容；对于全人类，图书馆越造越大，一轮战乱，从头再来。\n\n于是函数登场。给定一个/一组输入，根据函数体描述的算法，返回确定的输出。那我们找到一种方法，写一个函数，接收链表的前一个元素作为输入，找到后一个元素输出。这样我们只需要存储第一个元素和这个函数，就可以恢复出整个链表，用计算换空间。\n\n<hr class=\"slender\">\n\n类比到知识结构，这个函数就是逻辑推演。\n\n科学内容中的每一条知识都是一个**命题**。\n\n从少数几条知识出发，这几条在逻辑上就称为**公理**，自然科学里也称之为**定律**。\n\n命题之间可以做**逻辑运算**，**或**、**且**、**非**、**蕴含**等等，运算的结果也是一条新的命题。命题的正确与否，取决于逻辑运算的规定。\n\n通过对公理和已经算出的真命题反复进行逻辑运算，产生的新的真命题，叫做**定理**。\n\n<hr class=\"slender\">\n\n欧几里德几何式的，也就是从有限多个命题出发，承认逻辑推演进行生成的新命题的正确性，这样的一种组织方式——\n\n- 对于学习，科学不再是一家之言，门户之见。一句话的正确性不再由说话者的身份决定，诉诸人身、诉诸权威成了谬误，“我爱吾师，但我更爱真理”一句话有了切实的落脚点。\n- 对于研究，降低了难度，后来者不必从头再来，而是站在前人的终点起跑。发现的新科学有办法整合进现有的科学，证伪的旧科学有办法剔除，而不会让科学整体伤筋动骨。愚弄黔首的矛盾和谬误，真理有办法与之势不两立。\n- 自带有容灾能力，科学得以在摧毁科学记录和科学家人身的重大灾难之后，在几百年的人才断档之后，依然有办法恢复。\n\n<hr class=\"slender\">\n\n刚才说数据结构和知识结构不同，知识管理界有个 DIKW 模型，也就是数据 (Data)、信息 (Information)、知识 (Knowledge)、智慧 (Wisdom)。\n\n纸张上的墨迹组成的字符只是数据，当这些单词按照语法理解为句段篇章之后才构成信息，这些篇章内容指代的概念、关系等等含义构成知识。如何理解知识与知识之间的关系需要智慧。\n\n“继承了古典时代智慧的中古文明，比如伊斯兰文明或古中国文明”——从各个文明没能演化出科学革命来看，**这些文明最多是有一部分学者继承了古典时代的知识，而没能认识到 *用逻辑组织知识* 这一智慧的价值**，而西方发掘出了这种智慧。至于这种发掘发生在西方，是偶然还是必然，由哪些条件促成，那是另一个很有趣的问题了。\n\n“我们会发现西方在这一轮对天文学的失而复得中，其实并没有增添什么，而是丢掉了一种东西——那就是‘求用’的思维。”——西方对天文学的失去，对应的是罗马统治下的和平结束时的战乱与社会崩溃，不论之后的文艺复兴如何光辉灿烂，**这种失落都是对科学乃至整个文明的威胁**，如果没有这种失落，科学革命想必会更早更容易发生。况且这种失落到复兴的整个过程中，对科学有影响的因素实在是太多了，既有正面又有负面，实在是难以分析归因。\n\n至于不求用的思维，有了逻辑推演，科学工作者的产出提高，高到了让社会愿意供养其全职研究的地步，那么不求用的思维，自然会建立起来；不求用对科研效率的提升，良性反哺科学的发展，自然会蔚然成风。反过来，**只有不求用的态度，研究者没有逻辑推演发展科学的能力，资助者没有逻辑推演评价成果的本事，不求用的态度只会鼓励灌水，产出真没用的水货。**\n\n<hr class=\"slender\">\n\n数学对自然科学的作用，定量化只是一个副产品。更重要的是作为逻辑科学的集大成者，发明/发现逻辑推演的规则，探索逻辑推演作为方法论的能力边界。一言以蔽之，欧几里德之后，数学已不只是“数字的学问”。\n\n至于费曼先生，他怎么可能不知道四大力学确实就是按照欧几里德式的，从基本定律出发的方式讲授的呢？面对一伙学普通物理的本科新生，说这种话实在有点骗小孩儿的嫌疑，怪不得那门课上到后来，本科生全都跑了。物理和数学的区别，在于理论和实验两条腿走路，但是理论的这条腿，实实在在地来自于超越了“数字的学问”的数学。\n"},{"slug":"my-teacher-mr-liu","filename":"2022-07-30-my-teacher-mr-liu.md","date":"2022-07-30","title":".doc | 柳师傅当上年级主任了","layout":"post","keywords":["doc"],"excerpt":"本文纯属虚构，请勿对号入座。","content":"\n> 本文纯属虚构。\n\n\n> 我怕你会读书吗？名校研究生都别想那么容易进我单位。这个人当年仗着自己会读书，看不起我们这种靠父母的，社会会教他做人。\n>\n> ——~~《史记·绛侯周勃世家》~~ \n\n刷朋友圈的时候，看到了园老师转载的一中公众号的宣传文章，随便点进去看了看，居然发现了柳师傅的名字，再定眼儿一看，已经当上年级主任了。回过神来，才发现自己高中毕业都快十年了。\n\n柳师傅是我高中的第一位语文老师，教到我们高二文理分班。他是13班的班主任，兼代我们14班的语文课。经过了新生报道的慌乱哦不忙乱之后，第二天早上第一节课就是语文。上课铃响老柳踩点跨进教室，于是来到了我最不擅长的人物外貌描写环节：老柳胖胖的，圆头圆脸，超短发平头，常年轮换几套显瘦的黑色运动服，上衣外套也多是圆领。黑框眼镜，浓眉厚嘴唇，望之忠厚长者，不似滔滔不绝……下笔轻浮了，抱歉抱歉。\n\n人不可貌相，柳师傅极其能侃，上课的主要内容就是侃。高中文言文多，老柳上课侃历史，堪比百家讲坛。只不过虽然没有实锤证据，字里行间总让人感觉他把梁启超和康有为俩人的名字和经历搞反了。年轻人找茬的第一集百家讲坛，又何必是百家讲坛……\n\n他不仅自己侃，还让我们侃。每堂语文课的前十分钟，让我们轮流上台讲一个成语，从字音字形到典故出处，顺便锻炼公共讲演。有人讲“刮目相看”，他说好，同学们，我们把月考的试卷拿出来，看一看最后这道阅读题，最后的剃头匠哈，哎，你们知道剃头师傅可以刮脸吧，知道哈，那你们知道还可以刮目吗？不知道了吧，以前东关城隍庙那条街，赶集的时候就有个老师傅，他的绝活就是刮目，就用刮脸的剃刀，在砂布上噌噌磨两下，然后扽起你眼皮儿，刷，刷，还没来得及打激灵呢，眼皮儿内侧的眼睑就刮完了，一个学期耳聪目明，舒服啊……\n\n讲《滕王阁序》，说到都督阎公想把自家女婿扶上马，送一程，没想到小王同志很不讲究，驳了主人的面子，还驳得这么漂亮。于是教我们打业务球——小王同志，假如你是今年新入职的老师，教职工篮球赛，对面李校长下场了，你要不要去防他，防他要不要放水？要不怎么说“世事洞明皆学问，人情练达亦文章”呢，有你们琢磨的。\n\n说到了打篮球，还是人不可貌相，老柳喜欢打球。入学一个月左右，两家班主任一拍即合，13、14两班班会课的时候来了一次篮球赛，柳师傅做裁判。我们班的体育特长生多，喜欢打篮球的也多，小马哥、大琛哥，各种哥可谓兵强马壮。开局两边各得了十来分了，我们这边的主力就不装了，一波得分潮接管比赛。柳师傅照样往返球场，吹罚也依然公平。下半场小马哥找了对方一个三加一，老柳果断吹哨，加罚投中，第二天上课的时候还在夸我们打得好，兴奋的劲头就像他自己打成的一样，说我们篮球联赛有夺冠的实力。\n\n篮球联赛在高一下学期，整个年级每班出一队。一中自诩“素质教育”，但啥是“素质教育”，咱也不知道，咱也不敢问，可能在要过高考独木桥的学校里，干任何与学习不直接相关的事情，就叫素质教育了吧。哎呦喂，哦不，anyway，我们一路过关斩将，来到了决赛，对阵10班。我们班主任小佟老师虽为巾帼英雄，终究不善骑射，所以老柳带着队员们赛前动员。最终我们以两分之差惜败对手，但是大家满脸都写着高兴。比赛结束之后回到教室，小佟老师很激动，说比赛结束之后全年级老师开会，她在会上说她为我们感到骄傲；还买了五大桶可乐和雪碧，给每个人倒了一纸杯，我们像独立团的战士喝酒一样闷下去了（没摔杯子）。小马哥说他哭过了，但是不遗憾，毕竟人少打人多。下周一的升旗仪式上，大琛哥拿到了最佳球员奖。放学回家的路上遇到了现在15班的初中同学一平，他问我你们班的那个最佳球员学习不错吧，我说你怎么知道，他没有接话。\n\n我高中入学的时候成绩不是特别好，语文尤其是。但是在老柳的感染下，发愤图强，对语文发生了很大的兴趣。期中考试的成绩还是不理想，于是立志每天晚上晚自习回家，做一道语文阅读理解，夜夜如此，直到高考。开始的时候完全不得要领，甚至急得要哭，到后来像中文房间里的猴子，勉强能找到点感觉了。半个学期之后，我的成绩有了很大进步，从年级三百多名进步到第十名；我们班整体也是，有的同学从一千名开外进了前一百名。高二的时候有一次考试，老柳讲评试卷时说，你们下课可以看看小山的卷子，虽然作文分数低了点，但是人家前面整个卷子只扣了一分，这叫什么，这就叫双保险啊，哪怕主观题发挥失常了，但是客观的语文能力是不会骗人的。\n\n唉，作文成绩是我学生时代一直的痛。也不是不想写，也不是没写好过，但就是分数低。正经人不写日记，柳师傅就要求我们每周写一篇周记，练作文。\n\n一中北校区的班号跟在南校区后面顺延，从9开始。按小道消息，一中的文理比例大约是1:2，所以不出意外的话，文理分科应该是我们两个班和12班一起。可惜，很意外地，文理分科的时候我们班并没有和老柳的班级一起整编，而是攀上了隔壁15、16班的高枝，班主任老熊带出了上一届一本率最高的班级。14班变成文科班，我来到16班。之后见到老柳就几乎只是下课时的走廊里了。之后的时间仿佛变成了可压缩流体，再浮出水面就是高考之后了。14班的同学们又聚到一起，请了老师们一起吃饭。老柳挨个桌子地转，来和我们说话。走到我们桌的时候问我，语文上130了没有，我说差两分，刚要说对不起老师，他抢先一步摆手，“挺好了！”\n\n<hr class=\"slender\">\n\n好像也就没什么了，确实没什么了，毕竟有的没的，都是不能再说的了。\n\n一中开学的时候分班名单贴在刚进门左手边的墙上，我看了一圈又一圈，几乎每个班都有初中同学的名字，除了13和14班。对，13和14班没有初中班里任何同学的名字，包括我的。看了一圈又一圈，每个班都没有，我被落下了。录取通知书都有，学费也交了，发票攥在手里，人吓傻了。回过神来赶紧钻出人堆，还好爸妈都还没回去，于是一起到年级主任办公室去，发现已经有好几组学生和家长在等着了。当时应对我们的是年级副主任青老师，用像亲戚唠家长里短时的埋怨一样，说我们太着急了，何必呢？我看我爸拳头已经硬了，赶紧自己上去介绍情况。青老师继续和蔼可亲地把我安排到了14班，因为班主任小佟老师上一届和青老师一起搭档，是一位年轻有冲劲的老师，教历史；和她搭档的是柳师傅，经验丰富又稳重，挺好的。\n\n我们14班是个什么水平呢？说放牛班有点不正确，因为按官方口径，一中没有放牛班。每个班都一样好，不放弃每一个孩子也一直是一中的宣传重点。但是呢，我的初中是分快慢班的，除了凭学习成绩考进去的，非富即官，没有一个在这个班；闲聊八卦的时候，得知班里分数不够要交择校费的大约占三分之二；入学后第一次考试的时候，我的数学和英语都有大面积的正确题目被误判为错，可能老师改卷也很辛苦，只能先做有错推定了；第一次期中考试，政治老师拿着我的卷子看了半天说不错，努努力可以考个二本。\n\n我的中考成绩不好，考前一个星期的时候，被班主任拉出教室去罚了一天的站，回来桌子被拖到教室的最后一排。原因是考前最后一次家长会上，班主任在上面讲话的时候，我妈和其他家长在下面“交头接耳”。回家之后和家里一说，听到了事情的另一个原因。说出来要负法律责任，要讲证据，那我就不说了。总之中考考得很差，刚刚够一中的分数线。其实熬过中考就很不容易了，考完之后整个人就像失了魂一样，每天坐在小区花坛边上唉声叹气。知道14班的情况后反而松了一口气，好学生我已经当够了，平平淡淡才是真。\n\n所以老柳很对我的脾气，知道我们的水平，不做过高的要求，那些文学典故，文士风流，完全是以一种“我觉得这些很有意思，应该让你们也知道”的心态在分享，能“指点江山”，“粪土当年万户侯”的文字，恐怕多发自“渔樵于江渚之上”，大概率不怎么激扬。但是小佟老师不一样，激扬得很，那时候《士兵突击》已经开始火了，但是很多同学还没看过，于是我们每天晚自习之前两集连播，绝赞连载中。但是这剧实在是太长了，新学校的新鲜感过去得差不多了，年级主任就以不务正业为由突袭取缔了该活动。时机倒也恰当，不久许三多就要回老家，和我一样消沉了。\n\n这样的我，期中考试不可能考得好了，但是成绩之差还是有一点戏剧性在里面：历史和化学试卷是两张八面大纸，结果我把第二张对折得太完美了，以至于做的时候以为是双面小纸，各有两面题目没做……结果消息传到初中同学那里，上学路上一辆捷安特三档变速直梁自行车呼啸而过，车上传来以前比我低一两个名次的“兄弟”的口哨声。原来我的平平淡淡才是真，是一件能给他人带来快乐的事情啊，我，操，你，妈。后面的事情前文已经写过了，阅读理解，牛奶加糖，睡觉，起床，冷水洗脸，妈妈做的早饭，黎明将至的青空。\n\n寒假里柳师傅给我爸妈打来电话告知成绩，因为一中讲素质教育，给学生分组指定了导师，我分到了柳师傅。为什么素质教育包括这个，咱也不知道，咱也不敢问。总之柳师傅很高兴，像是好多年没见到这么好的学生了。过完年返校发奖状，三好学生、学习标兵、学习进步奖。全班第一拿了学习进步奖，小佟老师说完，还有些暖烘烘懒洋洋的教室一瞬间安静下来，14班变了。二年级，我们攀上了隔壁15、16班的高枝，走班一段之间之后，再见到老柳就只能是下课时的走廊里了。\n\n但是有些事情还是没有变的。分班去到16班是第一天的晚自习，课间休息的时候，后来知道是叫浩哥的一位活泼开朗的同学来跟我们说话，让我们好好学习，有不会的问题可以问小惠，就你同桌的同学。我赶紧点头称是，旁边的琛哥和韦哥没有说话。篮球联赛的决赛，我们差两分追平的防守回合，球贴着小马哥出界，裁判判定球碰到了小马哥的球衣。第二天柳师傅讲“冯唐易老，李广难封”，说的是有些人年轻的时候要论资排辈，领导让你给长者让让路；等到自己磨砺出一身本事了，领导又喜欢活力有为的年轻人了……直到高三，学校开的自主招生辅导班的入班资格还要和中考成绩挂钩。\n\n本地的微信朋友圈，每隔一段时间就会出一篇文章，批评一中成绩不行，收着全市的好学生，结果高考清北几年出一个，然后就转到抓纪律加作业上面去了。一中的老师们就在朋友圈里反驳说一中搞素质教育问心无愧，一中的同学们就说母校就是你每天骂八百遍，但不许别人骂一句的地方。我也不知道该说什么，但是柳师傅升职总是个好事吧。\n\n于是给园老师的朋友圈点了个赞。\n"},{"slug":"taile-celebration-of-life","filename":"2021-09-23-taile-celebration-of-life.md","date":"2021-09-23","title":".doc | 泰勒的追思会","layout":"post","keywords":["doc"],"excerpt":"距离开学还有两周的星期日深夜，临睡之前瞥了一眼手机的邮箱，看到一封来自系主任的邮件。标题只有两个词 “sad news”","content":"\n距离开学还有两周的星期日深夜，临睡之前瞥了一眼手机的邮箱，看到一封来自系主任的邮件。标题只有两个词 “sad news”，下面的一行摘要里有维教授的名字，心下一惊。点开邮件全文，教授的儿子泰勒因为抑郁去世。\n\n维教授是我们系生物方向的四人组之一，主攻神经科学。我们入学那年，他的课题组正从实验向理论方向转型，需要新人手。当时我已经有中意的课题组了，但是抱着多听听也没坏处的想法，也参加维教授的组会，一起听的还有陈豪和一个伊朗女生，以及本科生松岩。感恩节的时候，维教授邀请生物方向的所有老师同学和家人到他家聚会，席间老师的孩子们在一起玩，泰勒就在其中吗？\n\n转过天来，系主任又转发了来自维教授的消息，通知大家泰勒的追思会在周四下午举行。转发的时候，系主任还请大家到系办公室，留言向维教授一家致哀。地点细节若干，唯一印象深刻的是对追思会的用词—— \"celebration of his life\"。\n\n当时已经决定要参加活动，但是放眼衣柜，没有合适的衣服。于是周一下午去村中心的商场购物。上衣很快选定了一件纯黑色长袖衬衫，因为很少逛商场于是顺便买了一件深蓝色同款。裤子在同一个店试了几条，总觉得不如衬衫的颜色正。于是去了隔壁的一家西装店买了一条西裤，各方面都好，除了价格。还想买一件白衬衫，试了几次尺寸，发现店家已经准备关门了，出门见天光依然大亮，才知道疫情给生活带来的变化远不止于口罩。\n\n第二天和导师线上见面讨论了一下研究进度，顺便问了下葬礼的着装要求。导师回答说尽可能正式，于是上网搜了一下，说是黑衬衫不太合适，于是再次去购物。白衬衫黑领带口袋巾不说，来回试了几件西服外套，猜了猜尺码的意思，在肩宽和袖长之间找了个平衡，然后去买鞋。在我连续问了几款鞋子有没有黑色之后，鞋店大妈问我，你是想买自己喜欢的鞋子还是只要黑鞋子？我一听这是打算教我做人的道理了，于是诚实地说黑色就行。大妈中断片刻后继续施法，还是教育我说应该买我喜欢的鞋子，然后指给了我隔壁的百货商场。\n\n为了进一步防止着装出问题，于是想到了陈豪，问他要不要一起去，然后商量统一着装。于是周四下午，对着网上的教程打了个半温莎结，然后开车接上陈豪，前往教堂。\n\n我们到的时候已经有不少人在了，教堂大约由三个正方形空间并排而成，入口在中间一个大厅，进入后左侧是礼拜堂，右侧布置成了一个餐厅。维教授和夫人站在中间大厅靠近礼拜堂的一角，身旁地上撑着有一幅等身高的画像，画中一个少年挎着一个篮球，身着比赛服。大厅内的访客排成一个回环的长队，在访客名册上签字，再依次问候教授一家。系秘书萨拉和图书管理员艾莉森和我们几乎同时到，于是我们一起排队。环顾四周，发现我和陈豪两人穿得已经算是很正式了。现场的年轻人很多，白衬衫黑领带者多，穿外套者少；年长者则更不正式，衬衫不必纯白，鞋不必正黑，甚至有老者穿浅色套装。维教授一身黑衣，领口一个白领节。\n\n队伍前进很慢，我和陈豪就跟萨拉和艾莉森闲聊。我不太懂这种场合该聊什么，聊着聊着就聊到了我导师最近申请下来的一个大额研究资助，聊到了我们两个人打算什么时候毕业，倒也不是十分严肃。见到维教授的时候，也就是很普通地寒暄了两句，维教授的夫人还记得四五年前感恩节聚会的情形，感谢我们来参加这个仪式。我又代已经回国的松岩向教授致意。\n\n已经慰问过教授的访客分散在中央大厅里交谈，我们认识的人不多，回头看见唐学长和维教授之前的学生詹森一起排队，我们就返回队伍和他们聊了一会，依然是主要关于各自未来的打算。詹森有了孩子，现在为了奶粉钱又兼职了一家科技公司的远程工作；唐学长准备毕业，打算去纽约的医院找一些医学研究类的工作。齐学姐已经去了纽约的实验室，托唐学长带了一个花篮，和其他花篮一起摆在大厅中间的一个小桌上。今年新进入我们系的两位中国老师也来了，毕竟学生和老师之间还是有隔阂，我们没有去和他们说话。系主任和夫人来的较晚，带了一个小姑娘，不知道是女儿还是孙女。\n\n系主任到时，很多访客都已在礼拜堂落座，我们想找地方时礼拜堂已满，教堂在中间大厅靠礼拜堂左半边摆了七八排椅子，椅子上摆了一个小册子。我和陈豪相邻坐下，身旁是一对夫妻，男士是维教授曾经的学生，现在在医学院工作，和陈豪握了握手。女士坐在我身旁，仪式还没开始，就可以感觉到她在啜泣。大约维教授的亲学生，每年都会去教授家做客，应该是看着泰勒长大吧，就像我看导师家的孩子一样。\n\n新牧师上台，声音从礼拜堂门上方的一个小音箱传来。带领大家冥想之前说，他知道今天到场的人并不都信仰同一个上帝，大家可以把他说的神替代成自己信仰的至高。于是开始冥想，牧师引用了圣经、伊索和多萝西·代伊，声音流利温和。祈祷之后是合唱圣歌，歌词在小册子上，我不知道曲调，只能默默地听。我们右前方靠中间走廊的座位有一位女士，声音洪亮，不知道是平时的积极分子还是教堂安排的领唱。\n\n然后是亲友上台追忆泰勒的生平。最先上台的是泰勒的舅舅，两三句话之后泣不成声，一个劲地说他爱泰勒，爱所有人。之后是泰勒从幼儿园到高中的好朋友，回忆了和他一起玩的种种，一起在高中篮球队时对泰勒的受欢迎的羡慕。还有篮球队的教练，高中新认识的亚裔朋友，说他是怎样默默地关注着身边的每一个人，用最自然的方式把他们拉入谈话，让他们能够在一个集体中感到被接受。一个女孩子登台，中学的周末，两个人对家里说谎后去约会吃饭，然后在餐厅遇见双方的家人……她知道今天到场的这么多女孩子，几乎所有人都和她一样喜欢过泰勒，他值得这样的喜欢。\n\n又唱了另一首圣歌，牧师再次登台，说自杀让人困惑，安静的会场沉入了更深的安静，我们不理解，神还有很多安排让我们不理解。小册子的最后有关于自杀救助的热线，建议大家都记到自己的手机里。\n\n仪式结束后，想留下来陪伴家人的访客可以去旁边的大厅用餐。我们不知道礼数，于是问詹森和唐学长，他们都不打算留下，于是我们也一起离开。开车一路东行，后视镜一片眩目，夕阳薄暮，晚霞如血。\n\n开学前的一个星期是迎新周，作为研究生教学主管，维教授依惯例需要在迎新会上讲话，向研究生新生介绍项目教学计划。迎新活动的主办方是高年级学生组成的 mentor committee，committee 的头儿安鲁写信给卡教授，问他愿不愿意代替维教授出席。卡教授回复说他已经问过了，维教授觉得自己还能正常履职。作为 committee 的一员，维教授讲话的时候我也在场，介绍十分顺利，只是在教授对着幻灯片的一处幽默的时候，我不知道该做什么表情。\n"},{"slug":"summary-of-this-blog","filename":"2021-02-10-summary-of-this-blog.md","date":"2021-02-10","title":".doc | 口嫌体正直的年末总结","layout":"post","keywords":["doc"],"excerpt":"元旦的年度问卷也就图一乐，真总结还得看春节","content":"\n“一颗小小的蓝色行星，又绕着它的太阳转了一圈。”这是科普作家 Ent 的公众号今年元旦更新的标题。我还看过这个句子更富丽堂皇的版本，还多了什么总星系什么银河系的啥啥悬臂之类的科学术语，虽词藻相殊，其志一也，都是说我们觉得值得暂停回顾的一段时空，不过是更广阔宇宙里的沧海一粟。\n\n确实，年不是一个纪念的好理由。从周期性的角度来说，虽然这是地球公转一周的周期节点，但太阳也在绕着银心旋转，今年的地球和一个恒星年以前的地球并不处于相同的位置；另一方面，我们生活的节奏也不再以年为单位了，今天绝大多数人已经离开了春种秋收的农耕生活，投入了基本在工业时代定型的生活模式，学生的生活阶段基本上是由升学划分的，小学两个三年，初中三年，高中三年，大学虽然有四年，但是最后一年吊儿郎当，懂的都懂，最关键的是，这种划分是别人替你决定的，你并不需要做什么，也做不了什么。\n\n如今不同了，虽然依然是学生，但是距离毕业，然后彻底结束学生身份的日子越来越近了。其实博士前两年上完必修课，时间上的自由度就很大了，如果完全放任追求即时的舒适，时间的流失真的超乎想象，过去的一年大家应该都收获了很多例子。因为有太多的时间可以利用，我又的确不是一个喜欢和善于把精力集中到一个方向的人，于是开了公众号，还学了一点 HTML+CSS+JS、了解了一点 jekyll， 在 Github Pages 上搭建了一个博客。\n\n对，公众号和博客，终于让我给圆回来了，我们回到正题……之前再稍微跑题一下？早在上高中的时候，晚饭到晚自习之间的空闲里，我基本上也都在教室拉着朋友胡侃，指点江山，于是经常被问道：“你聊这些有什么用，有这时间多刷几道题不好吗？”现在写公众号和博客，都用不着别人问，我自己都很有负罪感，有这时间，多读几篇论文不好吗？\n\n所幸咱的脸皮够厚，能够脸不红心不跳地指出来，这是一种非形式逻辑谬误，名叫“假两难推理 (false dilemma)”，不干这些不务正业的事情省下来的时间，往往也没办法全都用在所举例的正事上，而绝大多数都用在了比之前不务正业更没有质量的娱乐当中——人的精力是有限的，沾床就睡只是精力耗尽一种表现，还有一种就是眼睛睁着，却像行尸走肉一样什么都做不下去。稍微分散一点精力，把精力放在有兴趣的地方，可以延缓精力的耗尽。我这样的人，在高考这样需要血拼到最后一丝精力的游戏规则里不会有什么太大的出息，我知道、理解、接受这种规则的结果，但是没办法认同规则本身。\n\n另外，所谓的没用，往往只是不知道有什么用。觉得没用就不学，等到发现要用的时候，也就是发现自己来不及学会的时候。在目标明确的功利主义者的常年内卷之下，兴趣者依然没有被淘汰，除了进化的速度不足以在短期内产生足够效果之外，更是因为兴趣带来的技能积累，以及觉得好玩就可以学的开放心态，还有在这过程中锻炼出的学习能力和执行力，使得兴趣者并不比功利者有太大的劣势，如果你能在内卷中幸存下来的话。\n\n## 弃号重练的旧事\n\n从时间线上来说，\n\n- 2017年中，公众号发出了第一次非原创的测试性推送，是《诗经》的《鹤鸣》篇，之后长期沉寂。\n- 2018年中，接近一年之后，第一次发表原创内容，胡侃为主，有一点点收割韭菜的动机，贩卖一点带有小确丧的焦虑，目标对象是比我爸妈稍年轻一点的，孩子还在上高中的父母。;-)\n- 2018年末到2019年初，初步搭建好了个人博客。\n- 2019年中，翻译《为什么说物理不是一门学科》，事后看来这是一个很大的转变，在这之前，是“哎，我有一个博客，我得写点什么放到上面”，之后则是“我写了写这个，哦，这个东西可以放到博客上去”。\n- 2019年8月24日，翻译了保罗·格雷厄姆的《How to disagree》，这是这个博客阅读量最高的一篇文章，也是为我在微信平台上收获最多关注者的一篇文章。\n- 2019年末，听说了 Matters 博客平台，开始在博客、微信、Matters 同步上传自己的文章。中间短暂地在豆瓣和 Bilibili 上同步过，但是数据太差，自觉不值，放弃了。\n- 进入2020年，空闲时间多了起来，开始下决心一月一更。\n- 进入2021年，没有下任何决心，但是似乎有能力一月两更了。\n\n但其实，~~高墙之内埃尔迪亚人的记忆是被第145代王篡改过的~~，目前这个公众号是我注册的第二个号了，在这前面还有一个，是本科期间注册的。当时找了一群高中时候玩的不错的同学，准备像地下刊物一样一起写点东西。事实证明，玩的不错和志同道合之间还是有点距离，想法和付出努力之间也有点距离，努力和收获之间更有很大一段不在自己掌握之中的距离。\n\n结果那个号的整个生命周期里，写字最多的是被我剥削无偿劳动的我爸，为了维持周更，我开始每周写一篇德甲的战况综述，不仅是没有专业背景的过家家，而且改变了整个公众号的内容定位。于是大约一年的时间，数据太差，自觉不值，放弃了。（好眼熟）\n\n## 总结和展望\n\n今天回头总结这段失败历史，我觉得以下几个选择很重要：\n\n### 实名 vs. 匿名\n\n这里说的实名和匿名，指的是在前台，读者和观众是否知道作者是谁，头衔身份几何。后台匿名是不存在的，所有在大陆司法管辖范围内的内容平台，注册账户的时候，个人信息就全交出去了，有点什么事，用伏拉夫的话说，“马上就到你家门口”。\n\n实名的话，一个典型的好处就和微商一样，可以利用你已经有的交际圈，在刚刚起步的阶段就收获一群关注者，拿一个对新人来说很不错的阅读量。坏处也和微商一样，这种红利会随着时间的推移迅速衰减，熟人的转发很快就会变成人情上的亏欠。而且既然熟人在，聊些有他们出现的故事自然就会考虑他们的感受，写出来的东西要么是朋友之间互相吹捧的肉麻之作，要么是炸翻友谊小船的低情商雷管，如果都不是，那就恐怕逃不出“人在蒙古，刚下航母”的自吹自擂。\n\n实名的另一个好处是各种头衔带来的光环效应。《How to disagree》中已经提到了，依据说话者的身份推断可信度和含金量，这其实算是一种诉诸人身谬误 (ad hominem)，但这招确实是管用，毕竟判断对错是需要背景知识的，很多事情读者掌握的唯一相关知识就是作者身份了，那还怎么批判接受理性思考呢？不谈说服力，就只考虑班门弄斧贻笑大方的威慑，也能让很多质疑和辩论的语气缓和很多。\n\n现在这个博客和公众号，除了父母，就只有极少数趣味相投的朋友知道，而且基本上都是自己看出这些文章是我写的，没有强买强卖的现象。之前偶尔转发到朋友圈，不可能没有其他人看过，但是既然看了又没有表示，那也就算了，毕竟年纪大了，知道世界广阔，朋友不可能在每一个方面都玩到一起去。不谈头衔，能检验我言论对错的就只有逻辑和作为论证起点的三观和客观事实，这也能督促我检视自己文章的严谨性，排除很多杂音和不理性的粉丝情结（哎哎说粉丝也太不自量力了吧）。\n\n### 平台 vs. 自立 \n\n前面已经说了我在自己的博客之外，还曾经在B站和豆瓣同步，现在依然在微信公众号和 Matters 同步。虽然严格来讲，我的博客也不算自立，是依附于 Github 的服务，但其毕竟不是一个专门的博客平台，需要作者上传构成一个网站所需的各种源文件，姑且算是在大平台提供的方便性和个人的独立性之间取得了一定的平衡。\n\n据说微信一篇文章的绝大多数流量来自推送后的48小时之内，但是后台看数据的时候让我很吃惊的是，不少微信公众号上关注我的朋友，绝大多数都是来自“搜一搜”，绝大多数来自《保罗·格雷厄姆谈如何反对》一文，都是文章推送之后很久关注的。像微信这个体量的产品，可能推荐算法稍微一个概率的调整，就超过我这种内容小贩苦心孤诣引流的努力。\n\nMatters 和 B 站的推荐算法客观来讲和微信有差距，而且 Matters 的用户数量比微信少太多了，Bilibili 的主业毕竟是视频而不是文章。但是两个平台所形成的社区的氛围都很不错，在 Matters 上活跃的大多数自己也是写作者，所以我的关注数和被关注数差不多，评论互动也最活跃；Bilibili 的年轻人比例很高，不谈意识形态的话，对于新事物的兴趣和接受程度远高于社畜。\n\n至于豆瓣？呵呵。\n\n### 单干 vs. 合伙\n\n上一个公众号的最大失败就是一厢情愿地把朋友们拉了进来。毕竟本科的时候足球赛、CUPT、建模美赛，各种活动班里的同学说组队就组队了，说通宵就通宵了，完全不食人间烟火，没有意识到这种默契是建立在那些共同目标可以为所有人带来利益的基础上的，虽然这个利益更多的是无形的荣誉。和我一起写文章，能给我的朋友带来什么？用爱发电，这种事情最多是用来追求自己的兴趣，况且即便是自己的兴趣也不必跟钱过不去。所以这次，既然我没有回报朋友的能力和精力，博客和公众号的一切都只与我自己有关。\n\n### \"干货\" vs. “私货”\n\n简体中文里，“干货满满”已经成了绝对的褒义词，“夹带私货”是攻击对方的重要借口。去掉感情色彩，干货基本上约等于对事实的陈述，私货约等于对观点的表达，陈述和表达真的这么明显的高下之别吗？更何况在这个时代，我们不是缺少信息，而是被过量的信息淹没过载，缺乏处理和利用信息的能力。在一个人的观点中，我们可以看到他处理信息的方式，看到不同信息在他眼中的逻辑关系，最终管窥他的知识结构和三观，这是远比头疼医头的“干货”更有意义的信息。\n\n授人以鱼不如授人以渔，我没有能力写出一本钓鱼书，但是记录自己挂饵挥竿的过程，也比单纯的画一条鱼更有意义。\n\n### 我 vs. 我\n\n以上总结纯属放屁，完全是站在今天回望过去的马后炮，有着归因谬误的巨大嫌疑。这个号相对于上一个号最大的区别，就在于多吃了几年饭，多过了几座桥——这不是倚老卖老，几年摸鱼姑且折腾出来一些技能，两年研究生课程学到的东西确实不是当年那个幼稚的本科生能比。我能输出比当年更高质量的内容，是因为我变成了一个比当年更高质量的人。\n\n更重要的是，我的价值观更加坚定了，我知道自己写的东西水平如何，不需要阅读量、Likecoin 数来替我估值，豆瓣上发的东西没人看，那就去他妈的。我上不了更好的大学，申请 PhD 没拿到更好的 offer，这不是我单方面的损失，只要我继续努力，就有希望变成“这不是我的损失”。\n\n我对现在的博客和公众号的内容不满意的地方也有很多。一是连载不够多，没有输出更成体系的知识；二是曲高和寡，最近的非平衡态物理笔记，很明显没有让人看懂的意思，将来应该补充更基础的入门知识。更重要的是，现在文章的互动和反馈几乎没有，我哪里写的不好，很少收到来自读者的直接批评。\n\n## 正题：发红包！\n\n所以，希望已经关注的朋友，在将来的推文里多留言，批评反驳都没问题，毕竟翻译过《how to disagree》的人，不应该见到批评就炸毛。也欢迎大家把觉得不错的文章转发给几个志同道合，觉得可能会喜欢的朋友，毕竟批评的人多了，问题才更容易暴露出来。每篇推文里都来这么一段广告实在是太煞风景，这里一次性地拜托了。\n\n还是上一个号的时候，自己哼叱哼叱地坚持了很久之后，终于有朋友看不下去了，像红三连五班可怜许三多一样告诉我：“你难道不知道公众号的流量是要花钱的吗？”我当时也很许三多地回答，我希望大家是因为内容而不是薅羊毛而来看我的文章。现在看来的确幼稚得很，不是因为这句话本身有什么问题，而是当你没有拿出真金白银的时候，是没办法证明自己不是穷酸还嘴硬的。\n\n所以趁着过年，准备了总计 200 元的红包（小程序上限就是 200），分成 6 个，放在了这篇文章微信版的末尾，大年初四迎灶神的时候开奖，祝大家好运。\n\n本来想根据互动点赞之类的数据来分红包的，但是一方面微信小程序好像没这个功能，另一方面各个指标都没有没有竞争的价值。每一项都是 hk 兄弟遥遥领先，等疫情过去了，一定请你吃饭。\n\n在 B 站上，曾有一个朋友每一篇文章都读过并且点赞，希望你能看到这篇文章，也祝你的运气比别人更好一点点。\n"},{"slug":"matters-yearly","filename":"2021-01-09-matters-yearly.md","date":"2021-01-09","title":"【2020Matters年度问卷】Normality Matters","layout":"post","keywords":["doc"],"excerpt":"原文于2020年12月28日首发于 Matters，当时在赶平台奖励的截止日期，所以很多东西没有展开写，大家凑合看吧。","content":"\n> Matters 是一个博客平台，在前几年区块链和去中心化思想还很热的时候上线，底层所有的博文会上传到 IPFS 区中心化平台，账号可以绑定一种叫做 LikeCoin 的数字货币，用来赞赏作者。2019年11月28日，我在 Matters 上传了自己翻译的 Paul Graham 的《How to Disagree》，算是正式加入了 Matters 社区。在那之前，我虽然建立了自己的博客(https:mountaye.github.io/blog)和公众号，但是一直没有规律性的更新。可以说，过去一年所有的不务正业，都可以以 Matters 为线索串联起来。我一向不擅长赶 deadline，所以压根没做周年纪念的打算。结果发现 Matters 官方有红包，没办法，只能为五斗米折腰了。\n\n## 2020年只剩下最後十天，分享一件在年初想不到今年會發生的一件事？這件事對你的生活帶來什麼樣的改變？\n\n美国股市对新冠大流行的 V 形走势。标普500指数从2月中下旬开始跳水，用了一个月的时间跌去三分之一，然后开始了大牛市一样的攀升，八月底重回疫情前的高点。\n\n2018年1月份，我的开户申请被 Robinhood 批准，从此成为了美国股市里茁壮成长的一棵小韭菜。结果就在开户的那周，美股就开始下跌。\n\n那时候人们开始说，十年一个小周期，到了崩盘的时候了，结果涨涨跌跌地拉锯了几个月，创出新高；十月再次开始大跌，也就是段子里讲的10天4次熔断那次，那时候人们又说，十年一个周期，出来混，到了还的时候了，结果这回更快，只用了四个月就收复之前的高点；如今，已经没有人再说十年啊周期啊什么的了，YouTube 上的雷公视频的标题，也从“市场进入高危期”变成了“急跌就是买点”。\n\n“热闹是他们的，我什么也没有。”不只是没有的问题，我还在这期间花了很多仓位做空，兜兜转转，不断跌破止损线，累积下来，损失了大约一个月的工资。\n\n要说这对我生活的改变，可能是……让我最近两个月没有文章更新？不断的亏损之后痛定思痛，觉得问题主要出现在记账方面。之前和股票相关的账目都是用一个 MS Excel 电子表格记录，虽然自认为还算准确完备，但是一方面只包含了自己的已经发生的交易信息，另一方面数字也不如图形直观，很难给将来的交易决策提供帮助。\n\n因而，我决定把记账这件事转移到 Jupyter Notebook 上，完成 Excel 表的功能之外，还可以把自己的买卖价位和股价走势画在同一张图上，把自己的仓位和市场的交易量画在同一张图上，辅助决策。同时还可以练习 python 数据可视化的能力、`ipywidgets` 组件写 UI 的能力，一举多得。所以最近一段时间的业余都在忙这件事，博客也就暂时停更了。\n\n## 2020年，什麼事情讓你獲得最深的意義感？\n\n定期用无人机空拍校园。这件事刚刚付诸实施，每月选一天，沿着相同的线路拍一段延时摄影。预计明年的这个时候才会有结果，所以严格来讲不算是2020年的事情。\n\n定期是一种获得意义感的很有效的方式。高中的时候，我们学校的几个老师和同学们办了一份报纸，每周三晚自习前免费分发几十份给每个班。高三一年的每一期报纸我都集齐了，每个周三，我都在学校食堂暴风吸入晚饭，然后跑回教室等发报纸的同学。一年下来，攒下来的报纸对折起来，几乎和课桌的抽屉一样厚。人非星辰大海，没办法占据无限的时间，但是周期性的事件序列，具有时间上的平移对称性，周期函数的自变量是可以趋向无穷的，给人一种对于永恒的近似和安慰。\n\n摄影也是。像我这样的人，可能没办法给学校捐个楼，把自己的名字刻在楼基的石碑上，但是在这里学习和工作的经历，还有校园的景色，“耳得之而为声，目遇之而成色，是造物者之无尽藏也，而吾与子之所共适。”\n\n## 全球疫情依然嚴峻，請記錄一件你認為值得銘記的疫情事件。\n\n11月初的年度进展报告。从去年夏天的资格考试通过之后，每年11月初，我们都要向导师委员会汇报自己这一年的工作进展。今年的报告结束之后，第二天和老板单独 Zoom 的时候他表扬了我，说今年的进展依然不错，委员会的成员都印象深刻。\n\n我现在的工作主要包括两部分，一部分是用我们老板做博士后的时候用的成像方法，去观察和他当时的工作稍有不同的细胞，属于“承上”；另一部分是“启下”，因为旧的方法在性能上不足以研究更复杂的系统，所以需要开发新的图像处理技术。\n\n美国的疫情从2月份开始，那时候我刚刚拍了一些用于开发新技术所需要的参考图像，所以封城令最严格的几周有可以在家工作的素材。夏天限制条件放松之后，我又回到学校用旧方法拍了很多照片，这些照片在进行数据分析之前，需要在计算机集群上进行做“去卷积”计算，比较耗时，但同样可以在家做。所以今年的工作节奏，实际上并没受到病毒的太多干扰。\n\n但是我也知道，这种印象深刻的另一面是，在今年以前的我的工作效率，也没有比有疫情的时候有多大的优势。之前工作也有很多时候摸鱼，我也不会加班，业余时间也在折腾自己的爱好，简直约等于不务正业的同时顺便读了个博。疫情把“我们所浪费的时间本质上都是自愿选择的”这一点放大了，\n\n## 2020出行受限，如何改變了你與他人/世界的關係？有沒有什麼人/事，是疫情過去你一定要去見/做的？\n\n恍然发现原来自由出行也可能变成一种奢侈。\n\n疫情之后，我想我会成为一名 B 站的 up 主，像 Youtube 上的 Thomas Heaton 一样，到处走走拍拍，用拍视频这件事来鞭策自己，注视自己可能来之不易的日常，并珍视对这些日常的记忆。\n\n## 說一件你在2020年遭遇的、難以解決的矛盾，這裡的矛盾是指：你感受到自己的信念與行為產生了衝突。\n\n自视清高和渴望吸引眼球的矛盾。\n\n明知道在任何平台写东西，用真名挂各种头衔会多很多流量，但还是用化名，努力避免 ad hominem 谬误；明知道在 Matters 写东西，用简体字没有流量，不谈政治没有流量，不做赞赏公民没有流量，也还是坚持下来了；明知道在微信写东西，膜蛤可能会死，借古讽今可能会死，点了关注的读者可能再也没看过我的更新（微信信息流的锅），但还是在危险的边缘疯狂试探。\n\n## 分享一個你「忽然理解了我所反對的立場」的時刻。\n\n没有，而且我觉得也没办法有，“忽然”、“理解”和“立场”本来就不应该出现在同一个句子里，你要是真的能理解，那早干什么去了？\n\n公共讨论中的绝大多数问题并不是因为拒绝对话，而是急于对话，把根本不成立的对话强行推进下去，结果就是鸡同鸭讲，各自在自己的信息茧房里赢得一片掌声，然后一个共识，各自表述，直到其中一方得意忘形进入了对方的同温层，再开启一轮循环。\n\n## 相比一年前，你與身體的關係發生了什麼變化？你有更喜歡現在自己的身體嗎？\n\n老了，虽然我才 20 多岁。\n\n天冷的时候跑步，膝盖就会疼。刚来学校的时候，参加系里的老教授们每周踢足球的活动，还笑他们冬天休赛期太长，现在只能摸着自己的膝盖感叹自己还是 too young too simple, sometimes naive. 小时候练羽毛球，从场中央来到网前需要两步，退到底线需要三步；现在一步半就到了，但是再也不敢跑折返了。\n\n当然，作为一个减肥成功的胖子，我经历过更难受的肥胖状态，我对今天的身体已经足够满意，不敢再奢求更多。\n\n## 經過2020年，你內心是否有找到一個關於自己，不可停止之事嗎？\n\n认识自己——不断修正对自己的认识，并且证明这种认识。（你现在还认识“认识”这两个字吗XD）\n\n## 請與我們分享你在 2020年最常聽的一首歌、最愛的一本書或者印象最深刻的一部電影\n\n戈德门特《代数学教程》。\n\n## 最後，能否請你用一張照片代表你的 2020 年。\n\n![](/photos/2021-01-09-matters-rainbow.png)\n\n## 填空：2020，<u>normality</u> matters\n\n好像真的赶不上 deadline 了，后面几个问题越来越敷衍……应该不影响拿红包吧（小声）"},{"slug":"doc-share-experience","filename":"2020-10-31-doc-share-experience.md","date":"2020-10-31","title":".doc | 经验介绍会","layout":"post","keywords":["doc"],"excerpt":"大三的时候，我们高中的班主任找到我，问我想不想回学校，给学弟学妹们介绍介绍经验，加油鼓劲。","content":"\n> 本文为虚构。\n\n大三的时候，我们高中的班主任熊师傅找到我，问我想不想回学校，给学弟学妹们介绍介绍经验，加加油，鼓鼓劲。我当时直接傻了，没开玩笑吧？\n\n高三那年的清明假期，我们年级别出心裁，趁着已经上了大学的学长们放假回家，而我们还在学校自习的机会，把他们请回来，开个主题班会，和大家近距离地见见面，给我们介绍经验，加油鼓劲。\n\n我们年级当然有这样的底气。我们这样的十八线小城，一中那时北大清华还不是每年都有的，三年前的这批老师，一年教出了两个北大，老熊当时的班级，是全年级一本率最高的。我们这一年又是第一次推行北大校长实名推荐制度，校长为了给北大一个好印象，选中了本来上北大就没什么问题的年级第二，所以一场高考大捷已经十拿九稳。只不过年级第一有点不高兴，为学校实现了数学奥赛零的突破之后，赌气一般地直接和上交签约了。显然，这只是学校从一个胜利走向另一个胜利过程中的一点小小杂音，不足为虑。在这次经验介绍会之前，年级主任即将在高考结束之后升任副校长的传言，就已经在晚饭时段的闲谈中流传开了。\n\n听说这个的时候，我的心里很不以为意。不以为意很正常，十八线小城里的优等生，高考之前瞧得起谁呢？但还不那么简单，主要是因为同样的戏码，初中的时候已经看过一遍了。\n\n初中不幸，误入一个作业极多的学校。多到什么程度呢？我们入学的时候接近70个人，毕业之前转学走了12个。除了1个去东北的高考移民，剩下11个人都是转到了本区的其他中学——为啥？累的啊！什么996，什么福报？Too young too simple! 互联网大佬们啊还是要再学习一个，学不下去怎么办，打鸡血啊！开学一个月左右的时候，班主任请来了刚刚以全市第一名考上一中的学姐，还有另外两个学长，回来给我们介绍经验，加油鼓劲。\n\n温柔美丽的学姐和学长们如约而至。有一说一，这场经验介绍本身还是很成功的。一上来，学姐抚今追昔，指着教室中间一位漂亮可爱，马尾长辫黑又亮……咳咳，不好意思油腻了，指着一位女生说，当年她就坐在同样的位置。轻轻一番话语，就拉近了我们和学姐之间的距离。然后学习经验整理得井井有条，用排比的方式，介绍了课前认真预习、课上认真听讲、课后认真复习三大法宝。学姐还有一个姐姐，也曾是全市第一上一中，今年刚刚被北大录取，只要你足够努力，北大也在等着你，耶！作业多怎么办？这就是请多位学长学姐来的好处了，曾任语文课代表的学长站出来非常有斗争经验地说，你们课代表可以给老师求求情啊，老师又不是那么不近人情的人啊（班主任是语文老师）……总之，学长学姐学习成绩优异，人物形象丰富，总有一款你的菜。放学回家的时候，我骑车到路口，学姐站在不远处等公交车，牛仔裤，白衬衫，晚夏的风向后吹起了她的长发，哇，美！\n\n然后呢，作业还是他妈的多，撑不下去的同学开始转学。爸妈实在看不下去了，开始帮我写作业，期末最累的时候给我请病假让我在家补觉。\n\n班会开始之前大家的笔都没有停。老熊走进教室，看了一会自习，看了下门外，对我们说：“来，差不多了吧，让我们有请——”平时吱吱呀呀的塑钢门被很有礼貌地推开了，一位穿衬衫的干净男生走了进来。老熊作完介绍，学长的 PPT 也准备好了。一上来，学长抚今追昔，指着教室中间一位玉树临风的男生说，当年他就坐在同样的位置。然后……然后不是学习经验三大法宝了，但是究竟说了什么我也不记得了，记忆就是这么奇怪，久远如初中的事情还历历在目，后来的事情却朦胧不清。只记得他问了几个问题，我们给出了让聊天无法进行下去的尴尬回答。然后学长开始介绍山大的校园，讲到了自己正在领导的学生会部门，幻灯片上是学生会的照片，学长的旁边站着一位美丽大方的学姐。“这个嘛，工作上的同事。”学长解释时露出了微笑，男生们在意味不明的“哦”之后在微笑和大笑之间猥琐地笑，此刻写下这些文字的我自嘲地笑。\n\n几个月后的高考成了整个年级的滑铁卢。我的全校排名仅次于某次超水平发挥的期中考试，但总分依然比平时低了二三十分；北大校荐的同学加了六十分后依然不够被录取；全市第一名是一位补习学校的复读生。当然了，喜报还是发在了市里的报纸上，毕竟一本过线人数再创新高。只不过新任副校长人选是兄弟年级的主任，上大学后看学弟们转发的 QQ 空间里的动态，英姿勃发的校长一夜之间头发全白。\n\n写到这里的我实在是写不下去了，写这些干什么呢？是想幸灾乐祸吗？不应该，这样一场溃败，每个人都是受害者，我也并不置身事外。是想咀嚼一番回忆的苦涩吗？不存在，高考的成绩不是十分理想，客观上减轻了我在大学时竞争的激烈程度，让我得以进入第一志愿专业里一个不错的班级，交换生出国，奖学金，我的四年大学生活没有什么遗憾。\n\n退言思之，可能我想说的是，滑铁卢并不是拿破仑一个人的滑铁卢，真正承担伤亡的，是一个个籍籍无名的普通士兵。拿破仑尚且还可以在偏远孤僻的小岛上了此残生，内伊元帅甚至可以慷概骄傲地命令行刑队向自己开枪，如果“无内鬼，来点苏联笑话”，现代传媒甚至可以让人不知道拿破仑的失败，可那些败兵呢？他们只能包扎好伤口，掩埋好战友，然后解甲归田，或者继续前行。是的，可以解甲归田了。上了大学，及格万岁，只要你不违纪，不跳楼，课随便翘，游戏随便打，有了外卖更是可以屁股长在椅子上，眼睛长在屏幕上。那谁还努力啊，又有什么事情值得努力呢？我也不知道，但是晚上自己在教室里刷题的时候，为了公派背单词的时候，听身旁的同学骄傲地谈论自己全国闻名的高中母校的时候，我的眼前总是浮现出校长满头白发的那张照片。\n\n只是这些话，无论如何不可能出现在经验介绍会上。那我能说什么呢？不如抚今追昔，指一位教室中间的男生或女生，说当年自己就坐在同样的位置吧。\n\n"},{"slug":"xls-two-years-after-buying-car","filename":"2020-10-18-xls-two-years-after-buying-car.md","date":"2020-10-18","title":".xls | 聊聊买车这两年多","layout":"post","keywords":["doc","xls"],"excerpt":"如题","content":"\n2018 年初，趁着寒假的功夫考了驾照，趁热打铁买了车，是一辆二手的丰田花冠。\n\n最近有个朋友要买车了，知道我有车，所以来打听一下；碰巧我也临时起意想要换车，之前对买车和养车的花费，虽然一直在记账，但是脑子里是一团糨糊，需要理一理。\n\n结果呢，在这篇文章动笔之前，朋友就已经秀出新车的照片了；算完买车的帐之后，我也暂时决定不换车了。所以这篇文章，权当是周更凑数吧。\n\n## 先来算帐\n\n因为隐私的关系，所有价格都是约数，这样可以减小一点点[信息量](https://program-think.blogspot.com/2017/12/howto-cover-your-tracks-10.html)（虽然没什么用就是了）.\n\n与车有关的花费可以按照频率来归类：\n\n- 一次性的：\n    + 汽车本身，给车行的：约 $13,000\n    + 消费税：约 $1,300\n- 每年一次：\n    + 财产税：从第二年开始，年末交，至今只有一次，$300\n- 半年一次：\n    + 保险：大约是个等差数列，$2100 开始，之后每次下降 $200\n    + 保养：没有特殊项目的话，$20 - $30\n- 每月一次：\n    + 加油：车用的少，平均每月一箱油。最贵的时候每次 $30，最便宜的时候（现在）每次 $20 \n- 不定期的：\n    + 为了考驾照租了一辆车：$10\n    + 换驾照、车牌：每次 $20\n    + 换过一次轮胎：$700\n    + 换过一次刹车片：$500\n    + 洗车工具、清洗剂：$50\n    + 停车：在芝加哥两天停掉了接近 $150 :-( 其余至今累计不到 $100，包括在学校停车\n    \n## 再谈感受\n\n### 价格比想象中贵不少\n\n说实话，重新看到帐单的时候我有点不敢相信，虽然来这里的第一天就知道美国的东西标价和税是分开算的，但是我印象里一万三是税后价格。当初买车的预算只有一万元，结果不够，幸好当时爸妈在国内已经起床了，在签合同的当时紧急给我汇了一笔钱。估计是价格太高，花了家里这么多，自己实在惭愧，于是记忆就悄悄地自我修改，帮自己开脱了。\n\n一般而言，美国汽车新车的价格是比国内便宜一点，但并没有江湖传言说的差那么多。国内价格按照官价汇率换成美元，和美国税后价格区别就在误差范围以内了。有次我和几个朋友开车路过一家卖野马的车行，大家讨论起来野马新车的价格，我猜的最准。 ~~当然了，官价汇率和实际购买力也有一点不同，微信公众号上不能多说，说多了号就没了。~~\n\n美国买车便宜，主要在于这里的很多人买的都是二手车，一辆车在新车变成二手车的那一刻起贬值是最快的，五年左右的车价就能跌去一半。同时由于市场成熟，因为信息不对称被车商套路的可能性比国内小很多，有更多的人愿意买二手车。\n\n### 车险，及所谓“华人互坑”\n\n虽然车险价格以一个等差数列稳步下降，但是其实中间换过一家保险公司。头一年半的三次付费是卖车的时候经手的业务员推荐的，看起来像是本地华人经营的一家保险中介，自己没有保险产品，给一些知名度不是那么高的保险公司拉客户。\n\n卖车的小哥是华人，我当时房东的晚辈亲戚。月均 300+，听起来就好像不怎么靠谱是吧，总感觉应验了豆瓣名言“在海外坑中国人最狠的都是自己人”。第一次交保险的时候简直心头在滴血，就连我这种拖延症晚期患者，在一年半以后也坚决换了某 G 字头知名保险公司。结果回过头来看，价格下降的幅度并没有明显改善，基本是汽车折旧和个人信用记录的正常积累。\n\n当初把保险办好，所有的手续就都齐了，第二天直接拿着车行给的文件就把牌照办好了。我去看车的时候是开着考驾照租的车去的，买完车我再开回来，他帮我把新车开到我的公寓，然后打电话让嫂子开车接自己回家。这样一想，更为自己之前以小人之心度君子之腹而羞愧。这次朋友买车本来是想推荐给他的，结果前不久看朋友圈才知道他已经换了工作，有点可惜。\n\n### 我想换车——还是算了\n\n觉得现在反正住得离学校很近，每天去学校也不需要开车，真正用车的机会也就是每周一次踢球、一次去超市，以及不定期的短途瞎逛。这样的用车场景，小车的油耗优势并不明显，出去玩的时候，有时需要走一些石子路，SUV 的通过性有明显的优势。所以有想要换车的打算。\n\n但是，上网看了一些车的报价，标价一万五的都是凤毛麟角，两万以上很普遍。这也正常，毕竟绝大多数的 SUV 和 B 级车同平台，本来就比现在的车大一圈，SUV 本身的功能又有溢价。以我现在的存款，肯定是要先卖旧车再买新车，各种标价之外的成本，再想到各种行政手续也要消耗不少的时间和精力，恐怕只能望而却步。\n"},{"slug":"how-to-spend-life","filename":"2020-07-05-how-to-spend-life.md","date":"2020-07-05","title":".doc | 人生是马尔科夫过程吗？","layout":"post","keywords":["doc"],"excerpt":"最近报名了一个写作班，老师留了作业，命题作文——“我想怎样地度过余生”。","content":"\n最近报名了一个写作班，老师留了作业，命题作文——“我想怎样地度过余生”。\n\n我在电脑上敲下了一句“我想随遇而安地度过余生”，然后抓耳挠腮地度过了三天当时的我的余生，什么也没写下来。\n\n然后，疫情嘛，研究上的事，能在家里做的已经做得差不多了。闲来无事翻翻邮件订阅的论文摘要合辑，看到了一篇讲量子态马尔科夫演化的论文，于是想到了一个很有趣的问题：人生是一个马尔科夫过程吗？\n\n先等一下，马尔科夫过程是什么？\n\n用一个生活中的例子来解释吧。假设我们有一个感兴趣的对象（比如说我现在使用的牙膏的牌子）；这个对象有几种不同的可能性（我去的超市里有两种牌子，我可以但也只能选择其中的一种）；每过一段时间，这个对象有可能变化（每管牙膏用完之后，去超市再买一管，要么换牌子，要么不换）。\n\n重点来了：如果当我在货架面前考虑要买哪个牌子牙膏的时候，只考虑我现在用的是什么牌子，而不考虑上次买牙膏之前那管是什么牌子，不考虑之前任何一段时间用的是什么牌子，那么我使用的牙膏的牌子随时间的变化，就是一个马尔科夫过程。\n\n也就是维基百科上所说的：“未来的状态与任何历史的状态无关，仅与当前状态相关”。\n\n这么一说的话，人生还真的挺像是马尔科夫过程的。\n\n今天认识我的朋友可能想象不出来，我小学的时候还是个很听话的乖孩子。坐我后桌的小豪也很听话，班主任很信任我们几个孩子，经常让我们帮忙干点活儿，平时考试之后改改卷子啊，上面下来检查之前收拾收拾同学们的作业之类的。六年级下学期的某一天，老师放学后又把我们几个人留了下来，给了我们一叠材料，仔细一看，有一摞表格，上面是全班同学姓名和家庭住址的表格，前几天发给每个人回家填了，第二天连同房产证一起交上，房产证很快发回来了，表格在这；还有一张本市本区的地图，道路标的还挺详细的，道路围成的方块上标着不同的数字。我们的任务就是根据家庭住址，把大家的名字和地图上的数字对应起来，填到一张新表上。我和小豪的家有点距离，在地图上的数字也不一样。等我们拿到了不同初中的录取通知书，才后知后觉，当初那些数字代表的就是所谓的学区。高中之后骑车上学，有天早晨，在到校之前的最后一个路口等红灯的时候，眼睛余光觉得旁边等灯的人老是看我，我也看过去，端详许久，是小豪！我们都长出了一口气，不知道是舒气还是叹气。\n\n因为一个学区号，原本要好的朋友再相见，就只能努力注视然后努力回忆，再报以礼貌的微笑了；因为一场中考，因为一场高考，因为考研或是考公务员或是招聘面试，三年、四年、几十年的时间里，我们能做的事情就大体定下来了。至于在这决定未来的考试之前的每一个平凡一天里，我们的生活充实吗，枯燥吗，快乐吗，累吗，见到许久未见的老朋友了吗，不好意思，不太重要。\n\n所以说，把人生当成一个马尔科夫过程的话，一个很自然的推论就是，我只要在这些时间节点上，让自己拥有这些节点所考察的那些成绩，就可以在人生这条长河里一路顺风顺水，幸福美满了。\n\n大一结束的暑假，我们班的导师老史带我们去北京参观几个科研院所，用他的原话说，“见见世面”。从正负电子对撞机里出来的时候是下午，还有点时间，我们就去了北大。北大接待我们的老师是我们热学课本的作者，那是我第一次亲眼见到写教材的人，一种“我也见到大人物了”的自豪感油然而生。这样的参观活动本来也有为将来的保研做广告的意思，作者老师把我们引入一间教室，拿出了准备好的幻灯片。北大嘛，客观地指点指点江山就足以作为广告了。江山指点得差不多了，还没有看到我们学校的名字，老师大约也注意到了：“你们学校啊，还是差了一点。”老史也和我们坐在一起，除了点头也说不出话来。又有同学问，既然已经有这么大的差距了，那该怎么弥补呢？老师面带微笑地说：“人生啊还是很长的，你们现在虽然落后很多，但是一直努力的话，比别人晚个几年十几年，也是有希望达到同样高度的嘛。”我当时自然心里一百个不服，拳头在桌子后面攥得紧紧的。临走的时候，作者老师还问了一句：“我那本课本是写给非专业的课程用的，你们专业用这个，是不是浅了一点啊？”我很幸运，没看到史老师脸上的表情。\n\n反过来说，只要在某一个时间节点上没有做好，之后的人生就可以洗洗睡了。\n\n但是，人生也并不总是能简化成马尔科夫过程的。\n\n乔布斯在斯坦福大学的毕业典礼上做过一个演讲，讲过他读书时候的故事。领养乔布斯的夫妻当初答应了他的生母，一定要让孩子上大学。乔布斯年轻时也不知道父母的艰难，选了里德学院这样一所学费高昂的私立学校，很快就把父母给的钱花光了，只能退学。退学之后没有了学分要求，他得以选一些轻松有趣的课程，比如字体设计。等到后来兜兜转转，他被苹果公司开除，成功建立了 Pixel 动画公司和 NeXT 电脑公司，之后回到了经营不善来到破产边缘的苹果。这时候，之前的字体课派上了用场，苹果的新电脑取得了巨大的成功，优雅的字体居功至伟。\n\n人生并不是一个预先设计好的程序，也不是一台严丝合缝的机器，我们经历过的故事，有的深藏在记忆里，在不经意的时候闪现，击中我们；有的成为心中高悬的苦胆，时时提醒激励着人，去做一些可能徒劳但又不甘心的事情。\n\n北大的故事其实没有结束。当初提问该如何奋起直追的同学转到了数学专业，而一直志在生物的我反而留在了物理圈里。大四的时候，听说北大一个物理和生物的交叉学科项目还有一次补充录取的机会，申请美国学校结果不太满意的我就报了名。面试的一个环节是读一段英文学术论文的节选，然后根据材料回答几个问题。我抽到的文章是关于 microbiome （微生物组）的，老师们知道我的专业背景，本来没打算我回答得出什么问题，没想到我平时读过一些科普文章，对这个话题有些了解，老师的问题都很顺利地回答了出来。他们很意外，问我是怎么积累这些知识的，我很想给他们讲讲三年前那个下午，隔壁系教室里的故事。\n\n又觉得什么也不必讲，于是微笑着谦虚了两句。\n"},{"slug":"parents-visiting","filename":"2020-06-05-parents-visiting.md","date":"2020-06-05","title":".doc | 接机","layout":"post","keywords":["doc"],"excerpt":"今年寒假，疫情引而未发之时，爸妈来美国看我。","content":"\n今年寒假，疫情引而未发之时，爸妈来美国看我。\n\n他们英语不好，担心转机的时候不顺利，所以定了直飞芝加哥的机票，傍晚到，我早上出发开车去接他们。因为是一个人开车，手机定了计时，每隔一两个小时就离开高速停车休息一会儿。\n\n一路基本顺利，除了进城之后。前面几个收费站把硬币花完了，接下来的收费站没带够硬币，又误入人工硬币收费关卡，被收费大妈批了一顿之后滚蛋了，回去之后在网上补缴了费用；到机场之后，想到之前收费站的事，在航站楼里的小卖部买了包巧克力糖，换了一堆零钱；发现停车的航站楼不是爸妈要停靠的那个，导航又不明确，只能开车离开停车场，一边慢行一边看路牌。到了正确的航站楼，距离爸妈的飞机到达还有一个多小时。芝加哥当天极冷，于是也不好在周围闲逛，就只在接机口站着等。\n\n倒是没有着急，盯着出站口被人推开又自己关上的门，呆若木鸡，一种在被人漠视和假装无感于漠视中锻炼出来的，故作少年老成的冷漠表情。一会儿就要见到爸爸妈妈了，我会拥抱他们吗，会一惊一乍地嘘寒问暖吗，会有一股暖意从心底涌上心头吗？\n\n想来本科的时候，爸妈也是这样在等我的。那时候家乡还没有通高铁，去学校的时候坐的是夕发朝至的绿皮车，回家的时候动车票买到邻近的城市，爸妈开车到高铁站接我。有时候在高速的服务区吃饭，有时候他们先吃过了，来的路上买必胜客或者肯德基的套餐，这样我在车上就把午饭解决了。\n\n事情也不是一开始就这么顺利的。第一年寒假的时候，当时那个高铁站也才刚通车不久，出站口的广场和地下通道还扎着脚手架，第一次来这个车站，我有点找不清方向。打电话问他们，我爸习惯说东西南北，我只认识前后左右，指挥了半天又绕回了原地，我爸开始急了，吼了起来。我也不甘示弱，挂了电话，直奔汽车售票处要自己买票回家。拖着行李箱到了站台上，一路上手机一直在响。接了电话，那边爸爸的声音还是很强硬，但明显有一种不敢再发怒的谨慎。这是最容易让人蹬鼻子上脸的，我直接吼了一句“老子就是要让你不爽！”，又把电话挂了。\n\n挂完电话之后就后悔了，真的要自己回家吗？架总要吵完的，回家之后，该怎么收场呢？于是就在周围人的目光中离开站台，脸红得很，也不知道是冻，是怒，还是羞愧。离开站台后给妈妈打电话，重新核对周围的建筑位置，终于在广场去地下停车场的楼梯旁边会合。见面的时候，妈妈刚想说话缓解气氛，我先给了爸爸一个拥抱。然后找了一家餐厅吃饭，回家，比无事发生还更加其乐融融。后来回学校之后，爸爸在网上跟我告状，说妈妈因为这个拥抱嫉妒他，找了他好几次茬。\n\n父母和孩子的关系，在绝大多数时间里都是极不对等的权力关系，而且是总有一天要从一种不对等逆转成另一种不对等的权力关系。我们家和舅舅家住的近，所以常走动。表弟出生的时候，舅舅年纪已经不小了，表弟刚会走路的时候，在我们家小区的草坪上，鬓角已有白发的舅舅在表弟面前S形跑，双臂向后伸，嘴里念着小鸟小鸟飞。高中的语文老师讲课爱跑题，讲李密《陈情表》的时候，他感慨说人的衰老就像是时间的逆转一样，老人越来越像一个孩子，越来越需要子女像当初的父母一样照顾他们。不久，老师请了短假，回来后左臂上多了一块黑色的孝牌。《请回答1988》里面，德善的爸爸很因为总是忽视德善而道歉，说爸爸也是第一次当爸爸。可是，哪有那么容易的道歉呢，孩子也是第一次做孩子，有些愧疚连愧疚的资格都没有，只能在比无事发生还更加其乐融融的气氛里，被时间抛在身后。\n\n广播报出了他们飞机的班次，出站的人流渐渐拥挤又渐渐稀疏，在他们看到我之前，我先看到了他们，对眼前的陌生有些茫然，面有疲倦之色。我接过他们的行李箱，“还顺利吗？”“挺顺利的。”天很冷，出航站楼之后我们都打了哆嗦，快步往停车场去。\n"},{"slug":"betrayal-and-report","filename":"2018-06-14-betrayal-and-report.md","date":"2018-06-14","title":".doc | 也谈告密和告发","layout":"post","keywords":["doc"],"excerpt":"这个问题似乎没什么可谈的，告密是中国价值观里最低等的劣行之一","content":"\n也想谈谈告密的问题。\n\n这个问题似乎没什么可谈的，告密是中国价值观里最低等的劣行之一，也是我爸妈对我从小的一个教育重点，在学校闯了祸要被老师剋，但是敢把同伙供出来，被爸妈知道了得往死里打。告密是一种行为，其背后的本质是背叛，背叛是对别人信任的践踏，只要信任建立得有道理，这种践踏必然是令人不适甚至不齿的，没什么好讨论的。\n\n那就先按下这个话题不表，说我见到的另一个有趣现象。人们在谈起美国和加拿大（尤其是加拿大，也许因为其他方面乏善可陈）的民风淳朴的时候，经常用来举例子的一点就是，人们对于维护社会秩序的积极性，遇见违法行为（比如闯红灯）积极检举。还有就是在体罚还刚要被社会舆论否定的时候流传的故事里，爸妈体罚孩子，结果孩子报警把自己爸妈抓起来了。这算是告密吗，可耻吗？\n\n这两个例子或有意或无意地，忽略了告密和告发的区别。告密的内容应该是一个秘密，一个权力通过正常手段无法取得的证据。这也就意味着，在背叛之前有个过程，就是信任的建立，而且这种信任建立得要有道理。要么是两人有足够的私交，要么是事先明确进行约定，要么社会公德里默认的应当互信的情况，比如说，即便是陌生人，也要相信走在路上擦肩而过之际，对方不会从怀里取出一把匕首来捅你一刀。上面的例子里，报警者跟闯红灯的傻逼不熟，爸妈也只对孩子的抗揍能力有“信任”，所以并不存在背叛，只能算是告发。\n\n那么问题转换一下，告发还是一种为人不齿的行径吗？\n\n之所以要谈这个，是因为最近某选秀节目里，有些选手的粉丝看不惯另一位选手，向某部门举报该选手不符合社会主义核心价值观。霍老爷的公众号发布了一篇《xxxxx：世道变坏是从年轻人用36计开始的》，其中有这么一段话：“无论是权力任性导致的运动式治理也好，虚伪假大空的宣传也好，都必须基于‘告密’的群众基础才能存在，若是没有告密，至少，那些政治运动，只是统治者的一厢情愿，而一旦有了告密者，势必像病毒一样蔓延。”\n\n我们对告密的鄙视，其正义性的一个重要来源是，告密是极权主义控制人的一个重要工具。电影《窃听风暴》里，东德的国家安全部门通过威逼利诱，迫使文化界人士、社会活动积极分子周边的亲人朋友出卖隐私谈话内容，以此作为罪证抓捕审判。具体情节虽经过艺术加工，但这段历史是真实地发生过的。但是就在同一部电影里，当局除了发展眼线，还通过化妆成工人，在维修房屋的时候布设窃听装置来搜集情报。缺少了告密这一个工具，权力就控制不了人了吗？这种对告密的鄙视，和在行贿受贿问题里只谈行贿者是社会的蛀虫，在性工作者和嫖客之间只羞辱前者一样，算是老太太挑柿子——专捡软的捏。\n\n和朋友讨论这个问题的时候，他觉得告发是否应该，主取决于是否符合道德规范，是否出于当事人自己的正义感。然而一则动机实在难以揣测，再者道德规范的流动性又太强，既可以束缚在法律的框架内，又可以附身在狂热的意识形态甚至是宗教之上。宗教改革者胡格诺被教廷宣判火刑的时候，行刑的修女慈眉善目，添柴的动作谦恭优雅，引得绑在柱子上的胡格诺本人都感叹那“神圣的单纯”。威权既然能把触手伸向的素有信任的朋友伙伴之间，想要修改甚至扭转道德，简直轻而易举。\n\n所以，当权力已经膨胀到能吸引人自发检举的时候，还是双手合十地祈祷吧，毕竟除此之外，我们已经没什么能做的事情了。\n"}]]]},"__N_SSG":true}